{"id":"24ift5tuXoYiMci8riNRRn46UVSr","title":"Latest Data breaches","displayTitle":"Latest Data breaches","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":11,"items":[{"title":"4chan hacked, internal data leaked on rival image board","url":"https://databreaches.net/2025/04/15/4chan-hacked-internal-data-leaked-on-rival-image-board/","date":1744729513,"author":"Dissent","guid":23341,"unread":true,"content":"<article>Mikael Thalen reports: The notorious imageboard 4chan is currently inaccessible after hackers appear to have leaked internal data from the website. In a post on Monday evening to the rival imageboard soyjack.party, an anonymous user claimed that a hacker was able to leak website code and the personal information of staff after being in 4chan’s...</article>","contentLength":350,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Most Dangerous Hackers You’ve Never Heard Of","url":"https://databreaches.net/2025/04/15/the-most-dangerous-hackers-youve-never-heard-of/","date":1744718636,"author":"Dissent","guid":23252,"unread":true,"content":"<article>Andy Greenberg, Matt Burgess, and Lily Hay Newman of WIRED report: Made possible through partnership with ThreatLocker Ransomware gangs, email scammers, state-sponsored spies: hacking groups come in all shapes and sizes. There are some we write about quite a bit here at WIRED, who through some combination of audacity, incompetence, or geopolitical importance—or some combination...</article>","contentLength":385,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"China accuses US of launching ‘advanced’ cyberattacks, names alleged NSA agents","url":"https://databreaches.net/2025/04/15/china-accuses-us-of-launching-advanced-cyberattacks-names-alleged-nsa-agents/","date":1744717720,"author":"Dissent","guid":23251,"unread":true,"content":"<article>Laurie Chen, Farah Master and Liz Lee report: China accused the United States National Security Agency (NSA) on Tuesday of launching “advanced” cyberattacks during the Asian Winter Games in February, targeting essential industries. Police in the northeastern city of Harbin said three alleged NSA agents to a wanted list and also accused the University of...</article>","contentLength":362,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The art of restraint: why not every system should be owned","url":"https://databreaches.net/2025/04/15/the-art-of-restraint-why-not-every-system-should-be-owned/","date":1744717712,"author":"Dissent","guid":23250,"unread":true,"content":"<article>Jesse William McGraw writes: Greetings, reader! I want to talk about my former life as a blackhat hacker because it never makes any sense. Many of my rampant hacking campaigns focused on breaking into big servers across several industries but not on seizing the networks by the throat and forcing them to their knees. I...</article>","contentLength":322,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kyiv Region Police Expose Hackers Who Infected Notaries’ Computers with Viruses and Changed Data in State Registries","url":"https://databreaches.net/2025/04/15/kyiv-region-police-expose-hackers-who-infected-notaries-computers-with-viruses-and-changed-data-in-state-registries/","date":1744717676,"author":"Dissent","guid":23249,"unread":true,"content":"<article>As reported on dev.ua: In the Kyiv region, police detained a group of hackers who gained remote access to the devices of state bailiffs and private notaries and, for a fee, illegally removed encumbrances imposed on citizens’ property. According to&nbsp;the Cyber ​​Police, four suspects, one of whom was a private contractor, set up a scheme...</article>","contentLength":346,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dialysis firm DaVita hit by ransomware attack","url":"https://databreaches.net/2025/04/14/dialysis-firm-davita-hit-by-ransomware-attack/","date":1744634180,"author":"Dissent","guid":22866,"unread":true,"content":"<article>Reuters reports: DaVita said on Monday it had become aware of a ransomware incident that has encrypted some elements of its network, prompting the dialysis firm to implement measures to limit the effect of the breach. The company discovered the cyberattack on Saturday, but added it “cannot estimate the duration or extent of the disruption...</article>","contentLength":345,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"IAF jet on Myanmar relief operation faced cyber attack in air","url":"https://databreaches.net/2025/04/14/iaf-jet-on-myanmar-relief-operation-faced-cyber-attack-in-air/","date":1744628841,"author":"Dissent","guid":22845,"unread":true,"content":"<article>This is the stuff some nightmares are made of. Times of India reports from New Delhi: Indian aircraft deployed to provide rescue and relief supplies to quake-hit Myanmar, under Operation Brahma since March 29, have faced cyber-attacks in the form of “spoofing” of their satellite-based GPS signals. Sources said it’s difficult to establish the forces...</article>","contentLength":359,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Smiley calls for data sharing once Providence gets its schools back from state","url":"https://databreaches.net/2025/04/14/smiley-calls-for-data-sharing-once-providence-gets-its-schools-back-from-state/","date":1744628836,"author":"Dissent","guid":22844,"unread":true,"content":"<article>Alexander Castro reports; The City of Providence wants to investigate consolidating certain data sources across municipal and school district networks when its schools return from state to local control. The district superintendent is concerned about the plan’s finer points when it comes to data sharing. Some systems get too complex. Providence Mayor Brett Smiley thinks...</article>","contentLength":377,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Queensland has a new breach notification law going into effect July 1, 2025","url":"https://databreaches.net/2025/04/14/queensland-has-a-new-breach-notification-law-going-into-effect-july-1-2025/","date":1744627845,"author":"Dissent","guid":22843,"unread":true,"content":"<article>Claire Doneley reports: On 4 December 2023, the Queensland Parliament gave assent to the&nbsp;Information Privacy and Other Legislation Amendment Act 2023&nbsp;(Qld) (Act), with privacy reforms to the&nbsp;Information Privacy Act 2009&nbsp;(Qld) (IP Act) to commence 1 July 2025. You can read more about that&nbsp;here. In Queensland it has not been compulsory for agencies to notify the...</article>","contentLength":370,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Psychiatric documents with sensitive patient info found ‘loosely blown about’ near Regina medical clinic","url":"https://databreaches.net/2025/04/14/psychiatric-documents-with-sensitive-patient-info-found-loosely-blown-about-near-regina-medical-clinic/","date":1744627819,"author":"Dissent","guid":22842,"unread":true,"content":"<article>Brandon Harder reports: The private records of patients at the&nbsp;Elphinstone Medical Clinic were just laying loose on the ground in a nearby alley and an empty lot. According to a report from Saskatchewan’s Information and Privacy Commissioner&nbsp;(SIPC), a person referred to as “Individual A” saw a Facebook post on Oct. 27, 2024 that referenced patient...</article>","contentLength":360,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Another entity reports the Nationwide Recovery Service data breach of 2024","url":"https://databreaches.net/2025/04/14/another-entity-reports-the-nationwide-recovery-service-data-breach-of-2024/","date":1744627330,"author":"Dissent","guid":22841,"unread":true,"content":"<article>Rhea Medical Center has issued a notification to more than 8,000 people whose personal and protected health information was caught up in a breach at Nationwide Recovery Services last July. Nationwide Recovery Services is a debt collection agency that the Tennessee medical center uses. At the time of the breach, they reportedly had data from...</article>","contentLength":345,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["databreach"]}