{"id":"24ift5tuXoYiMci8riNRRn46UVSr","title":"Latest Data breaches","displayTitle":"Latest Data breaches","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"Ukrainian Railways hit by ‘large-scale, targeted cyberattack’","url":"https://databreaches.net/2025/03/24/ukrainian-railways-hit-by-large-scale-targeted-cyberattack/","date":1742827808,"author":"Dissent","guid":13933,"unread":true,"content":"<article>Martin Fornusek reports: Ukrainian Railways (Ukrzaliznytsia) was the target of a large-scale and sophisticated cyberattack, the company said on March 24, adding that the restoration of all systems is ongoing. “Ukrzaliznytsia’s online systems have been subjected to a large-scale, targeted cyberattack,” the state railway operator said in a statement. The company’s website and application became...</article>","contentLength":406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Over 3 million applicants’ data leaked on NYU’s website","url":"https://databreaches.net/2025/03/23/over-3-million-applicants-data-leaked-on-nyus-website/","date":1742729300,"author":"Dissent","guid":13932,"unread":true,"content":"<article>Dharma Niles, Krish Dev and Yezen Saadah report: A hacker took over NYU’s website for at least two hours Saturday morning to expose over 3 million applicants’ names, test scores, majors and zip codes, as well as information related to family members and financial aid dating back to at least 1989. The university’s website was...</article>","contentLength":335,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trump Administration Begins Shifting Cyberattack Response to States","url":"https://databreaches.net/2025/03/23/trump-administration-begins-shifting-cyberattack-response-to-states/","date":1742727743,"author":"Dissent","guid":13931,"unread":true,"content":"<article>Angus Loten and James Rundle report: The Trump administration wants state and local governments to play a bigger role in protecting water utilities, ports and other critical infrastructure from cyberattacks. In an executive order signed Tuesday, President Trump directed White House senior security advisers to draw up a national resilience plan to protect critical infrastructure...</article>","contentLength":383,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Union County’s computer network breached, personal information accessed","url":"https://databreaches.net/2025/03/23/union-countys-computer-network-breached-personal-information-accessed/","date":1742727670,"author":"Dissent","guid":13930,"unread":true,"content":"<article>John Beauge reports: Personal information including Social Security numbers may be at risk as the result of unauthorized access and acquisition of data stored on a Pennsylvania county’s computer network. “We determined that the cyber criminals took certain data from our network, which included personally identifiable information,” the Union County commissioners revealed Friday. “The affected...</article>","contentLength":405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Attorney General James Secures $975,000 from Auto Insurance Company over Data Breach","url":"https://databreaches.net/2025/03/23/attorney-general-james-secures-975000-from-auto-insurance-company-over-data-breach/","date":1742727634,"author":"Dissent","guid":13929,"unread":true,"content":"<article>From a March 20 press release from NY Attorney General Letitia James: NEW YORK – New York Attorney General Letitia James today&nbsp;secured $975,000 in penalties from Root, an auto insurance company, for failing to protect the personal information of approximately 45,000 New Yorkers. The data breach was part of an industry-wide campaign to steal consumers’...</article>","contentLength":361,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["databreach"]}