{"id":"24ift5tuXoYiMci8riNRRn46UVSr","title":"Latest Data breaches","displayTitle":"Latest Data breaches","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Oracle’s statement to customers is still raising questions about its disclosure and transparency","url":"https://databreaches.net/2025/04/09/oracles-statement-to-customers-is-still-raising-questions-about-its-disclosure-and-transparency/","date":1744214545,"author":"Dissent","guid":21191,"unread":true,"content":"<article>Today’s reminder to “Tell the truth, or someone will tell it for you,”&nbsp; courtesy of Kevin Beaumont: Oracle have finally issued to a written notification to customers about their cybersecurity incident. They are again wordsmithing. OCI is a different org unit in Oracle to Oracle Classic – they’re denying a different scope. Kevin also commented:...</article>","contentLength":359,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CISA, experts warn of Crush file transfer attacks after a controversial disclosure","url":"https://databreaches.net/2025/04/09/cisa-experts-warn-of-crush-file-transfer-attacks-after-a-controversial-disclosure/","date":1744210642,"author":"Dissent","guid":21167,"unread":true,"content":"<article>Jonathan Greig reports on another vulnerability affecting file transfer software that has been exploited soon after disclosure. In this case, though, there’s some contentious statements about responsible disclosure or lack thereof. Federal cybersecurity officials as well as incident responders at cyber companies say hackers are exploiting a vulnerability within the popular file transfer tool Crush....</article>","contentLength":406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"MrBeast sues former employee for stealing confidential files and installing hidden cameras in company offices","url":"https://databreaches.net/2025/04/09/mrbeast-sues-former-employee-for-stealing-confidential-files-and-installing-hidden-cameras-in-company-offices/","date":1744210616,"author":"Dissent","guid":21166,"unread":true,"content":"<article>Yet another reminder of the insider threat. As seen in The Express Tribune: YouTube superstar Jimmy “MrBeast” Donaldson has filed a lawsuit against former employee Leroy Nabors, alleging theft of confidential company data and unauthorized surveillance. As reported by&nbsp;Dexerto, the legal complaint accuses Nabors of misappropriating trade secrets, breaching his employment contract, and secretly recording...</article>","contentLength":412,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Fall River schools chief: No insurance for cyberattack; says computer system remains down","url":"https://databreaches.net/2025/04/09/fall-river-schools-chief-no-insurance-for-cyberattack-says-computer-system-remains-down/","date":1744210610,"author":"Dissent","guid":21165,"unread":true,"content":"<article>Dan Medeiros and Emily Scherny report: The city’s public school computers will be down for the rest of the week&nbsp;after a cybersecurity attack infiltrated the district’s internal system&nbsp;— and a solution may cost the School Department out of pocket. At a joint meeting of the School Committee and City Council on Tuesday afternoon, Superintendent Tracy...</article>","contentLength":360,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"2024 Year in Review: Data Breach Litigation","url":"https://databreaches.net/2025/04/09/2024-year-in-review-data-breach-litigation/","date":1744207641,"author":"Dissent","guid":21141,"unread":true,"content":"<article>Seen at Wilmer Hale: One of the main risks for a company in the event of a data breach is the threat of litigation. Data breach litigation continued to proliferate in 2024, as it has in prior years. In the past year, plaintiffs continued to seek relief following data breaches under state common-law doctrines, and...</article>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"E-ZPass toll payment texts return in massive phishing wave","url":"https://databreaches.net/2025/04/08/e-zpass-toll-payment-texts-return-in-massive-phishing-wave/","date":1744112370,"author":"Dissent","guid":20493,"unread":true,"content":"<article>Bill Toulas reports: An ongoing phishing campaign impersonating E-ZPass and other toll agencies has surged recently, with recipients receiving multiple iMessage and SMS texts to steal personal and credit card information. The messages embed links that, if clicked, take the victim to a phishing site impersonating&nbsp;E-ZPass, The Toll Roads, FasTrak, Florida Turnpike,&nbsp;or another toll authority...</article>","contentLength":396,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"When the victimizers become the victims…. RansomHub the victim of a takeover?","url":"https://databreaches.net/2025/04/07/when-the-victimizers-become-the-victims-ransomhub-the-victim-of-a-takeover/","date":1744048657,"author":"Dissent","guid":20151,"unread":true,"content":"<article>In February, RansomHub was described as the leading Ransomware-as-a-Service group and as a pervasive threat to critical sectors. Weeks later, Trend Micro analyzed SocGholish’s MaaS framework and its role in deploying RansomHub ransomware. RansomHub was clearly developing and making a significant impact in the ransomware ecosystem. But in the blink of an eye, it seemed,...</article>","contentLength":376,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kaiser fires security exec amid disputed allegations involving a police database breach","url":"https://databreaches.net/2025/04/07/kaiser-fires-security-exec-amid-disputed-allegations-involving-a-police-database-breach/","date":1744039237,"author":"Dissent","guid":20055,"unread":true,"content":"<article>Jakob Emerson reports on what is a disputed claim of insider-wrongdoing: Kaiser Permanente has terminated its national director of corporate security investigations, Craig Chew, amid allegations he received confidential data from a California criminal database accessed by an Oakland police officer, the&nbsp;Mercury News&nbsp;reported April 6. Mr. Chew, a former police officer, was fired along with...</article>","contentLength":395,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["databreach"]}