{"id":"25JnLB7bCaiYJ","title":"Tech News","displayTitle":"Tech News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":52,"items":[{"title":"Nvidia’s AI empire: A look at its top startup investments","url":"https://techcrunch.com/2025/03/16/nvidias-ai-empire-a-look-at-its-top-startup-investments/","date":1742137546,"author":"Marina Temkin","guid":55,"unread":true,"content":"<p>Over the last two years, Nvidia has used its ballooning fortunes to invest in over 80 AI startups. Here are the giant semiconductor's largest investments.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":217,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Arm Changing Linux Default To Costly \"KPTI\" Mitigation For Some Newer CPUs","url":"https://www.phoronix.com/news/Arm-Linux-CVE-2024-7881-KPTI","date":1742135880,"author":"Michael Larabel","guid":465,"unread":true,"content":"<article>For some newer Arm core designs, Arm is changing the Linux kernel to defaulting to enabling Kernel Page Table Isolation \"KPTI\" if not running on a new firmware version in order to properly mitigate a recently disclosed CPU security issue. This change has been queued up and is expected to change the default with the upcoming Linux 6.15 kernel...</article>","contentLength":346,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cybersecurity Alert Warns of 300 Attacks with 'Medusa' Ransomware","url":"https://yro.slashdot.org/story/25/03/15/2055230/cybersecurity-alert-warns-of-300-attacks-with-medusa-ransomware?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742135640,"author":"EditorDavid","guid":165,"unread":true,"content":"A ransomware-as-a-service variant called \"Medusa\" has claimed over 300 victims in \"critical infrastructure sectors\" (including medical), according to an joint alert from CISA, the FBI, and the Multi-State Information Sharing Analysis Center. \n\nAnd that alert reminds us that Medusa is a globe-spanning operation that recruits third-party affiliates to plant ransomware and negotiate with victims, notes the Register. \"Even organizations that have good ransomware recovery regimes, meaning they don't need to unscramble encrypted data as they have good backups and fall-back plans, may consider paying to prevent the release of their stolen data, given the unpleasant consequences that follow information leaks.\n\nMedusa actors also set a deadline for victims to pay ransoms and provide a countdown timer that makes it plain when stolen info will be sprayed across the internet. If victims cough up $10,000 in cryptocurrency, the crims push the deadline forward by 24 hours. \n\nThe advisory reveals one Medusa actor has taken things a step further. \"FBI investigations identified that after paying the ransom, one victim was contacted by a separate Medusa actor who claimed the negotiator had stolen the ransom amount already paid,\" the advisory states. That separate actor then \"requested half of the payment be made again to provide the 'true decryptor',\" the advisory states, describing this incident as \"potentially indicating a triple extortion scheme.\" \n\nThe security groups' advisory stresses that they \"do not encourage paying ransoms as payment does not guarantee victim files will be recovered. Furthermore, payment may also embolden adversaries to target additional organizations...\" (But \"Regardless of whether you or your organization have decided to pay the ransom, FBI, CISA, and MS-ISAC urge you to promptly report ransomware incidents...) \n\nBesides updating software and operating systems, the alert makes these recommendations for organizations:\n\nRequire VPNs (or jump hosts) for remote network access\nBlock remote access from unknown/untrusted origins, and disable unused ports\n Segment networks to help prevent the spread of ransomware\nUse a networking monitoring tool to spot and investigate abnormal activity — including lateral movement (using endpoint detection and response tools). Log all network traffic, and monitor it for unauthorized scanning and access attempts.\nCreate recovery plans with encrypted offline backups of sensitive/proprietary data and servers\nRequire multifactor authentication, use strong (and long) passwords, and \"consider not requiring frequently recurring password changes, as these can weaken security.\" (Also audit access control following the principle of least privilege, and watch for new and/or unrecognized accounts.)\nDisable command-line and scripting activities and permissions.","contentLength":2837,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Huawei Matebook E Go Laptops To Be Better Supported With Linux 6.15","url":"https://www.phoronix.com/news/Huawei-Matebook-E-Go-EC-Linux","date":1742134689,"author":"Michael Larabel","guid":464,"unread":true,"content":"<article>For those that happen to have a Huawei Matebook E Go 2-in-1 laptop or have been considering these ARM laptops, the upcoming Linux 6.15 kernel will be better supporting these devices thanks to a new driver set to be merged...</article>","contentLength":224,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Photo calorie app Cal AI, downloaded over a million times, was built by two teenagers","url":"https://techcrunch.com/2025/03/16/photo-calorie-app-cal-ai-downloaded-over-a-million-times-was-built-by-two-teenagers/","date":1742133600,"author":"Julie Bort","guid":54,"unread":true,"content":"<p>Cal AI has generated over 5 million downloads in 8 months, it says. Founders Zach Yadegari and Henry Langmack are just 18.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ocean Levels Rise to a 30-Year High - and Faster Than Expected","url":"https://news.slashdot.org/story/25/03/15/0426222/ocean-levels-rise-to-a-30-year-high---and-faster-than-expected?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742124840,"author":"EditorDavid","guid":164,"unread":true,"content":"The Washington Post reports:\nOceans last year reached their highest levels in three decades — with the rate of global sea level rise increasing around 35% higher than expected, according to a NASA-led analysis published Thursday... Last year's rate of average global sea level rise was 0.23 inches per year, higher than the expected 0.17 inches per year, NASA said in a news release. \n\nThe rate of global sea level rise follows a trend of rapidly increasing rates over the past 30 years. From 1993 to 2023, the rate of global sea level rise doubled, increasing from 0.08 inches per year to 0.18 inches, another NASA-led study showed. Overall, the global sea level has climbed by 4 inches since 1993. \n\nMore details from ABC News:\n\n Climate change was a major driver to an unexpected level of sea level rise in 2024, according to a new NASA analysis... The majority of the difference between predicted and actual sea level rise was attributed to thermal expansion — or the ocean waters expanding as they warm, researchers said. An unusual amount of ocean warming, combined with meltwater from land-based ice such as glaciers, led to the increase of sea level rise last year, according to NASA. \n\nAbout two-thirds of sea level rise in recent years has resulted from the melting of ice sheets and glaciers, with a third coming from thermal expansion, according to NASA. In 2024, those metrics flipped, with two-thirds of the rise attributed to expanding ocean water and one-third attributed to contributions from melting ice. \"With 2024 as the warmest year on record, Earth's expanding oceans are following suit, reaching their highest levels in three decades,\" said Nadya Vinogradova Shiffer, head of physical oceanography programs and the Integrated Earth System Observatory at NASA... Human-amplified climate change is the primary cause for present-day rising sea levels, climate research shows.","contentLength":1899,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.14-rc7 To Support A Few More Gaming Controllers","url":"https://www.phoronix.com/news/Linux-6.14-rc7-More-Controllers","date":1742122881,"author":"Michael Larabel","guid":463,"unread":true,"content":"<article>Ahead of the Linux 6.14-rc7 kernel release later today, a set of input subsystem updates were merged overnight that add in support for a few more gaming controllers...</article>","contentLength":167,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"One Line Of Code Optimizes F2FS Performance For Small Multi-Threaded Writes","url":"https://www.phoronix.com/news/F2FS-Optimize-MT-Small-Writes","date":1742121525,"author":"Michael Larabel","guid":462,"unread":true,"content":"<article>An SK engineer has posted a Flash-Friendly File-System (F2FS) driver optimization for Linux that one line of code changed is helping with performance especially for multi-threaded workloads involving small writes to SSD storage...</article>","contentLength":230,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux Kernel's Rust Support Being Expanded To HID Drivers","url":"https://www.phoronix.com/news/Linux-Rust-HID-Drivers-Patches","date":1742120860,"author":"Michael Larabel","guid":461,"unread":true,"content":"<article>A set of patches were posted to the Linux kernel mailing list this week that are working on initial Rust programming language abstractions for enabling HID device driver development...</article>","contentLength":184,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How AI is Learning to Read DNA and Sound","url":"https://hackernoon.com/how-ai-is-learning-to-read-dna-and-sound?source=rss","date":1742119202,"author":"Rendering Technology Breakthroughs","guid":118,"unread":true,"content":"<article> sequence length warmup for these pretraining experiments. We later found that SLW did not help noticeably for audio pretraining at similar lengths (Section 4.4), and it is possible that it is not necessary for DNA pretraining either.\" /&gt;</article>","contentLength":238,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Amazon Forest Felled To Build Road For Climate Summit","url":"https://news.slashdot.org/story/25/03/16/0136229/amazon-forest-felled-to-build-road-for-climate-summit?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742110440,"author":"EditorDavid","guid":163,"unread":true,"content":"\"A new four-lane highway cutting through tens of thousands of acres of protected Amazon rainforest is being built for the COP30 climate summit,\" reports the BBC, \"in the Brazilian city of Belém.\" \nThe highway will ease traffic into the city, which will host over 50,000 people at the conference this November:\nThe state government touts the highway's \"sustainable\" credentials, but some locals and conservationists are outraged at the environmental impact... Along the partially built road, lush rainforest towers on either side — a reminder of what was once there. Logs are piled high in the cleared land which stretches more than 13km (8 miles) through the rainforest into Belém. \n\nDiggers and machines carve through the forest floor, paving over wetland to surface the road which will cut through a protected area... The road leaves two disconnected areas of protected forest. Scientists are concerned it will fragment the ecosystem and disrupt the movement of wildlife... \n\nThe state government of Pará had touted the idea of this highway, known as Avenida Liberdade, as early as 2012, but it had repeatedly been shelved because of environmental concerns. Now a host of infrastructure projects have been resurrected or approved to prepare the city for the COP summit. \nBut on the bright side, Adler Silveira, the state government's infrastructure secretary, said the highway would have wildlife crossings for animals to pass over, as well as climate-friendly bike lanes and solar-powered lighting...","contentLength":1508,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ask Slashdot: Where Are the Open-Source Local-Only AI Solutions?","url":"https://ask.slashdot.org/story/25/03/16/015209/ask-slashdot-where-are-the-open-source-local-only-ai-solutions?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742096040,"author":"EditorDavid","guid":162,"unread":true,"content":"\"Why can't we each have our own AI software that runs locally,\" asks long-time Slashdot reader BrendaEM — and that doesn't steal the work of others. \n\nImagine a powerful-but-locally-hosted LLM that \"doesn't spy... and no one else owns it.\"\n We download it, from souce-code if you like, install it, if we want. And it assists: us... No one gate-keeps it. It's not out to get us... \n\nAnd this is important: because no one owns it, the AI software is ours and leaks no data anywhere — to no one, no company, for no political nor financial purpose. No one profits — but you! \n\nTheir longer original submission also asks a series of related questions — like why can't we have software without AI? (Along with \"Why is AMD stamping AI on local-processors?\" and \"Should AI be crowned the ultimate hype?\") But this question seems to be at the heart of their concern. \"What future will anyone have if anything they really wanted to do — could be mimicked and sold by the ill-gotten work of others...?\" \n\n\"Could local, open-source, AI software be the only answer to dishearten billionaire companies from taking and selling back to their customers — everything we have done? Could we not...instead — steal their dream?!\" \n\nShare your own thoughts and answers in the comments. Where are the open-source, local-only AI solutions?","contentLength":1329,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Firefly's 'Athena' Lander Watched Friday's Eclipse - from the Moon","url":"https://science.slashdot.org/story/25/03/15/2217247/fireflys-athena-lander-watched-fridays-eclipse---from-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742088840,"author":"EditorDavid","guid":161,"unread":true,"content":"\"For the first time in history, a privately operated lunar lander has captured images of a total eclipse from the Moon's surface,\" reports Daily Galaxy. \n\nWhile the Athena lunar lander tipped over and ended its mission, elsewhere on the moon Firefly Aerospace's Blue Ghost lunar lander \"continues to beam home incredible imagery,\" writes Space.com, and since its landing on March 2 \"has been sending us stunning photos and videos...\" A new video of Blue Ghost's moon-side view captures the eerie red light on the moon (caused by sunlight refracting through the atmosphere over the edges of the earth). \"Blue Ghost turns red!\" Firefly writes on their mission updates page. \n\nA SpaceX photographer also captured the eclipse as it happened over a Falcon 9 rocket waiting to launch to the International Space Station, in a remarkable time-lapse photograph. \n\nAnd Space.com collects more interesting lunar-eclipse photos taken from around the world, including Appin, Scotland; Canberra, Australia; and Palm Springs, California...","contentLength":1024,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"VC Aileen Lee highlights how the broader investor exodus is worsening woes for unicorn companies","url":"https://techcrunch.com/2025/03/15/vc-aileen-lee-highlights-how-the-broader-investor-exodus-is-worsening-woes-for-unicorn-companies/","date":1742088647,"author":"Connie Loizos","guid":53,"unread":true,"content":"<p>In this week’s episode of the StrictlyVC Download podcast, veteran VC Aileen Lee was direct about a major consequence of the recent boom-and-bust cycle: many companies stuck in limbo aren’t just struggling to regain their footing after raising too much money at unsustainable valuations; they’ve also lost the champions who once backed them. Lee was […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":424,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Joby Aviation and Virgin Atlantic partner to launch electric air taxis in the UK","url":"https://techcrunch.com/2025/03/15/joby-aviation-and-virgin-atlantic-partner-to-launch-electric-air-taxis-in-the-uk/","date":1742083260,"author":"Rebecca Bellan","guid":52,"unread":true,"content":"<p>Joby Aviation is partnering with Virgin Atlantic to launch electric air taxis in the U.K., marking the seventh country in which the startup hopes to one day commercialize. Joby, which went public in 2021 via special purpose acquisition merger, did not provide a timeline for when it plans to launch its partnership with Virgin in […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":398,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cloudflare Accused of Blocking Niche Browsers","url":"https://tech.slashdot.org/story/25/03/15/236215/cloudflare-accused-of-blocking-niche-browsers?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742082480,"author":"EditorDavid","guid":160,"unread":true,"content":"Long-time Slashdot reader BenFenner writes: For the third time in recent memory, CloudFlare has blocked large swaths of niche browsers and their users from accessing web sites that CloudFlare gate-keeps. In the past these issues have been resolved quickly (within a week) and apologies issued with promises to do better. (See 2024-03-11, 2024-07-08, and 2025-01-30.) \n\nThis time around it has been over six weeks and CloudFlare has been unable or unwilling to fix the problem on their end, effectively stalling any progress on the matter with various tactics including asking browser developers to sign overarching NDAs. \n\nThat last link is an update posted today by Pale Moon's main developer:\n\n\n\nOur current situation remains unchanged: CloudFlare is still blocking our access to websites through the challenges, and the captcha/turnstile continues to hang the browser until our watchdog terminates the hung script after which it reloads and hangs again after a short pause (but allowing users to close the tab in that pause, at least). To say that this upsets me is an understatement. Other than deliberate intent or absolute incompetence, I see no reason for this to endure. Neither of those options are very flattering for CloudFlare.\n\nI wish I had better news.\n\n \n\nIn a comment, Slashdot reader BenFenner shares a list posted by Pale Moon's developer of reportedly affected browsers:\n\n\nPale MoonBasiliskWaterfoxFalkonSeaMonkeyVarious Firefox ESR flavorsThorium (on some systems)Ungoogled ChromiumK-MeleonLibreWolfMyPal 68Otter browser\nSlashdot reader Z00L00K speculates that \"this is some kind of anti-bot measure that fails. I suspect that the reason for them wanting a NDA to be signed is to prevent ways to circumvent the anti-bot measures...\"","contentLength":1752,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Debian 12.10 Released With More Bugs Fixed & Security Updates","url":"https://www.phoronix.com/news/Debian-12.10-Released","date":1742081421,"author":"Michael Larabel","guid":460,"unread":true,"content":"<article>Debian 12.10 is out today as the newest routine media refresh for the Debian 12 \"Bookworm\" Linux distribution release...</article>","contentLength":120,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"340 European Cities Restrict Usage of Cars","url":"https://news.slashdot.org/story/25/03/15/056253/340-european-cities-restrict-usage-of-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742075280,"author":"EditorDavid","guid":159,"unread":true,"content":"Cities in Europe \"are dramatically scaling back their relationship with the car,\" reports the Washington Post:\n\n They are removing parking spaces and creating dedicated bike lanes. They are installing cameras at the perimeter of urban centers and either charging the most-polluting vehicles or preventing them from entering. Some are going so far as to put entire neighborhoods off-limits to vehicles. In Norway, Oslo promotes \"car-free livability.\" Paris Mayor Anne Hidalgo touts the \"end of car dependence.\" And while those ideas might sound radical to car-loving Americans, they are fast becoming the norm across the Atlantic, where 340 European cities and towns — home to more than 150 million people — have implemented some kind of restrictions on personal car usage... \n\n[V]irtually every major European city is imposing some kind of rule. Milan has a system similar to New York's, charging for access to the city core — while entirely banning older, highly polluting vehicles. London charges vehicles that don't meet emissions standards, in what it calls the \"largest clean-air zone in the world.\" The programs are not just the purview of liberal Western Europe: Warsaw, Poland, and Sofia, Bulgaria, recently adopted similar schemes. Even little Italian villages have added vehicle restrictions to reinforce their historic feel. And the Netherlands just broke ground on a 12,000-person neighborhood that will be entirely car-free. The neighborhood, known as Merwede, will be connected by public transport to Utrecht, a medium-size city that — perhaps no surprise — has a low-emissions zone of its own... \n\n Perhaps the most elaborate and transformative effort has come in Paris, where Anne Hidalgo was elected mayor in 2014. Since then, Paris has banned the most-polluting vehicles from the city, eliminated 50,000 parking spaces and added hundreds of miles of bike lanes. It turned a bank of the Seine from a busy artery into a pedestrian zone, and closed off the famed Rue de Rivoli to traffic... Journeys by car in Paris have dropped by about 45 percent since 1990. The city has now become a source for striking before-and-after photos: of clogged streets that have transitioned into tree-lined areas where people can walk and play. \nIn London government officials say inhalable particular matter has fallen, according to the article, while combustion-produced nitrogen dioxide \"is 53% lower than it would have been without the restrictions.\"","contentLength":2462,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Elon Musk Says SpaceX's First Mission to Mars Will Launch Next Year","url":"https://science.slashdot.org/story/25/03/15/1947252/elon-musk-says-spacexs-first-mission-to-mars-will-launch-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742070840,"author":"EditorDavid","guid":158,"unread":true,"content":"\"SpaceX founder Elon Musk has said his Starship rocket will head to Mars by the end of next year,\" writes the BBC, \"as the company investigates several recent explosions in flight tests.\"\n\nHuman landings could begin as early as 2029 if initial missions go well, though \"2031 was more likely\", he added in a post on his social media platform X... \n\nThe billionaire said in 2020 that he remained confident that his company would land humans on Mars six years later. In 2024, he said he would launch the first Starships to Mars in 2026, with plans to send crewed flights in four years. \nMusk has said that the coming Mars mission would carry the Tesla humanoid robot \"Optimus\", which was shown to the public last year.","contentLength":715,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Amazon’s Echo will send all voice recordings to the cloud, starting March 28","url":"https://techcrunch.com/2025/03/15/amazons-echo-will-send-all-voice-recordings-to-the-cloud-starting-march-28/","date":1742068066,"author":"Anthony Ha","guid":51,"unread":true,"content":"<p>Amazon Echo users will no longer have the option to process their Alexa requests locally, which means all of their voice recordings will be sent to the company’s cloud. Ars Technica reports that on Friday, Amazon sent an email to customers who have “Do Not Send Voice Recordings” enabled on their Echo smart speakers and […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":395,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is Our Universe Trapped Inside a Black Hole?","url":"https://science.slashdot.org/story/25/03/15/1923253/is-our-universe-trapped-inside-a-black-hole?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742067240,"author":"EditorDavid","guid":157,"unread":true,"content":"\"Is everything we see around us is sealed within a black hole?\" asks Space.com. \n\nBecause here's the thing. The $10 billion James Webb Space telescope (in operation since 2022) \"has found that the vast majority of deep space and, thus the early galaxies it has so far observed, are rotating in the same direction. While around two-thirds of galaxies spin clockwise, the other third rotates counter-clockwise.\"\n\nIn a random universe, scientists would expect to find 50% of galaxies rotating one way, while the other 50% rotate the other way. This new research suggests there is a preferred direction for galactic rotation... \"It is still not clear what causes this to happen, but there are two primary possible explanations,\" team leader Lior Shamir, associate professor of computer science at the Carl R. Ice College of Engineering, said in a statement. \"One explanation is that the universe was born rotating. \n\n\"That explanation agrees with theories such as black hole cosmology, which postulates that the entire universe is the interior of a black hole. \n\n\"But if the universe was indeed born rotating, it means that the existing theories about the cosmos are incomplete.\" Black hole cosmology, also known as \"Schwarzschild cosmology,\" suggests that our observable universe might be the interior of a black hole itself within a larger parent universe. The idea was first introduced by theoretical physicist Raj Kumar Pathria and by mathematician I. J. Good. It presents the idea that the \"Schwarzchild radius,\" better known as the \"event horizon,\" (the boundary from within which nothing can escape a black hole, not even light) is also the horizon of the visible universe. \nThe article cites a theory by Polish theoretical physicist Nikodem Poplawski of the University of New Haven that ultimately black holes don't compress indefinitely into a singularity. \"The matter instead reaches a state of finite, extremely large density, stops collapsing, undergoes a bounce like a compressed spring, and starts rapidly expanding,\" Poplawski explained to Space.com...\nThe scientist continued by adding that rapid recoil after such a big bounce could be what has led to our expanding universe, an event we now refer to as the Big Bang... \"I think that the simplest explanation of the rotating universe is the universe was born in a rotating black hole.\" \nTeam leader Shamir offers another theory: that we just need to re-calibrate our distance measurements for the deep universe. (Which could also explain the difference in the expansion rates in the universe \"and the large galaxies that according to the existing distance measurements are expected to be older than the universe itself.\")","contentLength":2684,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to watch Nvidia GTC 2025, including CEO Jensen Huang’s keynote","url":"https://techcrunch.com/2025/03/15/how-to-watch-nvidia-gtc-2025-including-ceo-jensen-huangs-keynote/","date":1742065166,"author":"Kyle Wiggers","guid":50,"unread":true,"content":"<p>GTC, Nvidia’s biggest conference of the year, will return this week, with the biggest announcements probably coming Tuesday. If you can’t make it in person, don’t sweat it. TechCrunch will be on the ground covering the major developments. Many of the biggest presentations, talks, and panels will be livestreamed as well. The conference starts Monday, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":426,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Nvidia GTC 2025: What to expect from this year’s show","url":"https://techcrunch.com/2025/03/15/nvidia-gtc-2025-what-to-expect-from-this-years-show/","date":1742065049,"author":"Kyle Wiggers","guid":49,"unread":true,"content":"<p>GTC, Nvidia’s biggest conference of the year, begins Monday and runs till Friday in San Jose. TechCrunch will be on the ground covering the news as it happens — and we’re expecting a healthy dose of announcements. CEO Jensen Huang will give a keynote address at the SAP Center on Tuesday at 10 a.m. Pacific, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":382,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Last Year Waymo's Autonomous Vehicles Got 589 Parking Tickets in San Francisco","url":"https://tech.slashdot.org/story/25/03/15/0546205/last-year-waymos-autonomous-vehicles-got-589-parking-tickets-in-san-francisco?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742063640,"author":"EditorDavid","guid":156,"unread":true,"content":"\"Alphabet's Waymo autonomous vehicles are programmed to follow the rules of the road...\" notes the Washington Post. But while the cars obey speed limits and properly use their turn signals — they also \"routinely violate parking rules.\"\n\nWaymo vehicles driving themselves received 589 tickets for parking violations in 2024, according to records from San Francisco's Municipal Transportation Agency... The robots incurred $65,065 in fines for violations such as obstructing traffic, disobeying street cleaning restrictions and parking in prohibited areas... [Waymo is responsible for 0.05% of the city's fines, according to statistics from the article.] \n\nParking violations are one of the few ways to quantify how often self-driving companies' vehicles break the rules of the road... Some parking violations, such as overstaying in a paid spot, cause inconvenience but do not directly endanger other people. Others increase the risk of crashes, said Michael Brooks, executive director of the Center for Auto Safety. Anytime a vehicle is obstructing the flow of traffic, other drivers might be forced to brake suddenly or change lanes, he said, creating risks for drivers, pedestrians or other road users... \n\nSan Francisco transit operators lost 2 hours and 12 minutes of service time in 2024 because of Waymo vehicles blocking or colliding with transit vehicles, according to San Francisco Municipal Transportation Agency records. Autonomous vehicles have obstructed firefighters responding to emergency scenes in San Francisco, triggering city officials to ask for tougher oversight from state regulators. \n\nThe article adds that driverless Waymo vehicles in Los Angeles received 75 more tickets in 2024 — \"with $543 in fines still outstanding, according to records from the Los Angeles Department of Transportation.\"","contentLength":1823,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bluesky users debate plans around user data and AI training","url":"https://techcrunch.com/2025/03/15/bluesky-users-debate-plans-around-user-data-and-ai-training/","date":1742061018,"author":"Anthony Ha","guid":48,"unread":true,"content":"<p>Social network Bluesky recently published a proposal on GitHub outlining new options it could give users to indicate whether they want their posts and data to be scraped for things like generative AI training and public archiving. CEO Jay Graber discussed the proposal earlier this week, while on-stage at South by Southwest, but it attracted […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":411,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Climatologist Michael Mann Finally Won a $1M Defamation Suit - But Then a Judge Threw It Out","url":"https://yro.slashdot.org/story/25/03/15/0351230/climatologist-michael-mann-finally-won-a-1m-defamation-suit---but-then-a-judge-threw-it-out?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742060040,"author":"EditorDavid","guid":155,"unread":true,"content":"Slashdot has run nearly a dozen stories about Michael Mann, one of America's most prominent climate scientists and a co-creator of the famous \"hockey stick\" graph of spiking temperatures. In 2012 Mann sued two bloggers for defamation — and last year Mann finally won more than $1 million, reports the Washington Post. \"A jury found that two conservative commentators had defamed him by alleging that he was like a child molester in the way he had 'molested and tortured' climate data.\" \n\nBut \"Now, a year after that ruling, the case has taken a turn that leaves Mann in the position of the one who owes money.\"\n\n On Wednesday, a judge sanctioned Mann's legal team for \"bad-faith trial misconduct\" for overstating how much the scientist lost in potential grant funding as a result of reputational harm. The lawyers had shown jurors a chart that listed one grant amount Mann didn't get at $9.7 million, though in other testimony Mann said it was worth $112,000. And when comparing Mann's grant income before and after the negative commentary, the lawyers cited a disparity of $2.8 million, but an amended calculation pegged it at $2.37 million. \n\nThe climate scientist's legal team said it was preparing to fight the setbacks in court. Peter J. Fontaine, one of Mann's attorneys, wrote in an email that Mann \"believes that the court committed errors of fact and law and will pursue these matters further.\" Fontaine emphasized that the original decision — that Mann was defamed by the commentary — still stands. \"We have reviewed the recent rulings by the D.C. Superior Court and are pleased to note that the court has upheld the jury's verdict,\" he said. \n\nThanks to Slashdot reader UsuallyReasonable for sharing the news.","contentLength":1726,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Week in Review: SXSW week comes to a close","url":"https://techcrunch.com/2025/03/15/week-in-review-sxsw-week-comes-to-a-close/","date":1742058300,"author":"Karyne Levy","guid":47,"unread":true,"content":"<p>Welcome back to Week in Review! I’m Karyne Levy, TechCrunch’s deputy managing editor, and I’ll be writing this newsletter from here on out. Thrilled to be here! This week we’re checking out everything at SXSW; Waymo’s expansion into Silicon Valley; Intel’s new CEO; TikTok’s new suitor; and why DeepSeek isn’t taking VC money. Let’s get […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":423,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"10 Million Cubans Suffer Nationwide Power Outage","url":"https://hardware.slashdot.org/story/25/03/15/1616223/10-million-cubans-suffer-nationwide-power-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742056440,"author":"EditorDavid","guid":154,"unread":true,"content":"\"Cuba's power grid collapsed Friday night,\" reports CNN, \"triggering a nationwide power outage and plunging its more than 10 million people into darkness.\"\n\n\nVideo filmed by CNN in the capital Havana showed streets and buildings shrouded in total darkness, as people used electric torches to navigate the streets. By Saturday morning, the Cuban government officials said that \"microsystems\" — pockets of electricity — had been restored in some cities. However, it remains unclear when the island's power system would be fully online again and most people remained in the dark... \n\nIt marks the latest in a series of failures on the Caribbean island struggling with creaking infrastructure, natural disasters and economic turmoil... For nearly a week in October, most of Cuba suffered near-total blackouts, the worst energy outages in decades. While Cubans are used to frequent power outages, to have another nationwide backcourt — the fourth in six months — was unsettling for many people who need electricity to cook and refrigerate food that otherwise spoils quickly in the tropical heat. \n\"Many residents posted on online sites looking for propane, charcoal, and fuel for generators...\"","contentLength":1197,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SpaceX launches astronauts for long-awaited International Space Station crew swap","url":"https://techcrunch.com/2025/03/15/spacex-launches-astronauts-for-long-awaited-international-space-station-crew-swap/","date":1742051629,"author":"Sean O'Kane","guid":46,"unread":true,"content":"<p>SpaceX successfully launched four people into space on Friday, beginning a mission that will give the International Space Station enough crew members to allow astronauts Suni Williams and Butch Wilmore to return to Earth after their nine-month stay. The mission, known as Crew-10, will see SpaceX’s Dragon spacecraft dock with the International Space Station (ISS) […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":435,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Paid XR Desktop For GNOME \"Breezy Desktop\" In Open Beta With Multi-Display Support","url":"https://www.phoronix.com/news/GNOME-This-Week-Breezy","date":1742050260,"author":"Michael Larabel","guid":459,"unread":true,"content":"<article>The much anticipated GNOME 48 is releasing this coming week as a big step forward for this popular Linux desktop environment. In addition there are a lot of other interesting projects continuing in tandem around GNOME. This Week in GNOME is out with its latest issue to highlight some of these most recent GNOME-related changes...</article>","contentLength":330,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Coal-Powered Energy Finally Overtaken by Wind and Solar in the US","url":"https://hardware.slashdot.org/story/25/03/15/0253253/coal-powered-energy-finally-overtaken-by-wind-and-solar-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1742049240,"author":"EditorDavid","guid":152,"unread":true,"content":"\"Wind and solar energy generated more electricity in the U.S. than coal for the first time last year,\" reports the Wall Street Journal, \"according to analysis from clean-energy think tank Ember. \n\n\"The two renewable energy sources accounted for 17% of the country's power mix while coal fell to a low of 15%, it said.\"\n\nSolar was the fastest-growing energy source, according to Ember's analysis of data from the U.S. Energy Information Administration, increasing 27% from the year before, while wind rose 7%... Natural gas generation increased 3.3% in 2024, according to Ember, and remains by far the largest source of electricity in the U.S., accounting for 43% of the mix... \nCalifornia and Nevada both surpassed 30% annual share of solar in their electricity mix for the first time last year (32% and 30%, respectively). California's battery growth was key to its solar success. It installed 20% more battery capacity than it did solar capacity, which helped it transfer a significant share of its daytime solar to the evening. Texas installed more solar and battery capacity than even California. \n\nYet the growth of solar was uneven — 28 states generated less than 5% of their electricity from solar in 2024, highlighting significant untapped potential — even before adding battery storage. \nThe article includes this observation from Dave Jones, chief analyst at Ember. \"The fall in battery costs is a gamechanger for how much solar the U.S. electricity grid could integrate in the near future.\" \n\nElectrek notes that \"After being stagnant for 14 years, electricity demand started rising in recent years and saw a 3% increase in 2024, marking the fifth-highest level of rise this century...\"\n\nNatural gas grew three times more than the decline in coal, increasing power sector CO2 emissions slightly (0.7%). Coal fell by the second smallest amount since 2014, as gas and clean energy growth met rising electricity demand, whereas historically, they have replaced coal. Despite growing emissions, the carbon intensity of electricity continued to decline. The rise in power demand was much faster than the rise in power sector CO2 emissions, making each unit of electricity likely the cleanest it has ever been.","contentLength":2219,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ReactOS Can Now Boot With The Windows Audio Stack... But No Sound Due To Bugs","url":"https://www.phoronix.com/news/ReactOS-Windows-Audio-Stack","date":1742048760,"author":"Michael Larabel","guid":458,"unread":true,"content":"<article>It's been a while since having any news to share on ReactOS as the open-source operating system working to re-implement the Microsoft Windows APIs/ABIs for enjoying Windows apps/games and drivers on this platform. Today though they are celebrating a new milestone of being able to boot with the Windows audio stack...</article>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bcachefs Racing To Track Down New Upgrade Bug In Linux 6.14","url":"https://www.phoronix.com/news/Bcachefs-Data-Bug-Linux-6.14","date":1742048160,"author":"Michael Larabel","guid":457,"unread":true,"content":"<article>The Linux 6.14 stable kernel is likely to be released in just over one week and thus leading to Bcachefs file-system developers racing to track down a new bug that's been reported by a user on upgrading to the new kernel...</article>","contentLength":223,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Skype is shutting down in May — these are the best alternatives","url":"https://techcrunch.com/2025/03/15/skype-shuts-down-in-may-these-are-the-best-alternatives/","date":1742047200,"author":"Lauren Forristal","guid":45,"unread":true,"content":"<p>After 23 years of connecting people around the world, Skype, the popular video-calling service, is shutting down. Microsoft, the parent company, confirmed that the official sunset date for the service is May 5, 2025. Skype users can either migrate all their contacts and chat data to Microsoft Teams, or they can choose to download their […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":406,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Terahertz Chip Promises Big Power Without Big Lenses","url":"https://spectrum.ieee.org/terahertz-waves","date":1742043603,"author":"Tim Hornyak","guid":80,"unread":true,"content":"<p>New on-chip approach uses patterned holes to boost radiating power</p>","contentLength":66,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81Njc5MzAxMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTgwMTMyNTI5Nn0.KJaAp3A2nsnFa_K4hTlfTFZot1Eu0w9fSPAX_05Ag5Q/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"OpenRazer 3.10.1 Adds Support For A Few More Razer Devices On Linux","url":"https://www.phoronix.com/news/OpenRazer-3.10.1-Released","date":1742040000,"author":"Michael Larabel","guid":456,"unread":true,"content":"<article>OpenRazer 3.10 released last month with support for new Razer devices and a wealth of other enhancements for these open-source, community-developed Razer kernel drivers for Linux. Out today is OpenRazer 3.10.1 with some fixes as well as supporting a few more Razer products...</article>","contentLength":276,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"digiKam 8.6 Released With Working To Better Its AI Integration","url":"https://www.phoronix.com/news/digiKam-8.6","date":1742035512,"author":"Michael Larabel","guid":455,"unread":true,"content":"<article>The KDE-aligned digiKam photo management software is out today with its version 8.6 release. With digiKam 8.6 the open-source photo manager has been working on better enhancing its artificial intelligence (AI) integration...</article>","contentLength":224,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KDE Plasma 6.4 Adding Support For P010 Formatted Videos, KWin Improving Pixel Perfection","url":"https://www.phoronix.com/news/KDE-P010-KWin-Pixel-Perfect","date":1742034989,"author":"Michael Larabel","guid":454,"unread":true,"content":"<article>KDE developer Nate Graham is out with his traditional weekend update to highlight all of the interesting Plasma desktop changes to have been merged over the past week...</article>","contentLength":169,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Compute Runtime Publishes Initial Panther Lake Xe3 GPU OpenCL/L0 Support","url":"https://www.phoronix.com/news/Intel-Compute-25.09.32961.5","date":1741998151,"author":"Michael Larabel","guid":453,"unread":true,"content":"<article>Intel engineers today released Compute Runtime 25.09.32961.5 as their newest update to this open-source compute stack for Windows and Linux systems providing OpenCL and oneAPI Level Zero GPU compute support. Most notable in this release is rolling out initial \"pre-release\" support for next-gen Core Ultra \"Panther Lake\" SoCs with integrated Xe3 graphics...</article>","contentLength":357,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Republican Congressman Jim Jordan asks Big Tech if Biden tried to censor AI","url":"https://techcrunch.com/2025/03/14/republican-congressman-jim-jordan-asks-big-tech-if-biden-tried-to-censor-ai/","date":1741990329,"author":"Maxwell Zeff","guid":44,"unread":true,"content":"<p>On Thursday, House Judiciary Chair Jim Jordan (R-OH) sent letters to 16 American technology firms, including Google and OpenAI, asking for past communications with the&nbsp;Biden administration that might suggest the former president “coerced or colluded” with companies to “censor lawful speech” in AI products. The Trump administration’s top technology advisors previously signaled they would pick […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":474,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bench is charging people for services they already paid for, some customers say","url":"https://techcrunch.com/2025/03/14/bench-is-charging-people-for-services-they-already-paid-for-some-customers-say/","date":1741989006,"author":"Charles Rollet","guid":43,"unread":true,"content":"<p>Bench customers say they're being required to pay for services they already paid for. Bench's new owners deny it.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":176,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI coding assistant Cursor reportedly tells a ‘vibe coder’ to write his own damn code","url":"https://techcrunch.com/2025/03/14/ai-coding-assistant-cursor-reportedly-tells-a-vibe-coder-to-write-his-own-damn-code/","date":1741988697,"author":"Julie Bort","guid":42,"unread":true,"content":"<p>As businesses race to replace humans with AI agents, coding assistant Cursor just gave a peek at the attitude bots could bring to work, too.&nbsp;</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":205,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Profitable Klarna files for a potentially blockbuster IPO","url":"https://techcrunch.com/2025/03/14/profitable-klarna-files-for-a-potentially-blockbuster-ipo/","date":1741986998,"author":"Julie Bort","guid":41,"unread":true,"content":"<p>Swedish fintech Klarna took the next step in its highly anticipated U.S. IPO on Friday when it made its F-1 public. Here are the top take-aways.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":207,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Radeon RX 9070 Fan Speed Reporting & Other Last Minute AMD Changes For Linux 6.15","url":"https://www.phoronix.com/news/RX-9070-Fan-Speed-Linux-6.15","date":1741984988,"author":"Michael Larabel","guid":452,"unread":true,"content":"<article>Additional AMDGPU and AMDKFD kernel driver updates were sent out today for collecting ahead of the upcoming Linux 6.15 merge window. As we are late in the cycle, most of the new AMDGPU kernel graphics driver and AMDKFD compute driver changes are fixes, but there are some minor feature changes particularly for the new RDNA4 GPUs...</article>","contentLength":332,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Researchers astonished by tool’s apparent success at revealing AI’s “hidden objectives”","url":"https://arstechnica.com/ai/2025/03/researchers-astonished-by-tools-apparent-success-at-revealing-ais-hidden-motives/","date":1741982621,"author":"Benj Edwards","guid":222,"unread":true,"content":"<p>In a <a href=\"https://www.anthropic.com/research/auditing-hidden-objectives\">new paper</a> published Thursday titled \"<a href=\"https://assets.anthropic.com/m/317564659027fb33/original/Auditing-Language-Models-for-Hidden-Objectives.pdf\">Auditing language models for hidden objectives</a>,\" Anthropic researchers described how custom AI models trained to deliberately conceal certain \"motivations\" from evaluators could still inadvertently reveal secrets, due to their ability to adopt different contextual roles they call \"personas.\" The researchers were initially astonished by how effectively some of their interpretability methods seemed to uncover these hidden training objectives, although the methods are still under research.</p><p>While the research involved models trained specifically to conceal information from automated software evaluators called <a href=\"https://en.wikipedia.org/wiki/Reinforcement_learning_from_human_feedback\">reward models</a> (RMs), the broader purpose of studying hidden objectives is to prevent future scenarios where AI systems might deceive or manipulate human users.</p><p>While training a language model using reinforcement learning from human feedback (RLHF), reward models are typically tuned to score AI responses according to how well they align with human preferences. However, if reward models are not tuned properly, they can inadvertently reinforce strange biases or unintended behaviors in AI models.</p>","contentLength":1150,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/03/robot_personality-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Google is replacing Google Assistant with Gemini","url":"https://techcrunch.com/2025/03/14/google-is-replacing-google-assistant-with-gemini/","date":1741981774,"author":"Aisha Malik","guid":40,"unread":true,"content":"<p>Google will replace Google Assistant on Android phones with Gemini later this year, the company announced on Friday. Google said in a blog post that it’ll upgrade more users from Google Assistant to Gemini “over the coming months.” Later this year, Assistant will no longer be accessible on most mobile devices or available from app […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":407,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"‘Open’ AI model licenses often carry concerning restrictions","url":"https://techcrunch.com/2025/03/14/open-ai-model-licenses-often-carry-concerning-restrictions/","date":1741981704,"author":"Kyle Wiggers","guid":39,"unread":true,"content":"<p>This week, Google released a family of open AI models, Gemma 3, that quickly garnered praise for their impressive efficiency. But as a number of developers lamented on X, Gemma 3’s license makes commercial use of the models a risky proposition. It’s not a problem unique to Gemma 3. Companies like Meta also apply custom, […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":394,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TechCrunch Mobility: Testing the Uber-Waymo robotaxi, Rivian goes hands-free, and Travis Kalanick has AV FOMO","url":"https://techcrunch.com/2025/03/14/techcrunch-mobility-testing-the-uber-waymo-robotaxi-rivian-goes-hands-free-and-travis-kalanick-has-av-fomo/","date":1741979700,"author":"Kirsten Korosec","guid":38,"unread":true,"content":"<p>Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation. Sign up here for free — just click TechCrunch Mobility! For regular readers of TechCrunch Mobility, you may be wondering, “Why did this newsletter land in my inbox on Friday?” Folks, we’re moving days in an effort […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AT&T technician Mark Klein, who exposed secret NSA spying, dies","url":"https://techcrunch.com/2025/03/14/att-technician-mark-klein-who-exposed-secret-nsa-spying-dies/","date":1741978200,"author":"Zack Whittaker","guid":37,"unread":true,"content":"<p>Klein, a former AT&amp;T technician turned whistleblower, exposed mass surveillance by the U.S. government in 2006.</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":174,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Git 2.49 Released With Faster Packing, Rust Foreign Language Interface","url":"https://www.phoronix.com/news/Git-2.49-Released","date":1741976521,"author":"Michael Larabel","guid":451,"unread":true,"content":"<article>Git 2.49 is out today as the latest feature update for this widely-used distributed version control system...</article>","contentLength":109,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Tern AI’s low-cost GPS alternative actually works","url":"https://techcrunch.com/2025/03/14/tern-ais-low-cost-gps-alternative-actually-works/","date":1741976037,"author":"Rebecca Bellan","guid":36,"unread":true,"content":"<p>We’ve all experienced that moment of frustration when the GPS glitches and you miss an exit on the highway. The team at Tern AI, which is building a low-cost GPS alternative, says that’s because the current technology is limited by its reliance on satellite positioning.&nbsp; Tern AI says it has figured out how to locate […]</p><p>© 2024 TechCrunch. All rights reserved. For personal use only.</p>","contentLength":391,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Video Friday: Exploring Phobos","url":"https://spectrum.ieee.org/video-friday-exploring-phobos","date":1741968003,"author":"Evan Ackerman","guid":79,"unread":true,"content":"<p>Your weekly selection of awesome robot videos</p>","contentLength":45,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81NzI2MDQ5Ny9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTgwNTE4MjY3OX0.vNH-nOweK4UVmLyfB0hnHv2Mh3B5bLm_SfQPR5h2fmI/image.jpg?width=600","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}