{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Zelensky refuses to sign document on transfer of 50% of Ukrainian mineral resources to the US - WP | УНН","url":"https://unn.ua/en/news/zelensky-refuses-to-sign-document-on-transfer-of-50percent-of-ukrainian-mineral-resources-to-the-us-wp","date":1739561490,"author":"/u/EsperaDeus","guid":643,"unread":true,"content":"<p>A delegation of the US Congress in Munich wanted President of Ukraine Volodymyr Zelenskyy to sign a document that would give the US rights to 50% of Ukraine's future mineral resources, but he refused. This was reported by The Washington Post journalist Josh Rogin in X,  reports.</p><blockquote><p>Several lawmakers here in Munich have told me that a US Congressional delegation handed Zelenskiy a paper they wanted him to sign giving the US rights to 50% of Ukraine's future mineral resources&nbsp;</p></blockquote><p>According to him, the Ukrainian leader politely refused to sign it.</p><p>Zelenskyy has previously said that he supports a strategic partnership with the United States in rare earths mining, which could be part of an agreement on economic support and security guarantees for Ukraine.</p><p>On February 11, Donald Trump <a href=\"https://unn.ua/news/tramp-ukraina-faktychno-pohodylas-nadaty-ssha-dostup-do-mineraliv-na-500-mlrd-dolariv-za-viiskovu-dopomohu\">said</a>that Ukraine had \"effectively\" agreed to give the United States access to $500 billion worth of rare earth minerals in return for Washington's military aid.</p>","contentLength":941,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipit4z/zelensky_refuses_to_sign_document_on_transfer_of/"},{"title":"Royal Society urged to expel Elon Musk as fellows sign open letter","url":"https://www.theguardian.com/science/2025/feb/14/elon-musk-royal-society-open-letter-academics","date":1739550717,"author":"/u/Curious_Suchit","guid":642,"unread":true,"content":"<p>Pressure is growing on the <a href=\"https://www.theguardian.com/science/royal-society\" data-link-name=\"in body link\">Royal Society</a> to expel Elon Musk from its fellowship after more than a thousand scientists signed an <a href=\"https://occamstypewriter.org/scurry/\" data-link-name=\"in body link\">open letter</a> expressing dismay at its lack of action on the matter.</p><p>Musk, who owns the social media platform X, leads the US “department of government efficiency” (Doge). He was <a href=\"https://royalsociety.org/people/elon-musk-13829/\" data-link-name=\"in body link\">elected a fellow</a> of the UK’s national academy of sciences in 2018 as a result of his work and impact in the space and electric vehicle industries.</p><p>However, the <a href=\"https://www.theguardian.com/science/royal-society\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Royal Society</a> is under mounting pressure to revoke the honour.</p><p>In August, the <a href=\"https://www.theguardian.com/technology/article/2024/aug/23/royal-society-facing-calls-to-expel-elon-musk-amid-concerns-about-conduct\" data-link-name=\"in body link\">Guardian revealed</a> a number of fellows had written to the Royal Society expressing concern over Musk’s comments regarding unrest in the UK and calling for him to be stripped of his fellowship.</p><p>Prof Dorothy Bishop, a leading expert on children’s communication disorders at the University of Oxford, subsequently <a href=\"https://www.theguardian.com/technology/2024/nov/25/oxford-scientist-resigns-from-royal-society-over-elon-musks-continuing-fellowship\" data-link-name=\"in body link\">resigned her fellowship</a> because of a lack of action by the Royal Society, with <a href=\"https://www.researchprofessionalnews.com/rr-news-uk-charities-and-societies-2025-2-second-royal-society-fellow-resigns-over-musk-s-membership/\" data-link-name=\"in body link\">Andrew Millar</a>, a professor of systems biology at the University of Edinburgh, following suit this week, as first reported by Research Professional News.</p><p>More than 1,700 members of the international scientific community <a href=\"https://occamstypewriter.org/scurry/\" data-link-name=\"in body link\">have signed an open letter</a> to the president of the Royal Society, Sir Adrian Smith, with signatories including Bishop, Sir Richard Peto – an eminent statistician and Royal Society fellow – and Prof Susan Michie of UCL, a behavioural scientist who became a household name during the Covid pandemic.</p><p>Stephen Curry, an emeritus professor of structural biology at Imperial College London, said he was motivated to write the letter out of frustration at the organisation’s continued silence.</p><p>“This isn’t an HR complaint about harassment or bullying or anything like that. This is a matter of behaviour that is entirely public,” he said. “Everybody can see what Musk has said and what he’s doing as head of Doge, and the Royal Society, which claims to have a strong voice for science within the UK, but actually, even on the international stage, has said absolutely nothing.”</p><p>The letter notes the Royal Society was made aware of fellows’ concerns more than six months ago, and that since then Musk has made further incendiary comments.</p><p>These include <a href=\"https://www.theguardian.com/politics/2025/jan/07/elon-musk-knows-absolutely-nothing-about-womens-safety-says-jess-phillips\" data-link-name=\"in body link\">calling the MP Jess Phillips</a>, the minister for safeguarding and violence against women and girls, a “rape genocide apologist”. Phillips has said the comments made her more worried about her safety.</p><p>“I am at a loss to understand how these actions are consistent with a code of conduct that requires fellows to have ‘due regard for the statement of values developed from time to time by [the Royal] Society’,” Curry writes.</p><p>The letter states the situation is rendered more serious because of Musk’s new position within a Trump administration that, Curry writes, “has over the past several weeks engaged in an assault on scientific research in the US that has fallen foul of federal courts”, noting that concerns have also been raised over censorship, particularly in the realm of climate science</p><p>The letter adds that the lack of comment by the Royal Society about Musk’s fellowship, other than its reiteration that concerns around individual fellows are dealt with in strict confidence, “increasingly looks like a failure of moral courage”.</p><p>Curry said he hopes the letter, as well as the recent resignations, would highlight to the Royal Society the breadth and depth of feeling within the scientific community about Musk’s fellowship.</p><p>“If they believe at all in the values that they espouse in their code of conduct, then they really have to come out and explain to people why is it that they think that Musk’s behaviour is consistent with [them],” he said.</p><p>The Guardian understands there is to be a meeting of the Fellowship of the Royal Society on 3 March to discuss the principles around public pronouncements and behaviour of fellows.</p><p>A spokesperson for the Royal Society said: “In the event of any concerns raised about the behaviour of a fellow, the Society has a clear set of processes described in our <a href=\"https://royalsociety.org/-/media/about-us/how-we-are-governed/code-of-conduct.pdf\" data-link-name=\"in body link\">code of conduct</a>, which is published on our website along with relevant disciplinary regulations. Any issues raised in respect of individual fellows are dealt with in strict confidence.’’</p>","contentLength":4242,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipeju3/royal_society_urged_to_expel_elon_musk_as_fellows/"},{"title":"Putin 'preparing war against Nato countries next year', warns Zelensky - latest Ukraine developments","url":"https://uk.news.yahoo.com/nato-war-putin-zelensky-ukraine-russia-124308240.html?guccounter=1","date":1739539083,"author":"/u/MassiveLimit2602","guid":638,"unread":true,"content":"<p>Ukrainian president Volodymyr Zelensky has said he believes Russian president Vladimir Putin is \"preparing for war against other Nato countries next year\".</p><p>Zelensky warned of future aggression from Putin amid concerns the US had already handed Putin multiple concessions in advance of any negotiations.</p><p>\"They [Russia] can go forward to Ukraine or they will go to Poland or to Baltic,\" Zelensky warned of Putin's long-term goals. \"All I've got from intelligence is that he's preparing the war against Nato countries next year.\"</p><p>\"And, I think so, but I don't know... god bless we will stop this crazy guy and we will not have war in the world, in Europe - but you will not stop him just to say 'yes, we will stop', it is not enough.\" He added that \"security guarantees\" for Ukraine were the only way to stop future threats from Russia.</p><p>Zelensky also claimed that a Russian drone with a high-explosive warhead had damaged the containment shelter at the Chernobyl nuclear power plant overnight, which indicated Putin \"is preparing to continue deceiving the world\".</p><p>He wrote on X: “Every night, Russia carries out such attacks on Ukraine’s infrastructure and cities. Russia continues to expand its army and shows no change in its deranged, anti-human state rhetoric.</p><p>\"This means that Putin is definitely not preparing for negotiations — he is preparing to continue deceiving the world. That is why there must be unified pressure from all who value life – pressure on the aggressor. Russia must be held accountable for its actions.\"</p><p>Zelensky is due to meet US vice-president JD Vance in Munich, as well as US secretary of state Marco Rubio.</p><p><strong>Read more coverage from Yahoo's media partners below. Click the links to skip ahead</strong></p><h2></h2><p>A Russian drone with a high-explosive warhead hit the protective confinement shell of the Chernobyl nuclear power plant in the Kyiv region during the night, Ukrainian President Volodymyr Zelensky said on Friday.</p><p>Radiation levels have not increased, Mr Zelensky and the UN atomic agency said. The drone strike damaged the structure and started a fire - which has been put out, Mr Zelensky added. Kremlin spokesman Dmitry Peskov later denied the claims.</p><h2></h2><p>JD Vance has sparked a furious backlash for delivering an anti-immigration speech at the Munich Security Conference in which he attacked European leaders and backed those who voted for Brexit.</p><p>The US vice president was accused of “hypocrisy” and his speech described as “bizarre and dangerous” as he departed from the usual defence focus of speeches at the conference to lash out at the UK and EU over migration and free speech.</p><h2></h2><p>Sir Keir Starmer has said Britain is committed to Ukraine being on an “irreversible path” to joining Nato after the US appeared to rule out membership for the war-torn country.</p><p>The Prime Minister bolstered his backing for Kyiv in a phone call with President Volodymyr Zelensky as global leaders gather in Munich for a major security conference.</p><p>Britain has so far sought to strike a delicate balance between supporting Ukraine against Russia’s invasion and keeping Donald Trump, who says he has agreed with Vladimir Putin to start “negotiations” to end the conflict, on side.</p><h2></h2><p>Royal Navy ships could be deployed to the Black Sea in a peace keeping mission to deter a new Russian attack, <a data-i13n=\"cpos:10;pos:1\" href=\"https://www.standard.co.uk/topic/volodymyr-zelensky\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Volodymyr Zelensky;cpos:10;pos:1;elm:context_link;itc:0;sec:content-canvas\">Volodymyr Zelensky</a> has suggested.</p><p><a data-i13n=\"cpos:11;pos:1\" href=\"https://www.standard.co.uk/topic/ukraine\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Ukraine;cpos:11;pos:1;elm:context_link;itc:0;sec:content-canvas\">Ukraine</a>’s president said 110,000 foreign troops might be needed to secure peace in Ukraine if <a data-i13n=\"cpos:12;pos:1\" href=\"https://www.standard.co.uk/topic/vladimir-putin\" rel=\"nofollow noopener\" target=\"_blank\" data-ylk=\"slk:Vladimir Putin;cpos:12;pos:1;elm:context_link;itc:0;sec:content-canvas\">Vladimir Putin</a> agrees to end his three-year war.</p><p>He outlined at the Munich Security Conference how Ukraine’s armed forces could protect the country if supplied with enough fighter jets and air defences.</p><p>He also gave a broadbrush picture of how the West could help to protect Ukraine.</p><h2></h2><p>Negotiations to end the war in Ukraine should not result in “peace that is a capitulation”, as this would be “bad news for everyone”, including the US, French President Emmanuel Macron has said.</p><p>In an interview with the Financial Times, the French president endorsed Trump's position that it is Europe’s responsibility to ensure Ukraine’s security. “What Trump is saying to Europe is that it is up to you to carry the burden. And I say, it is up to us to take it on,” Macron said.</p>","contentLength":4203,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ipadbt/putin_preparing_war_against_nato_countries_next/"},{"title":"Berlin says Vance should not interfere in German politics","url":"https://www.straitstimes.com/world/europe/berlin-says-vance-should-not-interfere-in-german-politics","date":1739536335,"author":"/u/Silly-avocatoe","guid":636,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ip9jtn/berlin_says_vance_should_not_interfere_in_german/"},{"title":"Musk will face consequences for interfering in German election, says front-runner Merz","url":"https://www.politico.eu/article/elon-musk-will-face-consequences-interfering-german-election-front-runner-friedrich-merz/","date":1739534552,"author":"/u/DomesticErrorist22","guid":644,"unread":true,"content":"<div><p>Berlin wants more robust military spending following a bombshell move by the Trump administration to negotiate a peace deal with Russian President Vladimir Putin.</p></div>","contentLength":162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ip92jz/musk_will_face_consequences_for_interfering_in/"},{"title":"USA’s threats to invade Canada violate international law: Canadian ambassador - National","url":"https://globalnews.ca/news/11011723/donald-trump-canada-greenland-threats/amp/","date":1739530901,"author":"/u/HotPersimessage62","guid":639,"unread":true,"content":"<div><div>Story continues below advertisement</div></div><p>“I’m just saying that in order to respect international law, you don’t threaten your neighbors by invasion,” Stéphane Dion said.</p><p>Trump has said he wouldn’t rule out using military force to take over Greenland, which is part of Denmark.</p><p>In response to a question about Greenland, Dion said such threats are not normal and violate the UN Charter. He said that it’s not just against international law to invade another country but also to threaten to do so.</p><div><div>Story continues below advertisement</div></div><p>He made the comments as Trudeau is in Paris to attend the global summit on artificial intelligence. Late Sunday evening following a dinner with French President Emmanuel Macron, Trudeau did not answer reporters’ questions about the Trump’s statements.</p><div><a href=\"https://globalnews.ca/pages/email-alerts/\" target=\"_blank\" data-trackable=\"true\" data-trackaction=\"article | newsletter signup text\">\n\t\t\t\t\tThe email you need for the day's top news stories from Canada and around the world.\n\t\t\t\t</a></div><p>Dion said Canada and European countries are working on a cohesive strategy to address tariff threats from the United States.</p><p>“Canada and Mexico are the first ones, but Europeans know that they may be targeted as well. We’re anticipating that. They are working with us about how can we have a cohesive way to convince the US administration that trade wars are painful for everyone… and not something that you should do between friends.”</p><section aria-label=\"Dynamic trending stories section\"><ul><li><a href=\"https://globalnews.ca/news/11019155/fentanyl-seized-u-s-border-originated-from-canada/\"></a></li><li><a href=\"https://globalnews.ca/news/11017917/canada-51st-state-how-process-works/\"></a></li></ul></section><p>U.S. Vice President JD Vance is also in Paris for the AI Action Summit, but it’s not clear whether he will meet with Trudeau, as no meeting has been announced to date.</p><div><div>Story continues below advertisement</div></div><p>Both Canada and Mexico were granted at least 30-day reprieves from the Trump’s broad-based tariff threat being realized just last week.</p><p>On Wednesday, Trudeau will travel to Brussels to meet with E.U. leaders, which could offer Canada an opportunity to shore up its relationship with the European Union in the context of Trump’s threats.</p><p>Dion told reporters Monday Canada won’t be successful in trade diversification unless that effort includes Europe.</p><p>“Now that we see that unfortunately for now at least the U.S. administration is not as reliable as we thought, not respecting treaties as we thought, we need Europeans and Canadians to work very closely together,” Dion said.</p>","contentLength":2213,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ip853x/usas_threats_to_invade_canada_violate/"},{"title":"Russia asks Elon Musk to hand over names of dissidents","url":"https://www.thetimes.com/world/europe/article/russia-elon-musk-list-names-dissidents-usaid-s798gktd7","date":1739505035,"author":"/u/Infidel8","guid":645,"unread":true,"content":"<p>Moscow has appealed to the US to identify exiled Russian opposition figures who received funding from America’s international aid agency, which Elon Musk described as a “criminal organisation”.</p><p>President Trump’s move to freeze international assistance for 90 days and suspend the work of the US Agency for International Development (USAid) has devastated funding for Russian opposition media and human rights groups. </p><p>Vyacheslav Volodin, the chairman of the Duma, Russia’s parliament, said on Tuesday: “If they recognised the [USAid] organisation as an enemy, let them give us the lists. Congress will send us the lists — we will give them to the FSB [Russian security service].”</p><p>Musk, who has been tasked by Trump with slashing billions from public spending, has alleged that <a href=\"https://www.thetimes.com/article/why-trump-musk-want-end-usaid-g7gbm9xfs\">USAid was illegally funnelling</a></p>","contentLength":820,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ip1u8x/russia_asks_elon_musk_to_hand_over_names_of/"},{"title":"Macron says only Ukrainian President Zelenskiy can negotiate peace for his country","url":"https://www.reuters.com/world/europe/macron-says-only-ukrainian-president-zelenskiy-could-negotiate-behalf-his-2025-02-14/","date":1739500238,"author":"/u/Lionzzo","guid":641,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1ip0d14/macron_says_only_ukrainian_president_zelenskiy/"},{"title":"Laughing Kremlin Insiders Say Trump Has Given Putin Greenlight to Expand the War","url":"https://www.thedailybeast.com/laughing-kremlin-insiders-say-trump-has-given-putin-greenlight-to-expand-the-war/","date":1739488660,"author":"/u/soldierofcinema","guid":640,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iowjua/laughing_kremlin_insiders_say_trump_has_given/"},{"title":"Trump Floats Deal With Russia, China to Halve Defense Spending","url":"https://www.bloomberg.com/news/articles/2025-02-13/trump-floats-deal-with-russia-china-to-halve-defense-spending?embedded-checkout=true","date":1739486372,"author":"/u/MisterBurkes","guid":637,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1iovphp/trump_floats_deal_with_russia_china_to_halve/"}],"tags":["news","reddit"]}