{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Hungarian Opposition Rallies in Massive Protest Against Orbán’s Rule","url":"https://www.kyivpost.com/post/48992","date":1742119318,"author":"/u/Yveliad","guid":598,"unread":true,"content":"<p>Massive crowds rallied in Budapest on Saturday as Hungarian opposition activists came out in force to call for an end to Prime Minister Viktor Orbán’s 15-year rule.</p><p>Around 50,000 protesters descended on the capital on Hungary’s national day to support Peter Magyar, a former government insider turned leader of the anti-Orbán camp.</p><p>Magyar told his supporters the “time has come” for his Tisza party, which is leading the prime minister’s Fidesz party in most opinion polls ahead of elections in 2026, Reuters reported.</p><p>Speaking to TVP World during the demonstration, Tisza’s deputy chair Zoltán Tarr said that his movement faced significant operational challenges under the current government, which has been accused of undermining press freedom and curbing democracy.</p><p>“The biggest challenge is that Orbán’s government is doing everything in its power to somehow control and limit our activities,” Tarr claimed.</p><p>“They also go after people who openly say that they want change and say that they would like to belong to the Tisza movement. That is one of the biggest challenges, because obviously everyone is worried about his or her own existence, and this government is very particular in going after people one by one, singling them out.”</p><p>He added that state “propaganda” was spreading falsehoods about the opposition.</p><p>“They constantly make up stories which are not true but which are able to lead people in a different direction, [they] mislead them by spreading lies about us,” he said.</p><p>Magyar and his party are set to launch a popular survey on 12 key economic and political issues to give citizens a voice in the movement’s political platform in the run-up to next year’s vote.</p><p>The 43-year-old MEP has also vowed to make Hungary part of a strong Europe, in contrast to Orbán’s Euroscepticism, which has seen him regularly clashing with politicians in Brussels and other European capitals.</p><p>Speaking at a separate rally on Saturday, the 61-year-old Orbán said it was time to eliminate what he called a “shadow army” of NGOs, journalists, judges and politicians receiving payments from abroad.</p><p>He has already announced plans to crack down on organizations funded by the U.S. Agency for International Development (USAID) – which is now being dismantled by Trump – and Budapest-born billionaire George Soros, a supporter of liberal causes.</p><p>This week Orbán’s Fidesz party submitted constitutional changes that would permit the expulsion of dual citizens deemed to pose a threat to Hungary’s sovereignty.</p><p>While the Tisza movement may be riding high in recent polls, unseating Orbán would be a significant achievement. In the last parliamentary elections in 2022, a united front of anti-Fidesz candidates fell well short of Orbán’s party, which won over half of the popular vote.</p>","contentLength":2822,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jci7c2/hungarian_opposition_rallies_in_massive_protest/"},{"title":"Finland turns down US request for eggs","url":"https://yle.fi/a/74-20149786","date":1742116052,"author":"/u/Beo1217","guid":606,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jchh9z/finland_turns_down_us_request_for_eggs/"},{"title":"A river ‘died' overnight in Zambia after an acidic waste spill at a Chinese-owned mine","url":"https://apnews.com/article/mining-pollution-china-zambia-environment-93ee91d1156471aaf9a7ebd6f51333c1?fbclid=IwY2xjawJC4UNleHRuA2FlbQIxMQABHSYwd6jBPc-9Ud0ih68QPHXuoDjTBNrmdrbkPe0fy6N_USmK-YK8TgyUmw_aem_jM_aBoBLBDU9_TRAxkBalA","date":1742078489,"author":"/u/kalahiki808","guid":605,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc74ni/a_river_died_overnight_in_zambia_after_an_acidic/"},{"title":"Once Again, Ukrainian Drones Are Blowing Up Russian Drone Factories","url":"https://www.forbes.com/sites/davidaxe/2025/03/15/once-again-ukrainian-drones-are-blowing-up-russian-drone-factories/","date":1742073289,"author":"/u/AndroidOne1","guid":603,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc5dgm/once_again_ukrainian_drones_are_blowing_up/"},{"title":"Carney orders review of F-35 fighter jet purchase from U.S.’s Lockheed Martin","url":"https://www.ctvnews.ca/politics/article/carney-orders-review-of-f-35-fighter-jet-purchase-from-uss-lockheed-martin/","date":1742069954,"author":"/u/Old_General_6741","guid":597,"unread":true,"content":"<p>Updated:&nbsp;<time datetime=\"2025-03-15T19:38:32.556Z\">March 15, 2025 at 3:38PM EDT</time></p><p>Published:&nbsp;<time datetime=\"2025-03-15T16:56:06.375Z\">March 15, 2025 at 12:56PM EDT</time></p>","contentLength":79,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc45o4/carney_orders_review_of_f35_fighter_jet_purchase/"},{"title":"France's Macron to host Canada's Carney in Paris on Monday","url":"https://www.reuters.com/world/europe/frances-macron-host-canadas-carney-paris-monday-2025-03-15/","date":1742065591,"author":"/u/Advanced_Drink_8536","guid":600,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc2ixn/frances_macron_to_host_canadas_carney_in_paris_on/"},{"title":"On Trump's order, US launches large-scale attacks on Iran-backed Houthis","url":"https://www.jpost.com/breaking-news/article-846181","date":1742065053,"author":"/u/barsik_","guid":602,"unread":true,"content":"<p>The United States struck <a href=\"https://www.jpost.com/tags/houthi\">Houthi targets</a> in <a href=\"https://www.jpost.com/tags/yemen\">Yemen</a> on Saturday evening in a message to Iran, at a time when the administration is proposing to open negotiations on its nuclear program, a US official told </p><p>The strikes will last \"days, possible weeks\" an official told Reuters.</p><p>The Houthi-run health ministry reported that the US strikes have killed over 23 people and wounded more than 20 others in Yemen on Saturday.</p><p>An Israeli official told  that the US informed Israel in advance of the attacks on Yemen.&nbsp;</p><p>The air and naval strikes hit the Houthis’ radars, air defenses, and missile and drone systems,  reported.</p><p>The Houthi TV channel said that an electrical installation in the city of Dahyan, in the Saada province in northwestern Yemen, was also struck resulting in a loss of electricity across the city.</p><figure><figcaption> Smoke rises from the site of Israeli air strikes at the port of Hodeidah, in Hodeidah, Yemen July 21, 2024. (credit: REUTERS/STRINGER)</figcaption></figure><p>US President Donald Trump wrote on his Truth Social account that “today, I have ordered the United States military to launch decisive and powerful military action against the Houthi terrorists in Yemen. They have waged an unrelenting campaign of piracy, violence, and terrorism against American, and other, ships, aircraft, and drones.”Trump also slammed his predecessor, former president Joe Biden, for his “pathetically weak” handling of the Houthi threat.</p><p>“Funded by Iran, the Houthi thugs have fired missiles at US aircraft, and targeted our troops and allies. These relentless assaults have cost the US and world economy many billions of dollars while, at the same time, putting innocent lives at risk,” the president stressed.</p><section><section><div><div><p>Stay updated with the latest news!</p><p>Subscribe to The Jerusalem Post Newsletter</p></div></div></section></section><p>“The Houthi attack on American vessels will not be tolerated,” Trump wrote. “We will use overwhelming lethal force until we have achieved our objective. The Houthis have choked off shipping in one of the most important waterways of the world, grinding vast swaths of global commerce to a halt, and attacking the core principle of freedom of navigation upon which international trade and commerce depends.”</p><h3><strong>Donald Trump: Houthis, your time is up, starting today</strong></h3><p>The president concluded the post with a message to the Houthis and to Iran.</p><p>“To all Houthi terrorists, YOUR TIME IS UP, AND YOUR ATTACKS MUST STOP, STARTING TODAY. IF THEY DON’T, HELL WILL RAIN DOWN UPON YOU LIKE NOTHING YOU HAVE EVER SEEN BEFORE!” he wrote. “To Iran: Support for the Houthi terrorists must end IMMEDIATELY! Do NOT threaten the American people, their president, who has received one of the largest mandates in presidential history, or worldwide shipping lanes. If you do, BEWARE, because America will hold you fully accountable and, we won’t be nice about it!”</p><p>The strike’s goal is to open international shipping lanes in the Red Sea, which have been disrupted by the Houthis.Houthi-run Al Masirah TV previously said on Saturday that an attack targeted the Yemeni capital Sana’a, without providing further details.</p><p>The Iran-backed Houthi terror group paused attacks on Israel, which it began in support of Hamas, during the Israel-Hamas ceasefire. However, the Houthis announced last week that they would recommence attacks in response to Israel’s blockade on aid in Gaza.</p><p><em>This is a developing story.</em></p><p><em>Amichai Stein contributed to this report.</em></p>","contentLength":3398,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc2bf3/on_trumps_order_us_launches_largescale_attacks_on/"},{"title":"Prime Minister Carney orders review of F-35 fighter jet purchase from U.S.’s Lockheed Martin","url":"https://montreal.citynews.ca/2025/03/15/carney-orders-review-of-f-35-fighter-jet-purchase-from-u-s-s-lockheed-martin/","date":1742059810,"author":"/u/BonkMcSlapchop","guid":604,"unread":true,"content":"<p>Prime Minister Mark Carney has asked for a review of Canada’s plan to purchase a fleet of F-35 fighter jets.</p><p>The deal with Lockheed Martin and the U.S. government is for 88 planes at a cost of about US$85 million each.</p><p>A spokesperson for Defence Minister Bill Blair said Carney has asked Blair to look into whether the F-35 contract is the best investment for Canada given the “changing environment,” or if there are better options.</p><p>“At this time, the contract to purchase the F-35 remains in place, and Canada has made a legal commitment of funds for the first 16 aircraft,” Laurent de Casanove said in a statement to CityNews. “The Prime Minister has also asked the Minister of National Defence to work with CAF/DND to determine if the F-35 contract, as it stands, is the best investment for Canada, and if there are other options that could better meet Canada’s needs.”</p><p>“To be clear, we are not cancelling the F-35 contract.” </p><p>Carney became prime minister on Friday, in the midst of a trade war with the United States and threats by U.S. President Donald Trump to annex Canada.&nbsp;</p><p>The new fleet is set to replace the Royal Canadian Air Force’s aging CF-18s, with the first four of the 88 planes expected to be delivered in 2026 and the final 18 in 2032.&nbsp;</p><p>In an interview with the CBC Friday, Blair said he will be looking at whether all the jets need to be F-35s, or whether there are other alternatives, “particularly where there may be opportunities” to assemble, support and maintain the jets in Canada.</p><p>“The direction I’ve been given by the prime minister is go and look at all of our options to make sure that we make the right decision for Canada,” he said.</p><p>Blair said he will consult with the Canadian Air Force, the chief of the defence staff, and the Department of National Defence, as well as allies and partners “to see what is possible.”</p><p>A spokesperson for Lockheed Martin referred questions to the Canadian and U.S. governments.&nbsp;</p><p>“Lockheed Martin values our strong partnership and history with the Royal Canadian Air Force and looks forward to continuing that partnership into the future,” the company said in a statement.</p><p>The White House did not respond to a request for comment Saturday afternoon.</p><h2>On-again, off-again decision to buy F-35s</h2><p>The Conservative government first committed to buying 65 F-35s without a competition in 2010, but concerns about the cost and capabilities forced it to reconsider.</p><p>Then, in 2015, the Liberals promised to instead launch an open competition to replace the CF-18s and not to buy the F-35 at all.</p><p>The government planned to buy 18 Super Hornets without a competition as an “interim” measure but cancelled the plan after Boeing launched a trade dispute with Montreal aerospace firm Bombardier.</p><p>Ottawa initiated an open bidding process for the new fleet in July 2019.</p><p>In January 2023, Canada announced it would buy the F-35 fighter jet with the first four of the 88 planes expected to be delivered in 2026 and the final 18 in 2032.</p><p>At the time, Defence Minister Anita Anand called the F-35 the best choice for Canada.</p><h2>A mixed fleet of planes ‘less disruptive, but costly and complex’</h2><p>Michael Byers, a professor at the University of British Columbia and co-director of the Outer Space Institute, has previously argued that Canada should cancel the contract because the planes are highly computerized, with Lockheed Martin refusing to share the full source code, and Canada would never be able to have full control of them.</p><p>He said Saturday the 16 planes that Canada has already paid for are sunk costs, and the country should “cut its losses.”</p><p>“We need planes that can operate to their full capacity without U.S.-controlled computer systems,” he said.</p><p>Philippe Lagassé, a Carleton University associate professor specializing in defence policy and procurement, said there is currently a “large scale transition underway” from the CF-18s to the F-35s, which doesn’t only include the planes, but also the also the “infrastructure, training, munitions, and operational constructs for North America.”</p><p>Lagassé, who also served as a member of the independent review panel that looked at the options to replace the CF-18s, said changing all those plans would be a massive undertaking.</p><p>“It can all be done, but it will put significant pressure on the RCAF and leave Canada with less capability for some time,” he said.</p><p>Opting for a mixed fleet of F-35s and another plane “would be less disruptive, but costly and complex.”</p><p>The Parliamentary Budget Officer has said the total cost to buy, fly and maintain the new F-35 fleet would be an estimated $73.9 billion. A 2023 report estimated the acquisition phase would cost $19.8 billion, including $10.7 billion for 88 planes, $2.1 billion for weapons and ammunition and $5.9 billion for elements like design and depot costs, infrastructure and training.</p>","contentLength":4889,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc0co6/prime_minister_carney_orders_review_of_f35/"},{"title":"Zelenskyy: Partners agree that Ukraine and Europe can be strengthened in 3 years","url":"https://www.pravda.com.ua/eng/news/2025/03/15/7503060/","date":1742058753,"author":"/u/eaglemaxie","guid":599,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jbzy15/zelenskyy_partners_agree_that_ukraine_and_europe/"},{"title":"Ukraine’s Long-Range Neptune Missile Successfully Strikes at 1,000 km, Zelenskyy Says","url":"https://united24media.com/latest-news/ukraines-long-range-neptune-missile-successfully-strikes-at-1000-km-zelenskyy-says-6753","date":1742050915,"author":"/u/SendStoreMeloner","guid":601,"unread":true,"content":"<p>Ukraine has successfully tested and deployed its new long-range missile, the “Long Neptune,” <a href=\"https://defence-ua.com/news/vpershe_pro_dovgij_neptun_stalo_vidomo_naprikintsi_2023_a_teper_mi_majemo_udar_na_1000_km-18271.html\" rel=\"external noopener nofollow\" target=\"_blank\">according</a> to&nbsp;President Volodymyr Zelenskyy. The missile, developed as&nbsp;part of&nbsp;Ukraine’s ongoing missile program, has a&nbsp;reported range of&nbsp;1,000 kilometers.</p><p>“The Long Neptune has undergone testing and successful combat deployment. A&nbsp;new Ukrainian missile, precise and effective,” Zelenskyy stated in&nbsp;a&nbsp;Telegram post. He&nbsp;thanked Ukrainian developers, manufacturers, and military personnel for their contributions to&nbsp;the project.</p><p>Reports indicate that the Long Neptune is&nbsp;an&nbsp;extended-range modification of&nbsp;the domestically produced Neptune cruise missile, originally designed for targeting naval assets. The missile’s adaptation for long-range strikes on&nbsp;land targets marks a&nbsp;significant advancement in&nbsp;Ukraine’s defense capabilities.</p><p><a href=\"https://defence-ua.com/news/vpershe_pro_dovgij_neptun_stalo_vidomo_naprikintsi_2023_a_teper_mi_majemo_udar_na_1000_km-18271.html\" rel=\"external noopener nofollow\" target=\"_blank\">According</a> to&nbsp;Defense Express report, while official details on&nbsp;production capacity and previous deployments remain undisclosed, analysts suggest the Long Neptune may have been used in&nbsp;recent strikes. Unverified footage circulating online indicates a&nbsp;potential strike on&nbsp;the Tuapse oil refinery in&nbsp;Russia on&nbsp;March&nbsp;14. However, this information has not been confirmed by&nbsp;official sources.</p><p>The development of&nbsp;a&nbsp;long-range Neptune variant was first hinted at&nbsp;in&nbsp;late 2023, when Ukrainian defense officials acknowledged work on&nbsp;an&nbsp;extended-range missile for the Neptune system. In&nbsp;November 2024, President Zelenskyy mentioned that Ukraine had reached the production milestone of&nbsp;over 100&nbsp;missile units.</p><p>Ukraine has previously employed the Neptune missile in&nbsp;strikes against Russian military infrastructure. Reports from 2023&nbsp;indicate its use against a&nbsp;Russian S-400 air defense system in&nbsp;occupied Crimea. In&nbsp;2024, modified Neptune missiles were reportedly used to&nbsp;target Russian military storage sites, including drone and equipment depots in&nbsp;Yeysk and near Kursk.</p><p><b>Neptune missile and other missile programs</b></p><p>Before the full-scale invasion, Ukraine had various missile programs in&nbsp;development, including the Neptune anti-ship cruise missile. In&nbsp;April 2023, it&nbsp;was revealed that Ukraine was adapting the Neptune missile for land-based targets.</p><p>The Ukrainian Armed Forces have since utilized Neptune missiles in&nbsp;attacks on&nbsp;oil terminals, ammunition depots, and air defense systems. Other notable targets included airfields and Russia’s S-400 Triumf systems in&nbsp;Crimea.</p><p>In&nbsp;late August, Ukraine successfully  its first ballistic missile, according to&nbsp;Zelenskyy. The president mentioned that Ukraine is&nbsp;progressing toward deploying these domestically-developed ballistic missiles, marking a&nbsp;significant milestone in&nbsp;the country’s defense capabilities.</p>","contentLength":2724,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jbx0ox/ukraines_longrange_neptune_missile_successfully/"}],"tags":["news","reddit"]}