{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"SteamOS 3.7.0 Preview Released (with KDE Plasma 6 & beginnings of support for non-Steam Deck handhelds)","url":"https://steamcommunity.com/games/1675200/announcements/detail/529841158837240757","date":1742127048,"author":"/u/pihug12","guid":580,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jck2mn/steamos_370_preview_released_with_kde_plasma_6/"},{"title":"Debian point release 12.10.....if you care and use.","url":"https://www.debian.org/News/2025/20250315","date":1742100124,"author":"/u/unixbhaskar","guid":582,"unread":true,"content":"<p>The Debian project is pleased to announce the tenth update of its\nstable distribution Debian 12 (codename ).\nThis point release mainly adds corrections for security issues,\nalong with a few adjustments for serious problems. Security advisories\nhave already been published separately and are referenced where available.</p><p>Please note that the point release does not constitute a new version of Debian\n12 but only updates some of the packages included. There is\nno need to throw away old  media. After installation,\npackages can be upgraded to the current versions using an up-to-date Debian\nmirror.</p><p>Those who frequently install updates from security.debian.org won't have\nto update many packages, and most such updates are\nincluded in the point release.</p><p>New installation images will be available soon at the regular locations.</p><p>Upgrading an existing installation to this revision can be achieved by\npointing the package management system at one of Debian's many HTTP mirrors.\nA comprehensive list of mirrors is available at:</p><p>This stable update adds a few important corrections to the following packages:</p><table border=\"0\" summary=\"\"><tbody><tr><td>Fix crash when modifying userPassword using malformed input [CVE-2024-2199 CVE-2024-8445]; prevent denial of service while attempting to log in with a user with a malformed hash in their password [CVE-2024-5953]; prevent denial of service on the directory server with specially-crafted LDAP query [CVE-2024-3657]</td></tr><tr><td>New upstream bugfix release</td></tr><tr><td>Fix tests causing FTBFS on the auto-builder network</td></tr><tr><td>Fix unintended HTTPS upgrades or premature reversion to HTTP when both subdomains and parent domains are used [CVE-2024-9681]; prevent stopping of stunnel before retries in the built-time tests; fix possible credentials leakage issues [CVE-2024-11053 CVE-2025-0167]; fix test failures due to port clashes</td></tr><tr><td>Do not cache result of get_default_value_for_field</td></tr><tr><td>Fix issue when rendering an invalid monochrome DICOM image [CVE-2024-47796]; ensure: HighBit &lt; BitsAllocated [CVE-2024-52333]; fix possible overflows when allocating memory [CVE-2024-27628]; fix two segmentation faults [CVE-2024-34508 CVE-2024-34509]; fix arbitrary code execution issue [CVE-2024-28130]; fix buffer overflow issues [CVE-2025-25472 CVE-2025-25474]; fix NULL pointer dereference issue [CVE-2025-25475]</td></tr><tr><td>Increase Linux kernel ABI to 6.1.0-32; rebuild against proposed-updates</td></tr><tr><td>Add missing parameters for source upload target</td></tr><tr><td>Fix authentication bypass [CVE-2024-21543]</td></tr><tr><td>Fix overflow condition in PeCoffLoaderRelocateImage() [CVE-2024-38796]; fix potential UINT32 overflow in S3 ResumeCount [CVE-2024-1298]</td></tr><tr><td>Fix tests on machines with 2 vCPU or fewer</td></tr><tr><td>Fix sandbox bypass vulnerability in Nasal scripts [CVE-2025-0781]</td></tr><tr><td>Fix build failure on single-CPU machines</td></tr><tr><td>Fix buffer overflow when printing assertion failure message [CVE-2025-0395]; fix memset performance for unaligned destinations; fix TLS performance degradation after dlopen() usage; avoid integer truncation when parsing CPUID data with large cache sizes; ensure data passed to the rseq syscall are properly initialized</td></tr><tr><td>New upstream security release [CVE-2023-34440 CVE-2023-43758 CVE-2024-24582 CVE-2024-28047 CVE-2024-28127 CVE-2024-29214 CVE-2024-31068 CVE-2024-31157 CVE-2024-36293 CVE-2024-37020 CVE-2024-39279 CVE-2024-39355]</td></tr><tr><td>Fix arbitrary code execution issues [CVE-2024-56201 CVE-2024-56326]</td></tr><tr><td>Fix build failure on single-CPU systems</td></tr><tr><td>Fix CSRF vulnerability on 2FA registration interface [CVE-2024-52948]</td></tr><tr><td>Set correct default permissions for shared memory [CVE-2024-46544]</td></tr><tr><td>Fix buffer overflow vulnerability [CVE-2023-32181 CVE-2023-22652]</td></tr><tr><td>Add option to read username/password from file [CVE-2023-35789]</td></tr><tr><td>Fix out-of-bounds read in gnu_longlink() [CVE-2021-33643]; fix out-of-bounds read in gnu_longname() [CVE-2021-33644]; fix memory leak in th_read() [CVE-2021-33645]; fix memory leak in th_read() [CVE-2021-33646]</td></tr><tr><td>New upstream release; bump ABI to 32</td></tr><tr><td>Fix multi axes movement on single axis G0 MDI call</td></tr><tr><td>New upstream stable release; fix security issue [CVE-2024-21096]; fix denial of service issue [CVE-2025-21490]</td></tr><tr><td>Impose response limits on HTTP server connections [CVE-2025-26819]</td></tr><tr><td>Install fcitx icons to the correct locations</td></tr><tr><td>Ignore test warnings from astropy</td></tr><tr><td>Fix possible bypass of client certificate authentication [CVE-2025-23419]</td></tr><tr><td>Fix CSRF vulnerability [CVE-2023-45857]; fix potential vulnerability in URL when determining an origin [CVE-2024-57965]</td></tr><tr><td>Fix mishandling of non-integer values leading to denial of service in nanoid [CVE-2024-55565]; fix parsing of external untrusted CSS [CVE-2023-44270]</td></tr><tr><td>Fix build failure arising from changed timeout API</td></tr><tr><td>New upstream stable release; harden PQescapeString and allied functions against invalidly-encoded strings; improve behavior of libpq's quoting functions [CVE-2025-1094]</td></tr><tr><td>Fix behavior when parsing chunked transfer encoding bodies and zero-length Content-Length headers [CVE-2023-40175]; limit size of chunk extensions [CVE-2024-21647]; prevent manipulation of headers set by intermediate proxies [CVE-2024-45614]</td></tr><tr><td>Fix regular expression-based denial of service issue [CVE-2023-36053], denial of service issues [CVE-2024-38875 CVE-2024-39614 CVE-2024-41990 CVE-2024-41991], user enumeration issue [CVE-2024-39329], directory traversal issue [CVE-2024-39330], excessive memory consumption issue [CVE-2024-41989], SQL injection issue [CVE-2024-42005]</td></tr><tr><td>Run tests only if /tmp is tmpfs, otherwise they are known to fail</td></tr><tr><td>Avoid segmentation fault if a SIGTERM is received during startup</td></tr><tr><td>Fix parallel running of tests</td></tr><tr><td>Fix sandbox bypass vulnerability in Nasal scripts [CVE-2025-0781]</td></tr><tr><td>Apply GPO policy consistently [CVE-2023-3758]</td></tr><tr><td>Fix vulnerable parsing of control characters in paths served by mod_dav_svn [CVE-2024-46901]</td></tr><tr><td>Ignore test warnings from astropy</td></tr><tr><td>New upstream release; update data for Paraguay; update leap second information</td></tr><tr><td>Fix URL of public Vagrant registry</td></tr><tr><td>Fix crash when expanding  in substitute [CVE-2023-2610]; fix buffer-overflow in vim_regsub_both() [CVE-2023-4738]; fix heap use after free in ins_compl_get_exp() [CVE-2023-4752]; fix heap-buffer-overflow in vim_regsub_both [CVE-2023-4781]; fix buffer-overflow in trunc_string() [CVE-2023-5344]; fix stack-buffer-overflow in option callback functions [CVE-2024-22667]; fix heap-buffer-overflow in ins_typebuf (CVE-2024-43802]; fix use-after-free when closing a buffer [CVE-2024-47814]; fix build failure on 32-bit architectures</td></tr><tr><td>Fix mishandling of semicolons in userinfo in URLs [CVE-2024-38428]</td></tr><tr><td>Allow direct kernel boot with kernels &gt;= 6.12</td></tr></tbody></table><p>This revision adds the following security updates to the stable release.\nThe Security Team has already released an advisory for each of these\nupdates:</p><p>The following packages were removed due to circumstances beyond our control:</p><p>The installer has been updated to include the fixes incorporated\ninto stable by the point release.</p><p>The complete lists of packages that have changed with this revision:</p><p>The current stable distribution:</p><p>Proposed updates to the stable distribution:</p><p>stable distribution information (release notes, errata etc.):</p><p>Security announcements and information:</p><p>The Debian Project is an association of Free Software developers who\nvolunteer their time and effort in order to produce the completely\nfree operating system Debian.</p><p>For further information, please visit the Debian web pages at\n<a href=\"https://www.debian.org/\">https://www.debian.org/</a>, send mail to\n&lt;press@debian.org&gt;, or contact the stable release team at\n&lt;debian-release@lists.debian.org&gt;.</p>","contentLength":7343,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jcdupk/debian_point_release_1210if_you_care_and_use/"},{"title":"What is Valve's end goal with linux and gaming?","url":"https://www.reddit.com/r/linux/comments/1jcd0vy/what_is_valves_end_goal_with_linux_and_gaming/","date":1742097093,"author":"/u/Karmic_Backlash","guid":584,"unread":true,"content":"<p>I'll be the first to admit that I am a bit of a fan of valve if only at least in Stockholm Syndrome. I own a steamdeck and use their storefront, and have bought many games from them. However, as a linux user, over the years I've developed a strange feeling about their linux push. </p><p>So, first thing thats crossed my mind is their main selling point in the space, Proton (and by proxy, wine). The whole idea is running windows applications and specifically games on linux. But that doesn't really feel like a long term solution. It basically requires that anything to do with gaming necessarily depends on windows and its systems. If people just stopped making windows builds of their stuff then linux gaming would suffer just as much.</p><p>You would think that by now they would have tried to address this, and while I know the classic XKCD joke of \"14 Competing Standards\" rings here, but Valve has the best chance out of everyone to try, even if it fails, they'd still ideally have wine to fall back on.</p><p>My second question is more to do with their lack of any movement outside of gaming. Don't get me wrong, they are a  platform and gaming focused developer. I'm not expecting them to shoulder the whole of the desktop on their shoulders, but it would be a serious feather in their cap to directly advertise that their software can do more then  gaming. The whole desktop mode of their flagship distro is fully featured just like any other.</p><p>Third question, and this is more of a plea for context if it exists then a question, have they said anything about their long term goals anywhere, because I haven't heard anything. I'd love to know if they do actually have a roadmap, if only to know how to set my expectations.</p>","contentLength":1710,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux in Furniture Store","url":"https://www.reddit.com/r/linux/comments/1jc76ce/linux_in_furniture_store/","date":1742078627,"author":"/u/S4ndwichGurk3","guid":583,"unread":true,"content":"<p>I was amazed today and have to share this.</p><p>I was in a large furniture store today in Germany and asked an employee about my online order. She went to the PC and I noticed that it runs Linux. It looked like an older version of KDE. Okay, Linux might be getting more popular for such use-cases, if I had a company like this I would also use Linux, so maybe not that special.</p><p>But what really amazed me was their software. It is as simple as it gets: a TUI with green text and black background, no mouse input, all done by keyboard, navigating around, entering in some numbers, and within seconds she printed something for me.</p><p>It reminded me of an opposite example at my health insurance provider, where she had to click and move the mouse for 5 minutes until she printed what I needed.</p>","contentLength":779,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Simple Linux Desktop for People with Cognitive Decline – Where to Start?","url":"https://www.reddit.com/r/linux/comments/1jc3mfs/a_simple_linux_desktop_for_people_with_cognitive/","date":1742068545,"author":"/u/Important-Ad2632","guid":581,"unread":true,"content":"<p>I have this idea that might be a bit far-fetched, and even though I’ve used Linux for years, I’m not really sure where to start.</p><p>The Background My dad was diagnosed with dementia over a year ago. While he’s still able to think clearly in many ways, his ability to use technology has taken a hit. He only got into computers and smartphones later in life, and now, with so much of society relying on digital tools—whether it’s banking, doctor appointments, or even just staying in touch—he’s struggling.</p><p>Where I live, we even have a government-issued two-factor authentication device/app that’s required for almost everything. It’s frustrating for him, and I’ve seen firsthand how technology, which should be making life easier, is actually making him feel more isolated. And let’s be real—this reliance on tech is only going to increase.</p><p>The Idea I’d love to create an ultra-simple Linux desktop tailored for people like my dad. Something that: • Boots straight into a locked-down, minimal desktop. • Has only a few essential programs, like a web browser, email client, or video calling app. • Allows relatives to configure everything through an admin panel setting bookmarks, fixing icons, and keeping things simple. • Runs on familiar hardware, since Linux makes it easy to install on existing devices with a USB.</p><p>This would be a passion project. I just see a real need for it, and I’m sure it could help a lot of people.</p><p>My Question I’m not planning on touching kernel code or diving into low-level OS development. I have some programming experience (mostly in data engineering and data science), but I don’t even know where to start researching a project like this. What tools or frameworks should I look into? Are there existing Linux distros or desktop environments that could be adapted for this purpose?</p><p>I know this won’t be ready in time to help my dad, but I’d still love to explore the idea. Any pointers would be appreciated!</p><p>Even if I drop the project along the way I still get to learn something new about Linux </p>","contentLength":2062,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Testing PostMarketOS On MS Surface GO 2","url":"https://lemmy.ca/post/40708674","date":1742055927,"author":"/u/giannidunk","guid":579,"unread":true,"content":"<div>Testing Generic x86 edge PostMarketOS with gnome on my MS Surface GO. It's the best linux experience I have had on it. I want to test plasma mobile next.</div>","contentLength":153,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jbyv46/testing_postmarketos_on_ms_surface_go_2/"}],"tags":["dev","reddit"]}