{"id":"7wt7rdxCE7L7Nv3kp2","title":"Security News","displayTitle":"Security News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":28,"items":[{"title":"Samsung TVs to stop collecting Texans’ data without express consent","url":"https://www.bleepingcomputer.com/news/security/samsung-tvs-to-stop-collecting-texans-data-without-express-consent/","date":1772378614,"author":"Bill Toulas","guid":155239,"unread":true,"content":"<article>Samsung and the State of Texas have reached a settlement agreement over the alleged unlawful collection of content-viewing information through its smart TVs [...]</article>","contentLength":162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"QuickLens Chrome extension steals crypto, shows ClickFix attack","url":"https://www.bleepingcomputer.com/news/security/quicklens-chrome-extension-steals-crypto-shows-clickfix-attack/","date":1772306332,"author":"Lawrence Abrams","guid":155048,"unread":true,"content":"<article>A Chrome extension named \"QuickLens - Search Screen with Google Lens\" has been removed from the Chrome Web Store after it was compromised to push malware and attempt&nbsp;to steal crypto from&nbsp;thousands of users. [...]</article>","contentLength":214,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ClawJacked Flaw Lets Malicious Sites Hijack Local OpenClaw AI Agents via WebSocket","url":"https://thehackernews.com/2026/02/clawjacked-flaw-lets-malicious-sites.html","date":1772299260,"author":"The Hacker News","guid":155020,"unread":true,"content":"<article>OpenClaw has fixed a high-severity security issue that, if successfully exploited, could have allowed a malicious website to connect to a locally running artificial intelligence (AI) agent and take over control.\n\"Our vulnerability lives in the core system itself – no plugins, no marketplace, no user-installed extensions – just the bare OpenClaw gateway, running exactly as documented,\" Oasis</article>","contentLength":397,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhMEZ7gMViZ9XlXs35FiyviBZR19FbDXmatfjhNRw59daWLw41ScorGKG3xXYWFD6dDuYHajwoUnkWgQV9SrPe9iiV8UqDVjw4K5hX8cng7VDPTsljAZazuxUDdk7_hZ7SFV9rDCxNcYNWjmEY_lUVj01-PEI9D9rY5tMYJZTP5X887UuXOsDD90UOvo_mG/s1600/opem.jpg","enclosureMime":"","commentsUrl":null},{"title":"$4.8M in crypto stolen after Korean tax agency exposes wallet seed","url":"https://www.bleepingcomputer.com/news/security/48m-in-crypto-stolen-after-korean-tax-agency-exposes-wallet-seed/","date":1772291843,"author":"Bill Toulas","guid":154969,"unread":true,"content":"<article>South Korea's National Tax Service accidentally exposed the mnemonic recovery phrase of a seized cryptocurrency wallet in an official press release, allowing hackers to steal 6.4 billion won ($4.8M) worth in cryptocurrency. [...]</article>","contentLength":229,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Who is the Kimwolf Botmaster “Dort”?","url":"https://krebsonsecurity.com/2026/02/who-is-the-kimwolf-botmaster-dort/","date":1772280117,"author":"BrianKrebs","guid":154940,"unread":true,"content":"<p>In early January 2026, KrebsOnSecurity revealed how a security researcher disclosed a vulnerability that was used to build , the world’s largest and most disruptive botnet. Since then, the person in control of Kimwolf — who goes by the handle “” — has coordinated a barrage of distributed denial-of-service (DDoS), doxing and email flooding attacks against the researcher and this author, and more recently caused a SWAT team to be sent to the researcher’s home. This post examines what is knowable about Dort based on public information.</p><p>A public “dox” created in 2020 asserted Dort was a teenager from Canada (DOB August 2003) who used the aliases “” and “.” A search on the username CPacket at the open source intelligence platform  finds a  account under the names Dort and CPacket that was created in 2017 using the email address .</p><div><img aria-describedby=\"caption-attachment-73247\" decoding=\"async\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/cpacket-discord.png\" alt=\"\" width=\"749\" height=\"537\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/cpacket-discord.png 988w, https://krebsonsecurity.com/wp-content/uploads/2026/02/cpacket-discord-768x551.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/cpacket-discord-782x561.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\"></div><p>The cyber intelligence firm  says jay.miner232@gmail.com was used between 2015 and 2019 to create accounts at multiple cybercrime forums, including  (username “Uubuntuu”) and (user “Dorted”); Intel 471 reports that both of these accounts were created from the same Internet address at Rogers Canada (99.241.112.24).</p><p>Dort was an extremely active player in the Microsoft game  who gained notoriety for their “” software that helped players cheat. But somewhere along the way, Dort graduated from hacking Minecraft games to enabling far more serious crimes.</p><p>Dort also used the nickname , an identity that was active in March 2022 on the chat server for the prolific cybercrime group known as <a href=\"https://krebsonsecurity.com/tag/lapsus/\" target=\"_blank\" rel=\"noopener\">LAPSUS$</a>. Dort peddled a service for registering temporary email addresses, as well as “<a href=\"https://pypi.org/project/dort/\" target=\"_blank\" rel=\"noopener\">Dortsolver</a>,” code that could bypass various CAPTCHA services designed to prevent automated account abuse. Both of these offerings were advertised in 2022 on , a Telegram channel dedicated to <a href=\"https://krebsonsecurity.com/category/sim-swapping/\" target=\"_blank\" rel=\"noopener\">SIM-swapping</a> and account takeover activity.</p><p>The cyber intelligence firm indexed 2022 posts on SIM Land by Dort that show this person developed the disposable email and CAPTCHA bypass services with the help of another hacker who went by the handle “.”</p><p>“I legit just work with Jacob,” Qoft said in 2022 in reply to another user, referring to their exclusive business partner Dort. In the same conversation, Qoft bragged that the two had stolen more than $250,000 worth of <a href=\"https://www.xbox.com/en-US/xbox-game-pass\" target=\"_blank\" rel=\"noopener\">Microsoft Xbox Game Pass accounts</a> by developing a program that mass-created Game Pass identities using stolen payment card data.</p><p>Who is the Jacob that Qoft referred to as their business partner? The breach tracking service  finds the password used by jay.miner232@gmail.com was reused by just one other email address: . Recall that the 2020 dox of Dort said their date of birth was August 2003 (8/03).</p><p>Searching this email address at  reveals it was used in 2015 to register several Minecraft-themed domains, all assigned to a Jacob Butler in Ottawa, Canada and to the Ottawa phone number 613-909-9727.</p><p>Constella Intelligence finds jacobbutler803@gmail.com was used to register an account on the hacker forum Nulled in 2016, as well as the account name “M1CE” on Minecraft. Pivoting off the password used by their Nulled account shows it was shared by the email addresses<strong> j.a.y.m.iner232@gmail.com</strong> and , the latter being an address at a domain for the <strong>Ottawa-Carelton District School Board</strong>.</p><p>Data indexed by the breach tracking service  suggests that at one point Jacob Butler shared a computer with his mother and a sibling, which might explain why their email accounts were connected to the password “jacobsplugs.” Neither Jacob nor any of the other Butler household members responded to requests for comment.</p><p>The open source intelligence service  finds jacobbutler803@gmail.com created the GitHub account “.” Meanwhile, Flashpoint indexed a deleted anonymous Pastebin.com post from 2017 declaring that MemeClient was the creation of a user named CPacket — one of Dort’s early monikers.</p><p>Why is Dort so mad? On January 2, KrebsOnSecurity published <a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" target=\"_blank\" rel=\"noopener\">The Kimwolf Botnet is Stalking Your Local Network</a>, which explored research into the botnet by , founder of the proxy tracking service . Brundage figured out that the Kimwolf botmasters were exploiting a little-known weakness in residential proxy services to infect poorly-defended devices — like TV boxes and digital photo frames — plugged into the internal, private networks of proxy endpoints.</p><p>By the time that story went live, most of the vulnerable proxy providers had been notified by Brundage and had fixed the weaknesses in their systems. That vulnerability remediation process massively slowed Kimwolf’s ability to spread, and within hours of the story’s publication Dort created a Discord server in my name that began publishing personal information about and violent threats against Brundage, Yours Truly, and others.</p><div><img aria-describedby=\"caption-attachment-73249\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/ben-flyswat.png\" alt=\"\" width=\"750\" height=\"652\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/ben-flyswat.png 872w, https://krebsonsecurity.com/wp-content/uploads/2026/02/ben-flyswat-768x668.png 768w, https://krebsonsecurity.com/wp-content/uploads/2026/02/ben-flyswat-782x680.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\"><p>Dort and friends incriminating themselves by planning swatting attacks in a public Discord server.</p></div><p>Last week, Dort and friends used that same Discord server (then named “Krebs’s Koinbase Kallers”) to threaten a swatting attack against Brundage, again posting his home address and personal information. Brundage told KrebsOnSecurity that local police officers subsequently visited his home in response to a swatting hoax which occurred around the same time that another member of the server posted a door emoji and taunted Brundage further.</p><div><img aria-describedby=\"caption-attachment-73245\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/02/ben-door.png\" alt=\"\" width=\"748\" height=\"155\"><p>Dort, using the alias “Meow,” taunts Synthient founder Ben Brundage with a picture of a door.</p></div><p>Someone on the server then linked to a cringeworthy (and NSFW) new Soundcloud <a href=\"https://soundcloud.com/dortdev/larpgod\" target=\"_blank\" rel=\"noopener\">diss track</a> recorded by the user DortDev that included a stickied message from Dort saying, “Ur dead nigga. u better watch ur fucking back. sleep with one eye open. bitch.”</p><p>“It’s a pretty hefty penny for a new front door,” the diss track intoned. “If his head doesn’t get blown off by SWAT officers. What’s it like not having a front door?”</p><p>With any luck, Dort will soon be able to tell us all exactly what it’s like.</p><p> Jacob Butler responded to requests for comment, speaking with KrebsOnSecurity briefly via telephone. Butler said he didn’t notice earlier requests for comment because he hasn’t really been online since 2021, after his home was swatted multiple times. He acknowledged making and distributing a Minecraft cheat long ago, but said he hasn’t played the game in years and was not involved in Dortsolver or any other activity attributed to the Dort nickname after 2021.</p><p>“It was a really old cheat and I don’t remember the name of it,” Butler said of his Minecraft modification. “I’m very stressed, man. I don’t know if people are going to swat me again or what. After that, I pretty much walked away from everything, logged off and said fuck that. I don’t go online anymore. I don’t know why people would still be going after me, to be completely honest.”</p><p>When asked what he does for a living, Butler said he mostly stays home and helps his mom around the house because he struggles with autism and social interaction. He maintains that someone must have compromised one or more of his old accounts and is impersonating him online as Dort.</p><p>“Someone is actually probably impersonating me, and now I’m really worried,” Butler said. “This is making me relive everything.”</p><p>But there are issues with Butler’s timeline. For example, Jacob’s voice in our phone conversation was remarkably similar to the Jacob/Dort whose voice can be heard in <a href=\"https://www.youtube.com/watch?v=yntHEanT3u8\" target=\"_blank\" rel=\"noopener\">this Sept. 2022 Clash of Code competition</a> between Dort and another coder (Dort lost). At around 6 minutes and 10 seconds into the recording, Dort launches into a cursing tirade that mirrors the stream of profanity in the diss rap that Dortdev posted threatening Brundage. Dort can be heard again at around 16 minutes; at around 26:00, Dort threatens to swat his opponent.</p><p>Butler said the voice of Dort is not his, exactly, but rather that of an impersonator who had likely cloned his voice.</p><p>“I would like to clarify that was absolutely not me,” Butler said. “There must be someone using a voice changer. Or something of the sorts. Because people were cloning my voice before and sending audio clips of ‘me’ saying outrageous stuff.”</p>","contentLength":8168,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Thousands of Public Google Cloud API Keys Exposed with Gemini Access After API Enablement","url":"https://thehackernews.com/2026/02/thousands-of-public-google-cloud-api.html","date":1772272560,"author":"The Hacker News","guid":154899,"unread":true,"content":"<article>New research has found that Google Cloud API keys, typically designated as project identifiers for billing purposes, could be abused to authenticate to sensitive Gemini endpoints and access private data.\nThe findings come from Truffle Security, which discovered nearly 3,000 Google API keys (identified by the prefix \"AIza\") embedded in client-side code to provide Google-related services like</article>","contentLength":393,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj1wA-JoARjvd0BYW-3G0XMdHXcWpWdkWk3bIkWV2myMGfRRsp4Dl8A24cpj8Elpe5lJO6KdyS36Nsts7_o0Xx70HSxwY3se4RuNPRzfFmodMhX-jU_lkCefaathP6uan4UGLWmuQvxjerq6_H-z16vFY3h4pCeVqDBGA13ne12uRZfuU7fHW2pQVAtuM4E/s1600/gemini.jpg","enclosureMime":"","commentsUrl":null},{"title":"Pentagon Designates Anthropic Supply Chain Risk Over AI Military Dispute","url":"https://thehackernews.com/2026/02/pentagon-designates-anthropic-supply.html","date":1772254620,"author":"The Hacker News","guid":154871,"unread":true,"content":"<article>Anthropic on Friday hit back after U.S. Secretary of Defense Pete Hegseth directed the Pentagon to designate the artificial intelligence (AI) upstart as a \"supply chain risk.\"\n\"This action follows months of negotiations that reached an impasse over two exceptions we requested to the lawful use of our AI model, Claude: the mass domestic surveillance of Americans and fully autonomous weapons,\" the</article>","contentLength":398,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhP1VB5XjUzzozGARm5rLhXynwMUWvOhyS4BwO0WHVH6BWf7DhyphenhyphencjAx23XY3HJhDvtgaJ_nW31sVB9yejXl_h6PS1m-X2lbtohZZuJIiSkhRvFsgLASnaDT-PGlcqhsMX-0X7OkK865R0UlztioEsFS8vkdv73Sarw7_H6mvg14v_ovh6hk9NqW3tzlmZ8X/s1600/Anthropic.jpg","enclosureMime":"","commentsUrl":null},{"title":"Friday Squid Blogging: Squid Fishing in Peru","url":"https://www.schneier.com/blog/archives/2026/02/friday-squid-blogging-squid-fishing-in-peru.html","date":1772229885,"author":"Bruce Schneier","guid":154719,"unread":true,"content":"<p>Peru has <a href=\"https://www.bairdmaritime.com/fishing/regulation-enforcement/peru-updates-giant-squid-catch-limit-for-artisanal-fishing\">increased</a> its squid catch limit. The article says “giant squid,” but they can’t possibly mean that.</p><p>As usual, you can also use this squid post to talk about the security stories in the news that I haven’t covered.</p>","contentLength":229,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft testing Windows 11 batch file security improvements","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-testing-windows-11-batch-file-security-improvements/","date":1772222427,"author":"Sergiu Gatlan","guid":154679,"unread":true,"content":"<article>Microsoft is rolling out new Windows 11 Insider Preview builds that improve security and performance during batch file or CMD script execution. [...]</article>","contentLength":149,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"APT37 hackers use new malware to breach air-gapped networks","url":"https://www.bleepingcomputer.com/news/security/apt37-hackers-use-new-malware-to-breach-air-gapped-networks/","date":1772220085,"author":"Bill Toulas","guid":154664,"unread":true,"content":"<article>North Korean hackers are deploying newly uncovered tools to move data between internet-connected and air-gapped systems, spread via removable drives, and conduct covert surveillance. [...]</article>","contentLength":188,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Europol-led crackdown on The Com hackers leads to 30 arrests","url":"https://www.bleepingcomputer.com/news/security/police-crackdown-on-the-com-cybercrime-gang-leads-to-30-arrests/","date":1772216415,"author":"Sergiu Gatlan","guid":154641,"unread":true,"content":"<article>A yearlong Europol-coordinated operation dubbed \"Project Compass\" has led to 30 arrests and 179 suspects being tied to \"The Com,\" an online cybercrime collective that targets children and teenagers. [...]</article>","contentLength":204,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DoJ Seizes $61 Million in Tether Linked to Pig Butchering Crypto Scams","url":"https://thehackernews.com/2026/02/doj-seizes-61-million-in-tether-linked.html","date":1772215860,"author":"The Hacker News","guid":154663,"unread":true,"content":"<article>The U.S. Department of Justice (DoJ) this week announced the seizure of $61 million worth of Tether that were allegedly associated with bogus cryptocurrency schemes known as pig butchering.\nThe confiscated funds were traced to cryptocurrency addresses used for the laundering of criminally derived proceeds stolen from victims of cryptocurrency investment scams, the department added.\n\"Criminal</article>","contentLength":394,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEglF1nudH44Lr269ed-E49qDWqg7t-GFuybhyQ8-6oDnBn-CcFh7o21w44Cjxxw0cuZQDBXdHQCxuOrR_vOLEvON4DyGSPWbr-7l3XaHXInETTZLxm-BAfCxUCFZ-Wxek-TnFI8t1rJ3gew5p3BnztZeIXY0ePy6DUFqL5R9QlKHZaUOVPwdIuDLkCju83c/s1600/tether-scam.jpg","enclosureMime":"","commentsUrl":null},{"title":"900+ Sangoma FreePBX Instances Compromised in Ongoing Web Shell Attacks","url":"https://thehackernews.com/2026/02/900-sangoma-freepbx-instances.html","date":1772215140,"author":"The Hacker News","guid":154640,"unread":true,"content":"<article>The Shadowserver Foundation has revealed that over 900 Sangoma FreePBX instances still remain infected with web shells as part of attacks that exploited a command injection vulnerability starting in December 2025.\nOf these, 401 instances are located in the U.S., followed by 51 in Brazil, 43 in Canada, 40 in Germany, and 36 in France.\nThe non-profit entity said the compromises are likely</article>","contentLength":389,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgVfnqoWodxrya2TOd7lDLrZ23Bvo_FZhrnRLTnOO-Y4zvouKylIpkT7KE_LKo8lQGBCwMo3GCldGiyqSJobUKHLxmKx6hja0EBG6K3DCtQG-bmDDapu2el8CnQMMs971cJ3dICyw4-T1I8o0W7-XNHKzRBO8U48USZlO8MmtJkKKaOkweEzgKZF2PyaUt9/s1600/freepbx.jpg","enclosureMime":"","commentsUrl":null},{"title":"CISA warns that RESURGE malware can be dormant on Ivanti devices","url":"https://www.bleepingcomputer.com/news/security/cisa-warns-that-resurge-malware-can-be-dormant-on-ivanti-devices/","date":1772207824,"author":"Bill Toulas","guid":154576,"unread":true,"content":"<article>The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released new details about RESURGE, a malicious implant used in zero-day attacks exploiting CVE-2025-0282 to breach Ivanti Connect Secure devices. [...]</article>","contentLength":221,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Malicious Go Crypto Module Steals Passwords, Deploys Rekoobe Backdoor","url":"https://thehackernews.com/2026/02/malicious-go-crypto-module-steals.html","date":1772206380,"author":"The Hacker News","guid":154607,"unread":true,"content":"<article>Cybersecurity researchers have disclosed details of a malicious Go module that's designed to harvest passwords, create persistent access via SSH, and deliver a Linux backdoor named Rekoobe.\nThe Go module, github[.]com/xinfeisoft/crypto, impersonates the legitimate \"golang.org/x/crypto\" codebase, but injects malicious code that's responsible for exfiltrating secrets entered via terminal password</article>","contentLength":397,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjdXNmYRKw13_BHE7B7MMtqTTpJXBkgDzl2sH31t0L0_VCl9uJbWPS2yg0j0jz0XJovSYryM4NcSCAZdtTDsoRa2d6y3U84K9TDQYJSObLgaJXXh8juWmP6liqj_uirhZvKjR0dqYZ-J2mwTnmEIYIKfAoC9BY3yL2xhfLD_NbwVKzekKwoI3u4iSzU44Xn/s1600/hackers.jpg","enclosureMime":"","commentsUrl":null},{"title":"Third-Party Patching and the Business Footprint We All Share","url":"https://www.bleepingcomputer.com/news/security/third-party-patching-and-the-business-footprint-we-all-share/","date":1772204410,"author":"Sponsored by Action1","guid":154562,"unread":true,"content":"<article>Everyday tools like PDF readers, email clients, and archive utilities quietly define the real attack surface. Action1 explains how third-party software drift increases exploit risk and why consistent patching reduces exposure across endpoints. [...]</article>","contentLength":249,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ScarCruft Uses Zoho WorkDrive and USB Malware to Breach Air-Gapped Networks","url":"https://thehackernews.com/2026/02/scarcruft-uses-zoho-workdrive-and-usb.html","date":1772196180,"author":"The Hacker News","guid":154505,"unread":true,"content":"<article>The North Korean threat actor known as ScarCruft has been attributed to a fresh set of tools, including a backdoor that uses Zoho WorkDrive for command-and-control (C2) communications to fetch more payloads and an implant that uses removable media to relay commands and breach air-gapped networks.\nThe campaign, codenamed Ruby Jumper by Zscaler ThreatLabz, involves the deployment of malware</article>","contentLength":391,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjGnWXXVXx1WeEkTWrq3_CCY922KPE3hV_pg-UYgx86QO76S5DomWi6TxZZQSGZ1Jpf2Rp2riR41Ld7zqWhjfdniLJthYBBDJx3eyNFMPQn5ph9kmmRyrib3HpIe1o5oEp6htOMFVe-m9UQNaXhhoY6MkHeXk1oM4UfctRDC5piMbIZGdjr2bApPUzXMQXK/s1600/keys.jpg","enclosureMime":"","commentsUrl":null},{"title":"Ukrainian man pleads guilty to running AI-powered fake ID site","url":"https://www.bleepingcomputer.com/news/security/ukrainian-man-pleads-guilty-to-running-ai-powered-fake-id-site/","date":1772195407,"author":"Sergiu Gatlan","guid":154514,"unread":true,"content":"<article>A Ukrainian man has pleaded guilty to operating OnlyFake, an AI-powered website that generated and sold more than 10,000 photos of fake identification documents to customers worldwide. [...]</article>","contentLength":190,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why Tehran’s Two-Tiered Internet Is So Dangerous","url":"https://www.schneier.com/blog/archives/2026/02/why-tehrans-two-tiered-internet-is-so-dangerous.html","date":1772193959,"author":"Bruce Schneier","guid":154504,"unread":true,"content":"<p>Iran is <a href=\"https://www.theguardian.com/world/2026/jan/28/iran-appears-to-ease-internet-blackout\">slowly emerging</a> from the <a href=\"https://www.nytimes.com/2026/01/25/world/middleeast/iran-internet.html\">most severe</a> communications blackout in its history and one of the longest in the world. Triggered as part of January’s government crackdown against citizen protests nationwide, the regime implemented an <a href=\"https://www.aljazeera.com/news/2026/2/2/irans-economy-falters-as-internet-shutdown-hits-people-businesses-hard\">internet shutdown</a> that transcends the standard definition of internet censorship. This was not merely blocking social media or foreign websites; it was a total communications shutdown.</p><p>Unlike previous Iranian internet shutdowns where Iran’s domestic intranet—the National Information Network (NIN)—remained functional to keep the banking and administrative sectors running, the 2026 blackout <a href=\"https://www.iranintl.com/en/202601273307\">disrupted</a> local infrastructure as well. Mobile networks, text messaging services, and landlines were disabled—even Starlink was <a href=\"https://www.techpolicy.press/what-irans-internet-shutdown-reveals-about-starlink/\">blocked</a>. And when a few domestic services became available, the state surgically removed social features, such as comment sections on news sites and chat boxes in online marketplaces. The objective seems clear. The Iranian government aimed to atomize the population, preventing not just the flow of information out of the country but the coordination of any activity within it.</p><p>This escalation marks a strategic shift from the shutdown <a href=\"https://www.nytimes.com/2025/10/17/world/middleeast/iran-shutdown-restrictions.html\">observed</a> during the “12-Day War” with Israel in mid-2025. Then, the government primarily blocked particular types of traffic while leaving the underlying internet remaining available. The regime’s actions this year entailed a more brute-force approach to internet censorship, where both the physical and logical layers of connectivity were&nbsp;dismantled.</p><p>The ability to disconnect a population is a <a href=\"https://gizmodo.com/how-governments-turn-the-internet-into-a-weapon-2000699263\">feature</a> of modern authoritarian network design. When a government treats connectivity as a faucet it can turn off at will, it asserts that the right to speak, assemble, and access information is revocable. The human right to the internet is not just about bandwidth; it is about the <a href=\"https://www.globalcitizen.org/en/content/internet-access-basic-human-right/\">right to exist</a> within the modern public square. Iran’s actions deny its citizens this existence, reducing them to subjects who can be silenced—and authoritarian governments elsewhere are taking note.</p><p>The current blackout is not an isolated panic reaction but a stress test for a long-term strategy, say advocacy groups—a <a href=\"https://filter.watch/english/2025/08/01/investigative-report-july-2025-tiering-internet/\">two-tiered</a> or “<a href=\"https://niacouncil.org/iran-moves-toward-tiered-internet-access-amid-post-war-security-justifications-and-digital-regulation/\">class-based</a>” internet known as Internet-e-Tabaqati. Iran’s Supreme Council of Cyberspace, the country’s highest internet policy body, has been laying the legal and technical <a href=\"https://filter.watch/english/2026/01/15/iran-enters-a-new-age-of-digital-isolation-2/\">groundwork</a> for this since 2009.</p><p>In July 2025, the council <a href=\"https://en.radiozamaneh.com/37071/\">passed a regulation</a> formally institutionalizing a two-tiered hierarchy. Under this system, access to the global internet is no longer a default for citizens, but instead a <a href=\"https://www.iranintl.com/en/202601208428\">privilege</a><a href=\"https://restofworld.org/2026/iran-blackout-tiered-internet/\">granted</a> based on loyalty and professional necessity. The implementation includes such things as “<a href=\"https://itemlive.com/2025/12/23/commentary-irans-white-sim-card-scandal-reveals-privilege-state-control-and-fake-dissent/\">white SIM cards</a>“: special mobile lines issued to government officials, security forces, and approved journalists that bypass the state’s filtering apparatus entirely.</p><p>While ordinary Iranians are forced to navigate a maze of unstable VPNs and blocked ports, holders of white SIMs enjoy unrestricted access to Instagram, Telegram, and WhatsApp. This tiered access is further enforced through <a href=\"https://itemlive.com/2025/12/23/commentary-irans-white-sim-card-scandal-reveals-privilege-state-control-and-fake-dissent/\">whitelisting</a> at the data center level, creating a digital apartheid where connectivity is a reward for compliance. The regime’s goal is to make the cost of a general shutdown <a href=\"https://www.iranintl.com/en/202511288631\">manageable</a> by ensuring that the state and its loyalists remain connected while plunging the public into darkness. (In the latest shutdown, for instance, white SIM holders regained connectivity earlier than the general population.)</p><p>The technical architecture of Iran’s shutdown reveals its primary purpose: social control through isolation. Over the years, the regime has learned that simple censorship—blocking specific URLs—is insufficient against a tech-savvy population armed with circumvention tools. The answer instead has been to build a “sovereign” network structure that allows for granular control.</p><p>By disabling local communication channels, the state prevents the “swarm” dynamics of modern unrest, where small protests coalesce into large movements through real-time coordination. In this way, the shutdown breaks the psychological momentum of the protests. The blocking of chat functions in nonpolitical apps (like ridesharing or shopping platforms) illustrates the regime’s paranoia: Any channel that allows two people to exchange text is seen as a threat.</p><p>The United Nations and various international bodies have <a href=\"https://www.globalcitizen.org/en/content/internet-access-basic-human-right/\">increasingly recognized</a> internet access as an enabler of other fundamental human rights. In the context of Iran, the internet is the only independent witness to history. By severing it, the regime creates a zone of impunity where atrocities can be committed without immediate consequence.</p><p>Iran’s digital repression model is distinct from, and in some ways more dangerous than, China’s “Great Firewall.” China built its digital ecosystem from the ground up with sovereignty in mind, creating domestic alternatives like WeChat and Weibo that it fully controls. Iran, by contrast, is building its controls <a href=\"https://niacouncil.org/iran-moves-toward-tiered-internet-access-amid-post-war-security-justifications-and-digital-regulation/\">on top of</a> the standard global internet infrastructure.</p><p>Unlike China’s censorship regime, Iran’s overlay model is highly exportable. It demonstrates to other authoritarian regimes that they can still achieve high levels of control by retrofitting their existing networks. We are already seeing signs of “authoritarian learning,” where techniques tested in Tehran are being studied by regimes in unstable democracies and dictatorships alike. The most recent shutdown in <a href=\"https://www.aljazeera.com/news/2025/9/30/afghanistan-imposes-internet-blackout-what-has-the-effect-been-so-far\">Afghanistan</a>, for example, was more sophisticated than previous ones. If Iran succeeds in normalizing tiered access to the internet, we can expect to see similar white SIM policies and tiered access models proliferate globally.</p><p>The international community must move <a href=\"https://freedomonlinecoalition.com/joint-statement-on-internet-shutdowns-in-the-islamic-republic-of-iran/\">beyond</a><a href=\"https://www.linkedin.com/pulse/joint-statement-internet-architects-leaders-condemn-iran-ranjbar-t0rre\">condemnation</a> and treat connectivity as a humanitarian imperative. A <a href=\"https://cadeproject.org/updates/civil-society-groups-launch-campaign-urging-humanitarian-use-of-direct-to-cell-satellite-connectivity-during-internet-shutdowns/\">coalition of civil society organizations</a> has already launched a campaign <a href=\"https://www.witness.org/civil-society-coalition-launches-campaign-calling-for-direct-to-cell-satellite-connectivity-amid-irans-internet-shutdowns/\">calling for</a> “<a href=\"https://www.direct2cell.org/\">direct-to-cell</a>” (D2C) satellite connectivity. Unlike traditional satellite internet, which requires conspicuous and expensive dishes such as Starlink terminals, D2C technology connects directly to standard smartphones and is much more resilient to infrastructure shutdowns. The technology works; all it requires is implementation.</p><p>This is a technological measure, but it has a strong policy component as well. Regulators should require satellite providers to include humanitarian access protocols in their licensing, ensuring that services can be activated for civilians in designated crisis zones. Governments, particularly the United States, should ensure that technology sanctions do not inadvertently block the hardware and software needed to circumvent censorship. General licenses should be expanded to cover satellite connectivity explicitly. And funding should be directed toward technologies that are harder to whitelist or block, such as mesh networks and D2C solutions that bypass the choke points of state-controlled ISPs.</p><p>Deliberate internet shutdowns are <a href=\"https://www.accessnow.org/campaign/keepiton/\">commonplace</a> throughout the world. The 2026 shutdown in Iran is a glimpse into a <a href=\"https://freedomhouse.org/report/freedom-net/2025/uncertain-future-global-internet\">fractured internet</a>. If we are to end countries’ ability to limit access to the rest of the world for their populations, we need to build resolute architectures. They don’t solve the problem, but they do give people in repressive countries a fighting chance.</p>","contentLength":7376,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Phishing Attacks Against People Seeking Programming Jobs","url":"https://www.schneier.com/blog/archives/2026/02/phishing-attacks-against-people-seeking-programming-jobs.html","date":1772193868,"author":"Bruce Schneier","guid":154503,"unread":true,"content":"<p><a href=\"https://www.reversinglabs.com/blog/fake-recruiter-campaign-crypto-devs\">This</a> is new. North Korean hackers are posing as company recruiters, enticing job candidates to participate in coding challenges. When they run the code they are supposed to work on, it installs malware on their system.</p>","contentLength":218,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trojanized Gaming Tools Spread Java-Based RAT via Browser and Chat Platforms","url":"https://thehackernews.com/2026/02/trojanized-gaming-tools-spread-java.html","date":1772186760,"author":"The Hacker News","guid":154464,"unread":true,"content":"<article>Threat actors are luring unsuspecting users into running trojanized gaming utilities that are distributed via browsers and chat platforms to distribute a remote access trojan (RAT).\n\"A malicious downloader staged a portable Java runtime and executed a malicious Java archive (JAR) file named jd-gui.jar,\" the Microsoft Threat Intelligence team said in a post on X. \"This downloader used PowerShell</article>","contentLength":397,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEillKgTghwZEhxrFFKb47xsniaaZYeDlISTMJYxMDr_82YETlHvM5M0XWXjizlkv1MgSAzkIEDbOcvfPsjsOaxRHvzl4-7LWTmKR6awOPB_FidaOgq0xhHslZbEJ7zh0Hq6CV0NJ8LUY-SDyA-nF6SeQ6Zzu-qrlWWMFsVg2n3yDRj0hcIPYEPLw6eAmadL/s1600/remote.jpg","enclosureMime":"","commentsUrl":null},{"title":"Meta Files Lawsuits Against Brazil, China, Vietnam Advertisers Over Celeb-Bait Scams","url":"https://thehackernews.com/2026/02/meta-files-lawsuits-against-brazil.html","date":1772178960,"author":"The Hacker News","guid":154401,"unread":true,"content":"<article>Meta on Thursday said it's taking legal action to tackle scams on its platforms by filing lawsuits against what it calls deceptive advertisers based in Brazil, China, and Vietnam.\nAs part of the effort, the advertisers' methods of payment have been suspended, related accounts have been disabled, and the website domain names used to pull off the scams have been blocked.\nConcurrently, the social</article>","contentLength":396,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiwKH9i7LZ3Jt6juj9BX2MCjTNRBKuvKX58L2mWuQN1teRdCwExZsz5LLZNBRvRri4BtJW1ECj92EU42c1XJfy1vBdLXZoxIfjzKEca7ST3Fw-jhU0_XakPBZfgQF1huHepkdAUFmrRtXWUsdnBf-W6cYEtWehaJ1Ca41-6DK414TB_2QwF9M5sm-ofmOuG/s1600/facebook-ads.jpg","enclosureMime":"","commentsUrl":null},{"title":"Previously harmless Google API keys now expose Gemini AI data","url":"https://www.bleepingcomputer.com/news/security/previously-harmless-google-api-keys-now-expose-gemini-ai-data/","date":1772139329,"author":"Bill Toulas","guid":154231,"unread":true,"content":"<article>Google API keys for services like Maps&nbsp;embedded in accessible&nbsp;client-side code could be used to authenticate to the Gemini AI assistant and access private data. [...]</article>","contentLength":168,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Aeternum C2 Botnet Stores Encrypted Commands on Polygon Blockchain to Evade Takedown","url":"https://thehackernews.com/2026/02/aeternum-c2-botnet-stores-encrypted.html","date":1772128800,"author":"The Hacker News","guid":154179,"unread":true,"content":"<article>Cybersecurity researchers have disclosed details of a new botnet loader called Aeternum C2 that uses a blockchain-based command-and-control (C2) infrastructure to make it resilient to takedown efforts.\n\"Instead of relying on traditional servers or domains for command-and-control, Aeternum stores its instructions on the public Polygon blockchain,\" Qrator Labs said in a report shared with The</article>","contentLength":393,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiQlH8RQUmcg8IWqV76NL0o4uRe86gJ6kxLV3DRYppBAVrfFR_gMPQBFn6GIl2jd9ZgzsuwRGAGTVUbaWCj795-XZ8I3eSBDLz6Q_0w4Alef6GNA3NtpK4po_WVC6p9o4aNVHqgCAEb3a7CqL_x7oBGWQ7N4z0IMyzOX3aZoI_TUZenfdAm0LZojDIkumG0/s1600/botnet.jpg","enclosureMime":"","commentsUrl":null},{"title":"Trend Micro warns of critical Apex One code execution flaws","url":"https://www.bleepingcomputer.com/news/security/trend-micro-warns-of-critical-apex-one-rce-vulnerabilities/","date":1772128708,"author":"Sergiu Gatlan","guid":154121,"unread":true,"content":"<article>Trend Micro has patched two critical Apex One vulnerabilities&nbsp;that allow attackers to gain remote code execution (RCE) on vulnerable&nbsp;Windows systems. [...]</article>","contentLength":157,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"European DYI chain ManoMano data breach impacts 38 million customers","url":"https://www.bleepingcomputer.com/news/security/european-dyi-chain-manomano-data-breach-impacts-38-million-customers/","date":1772127321,"author":"Bill Toulas","guid":154120,"unread":true,"content":"<article>DIY store chain ManoMano is notifying customers of a data breach personal data, which was caused by hackers compromising a third-party service provider. [...]</article>","contentLength":158,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Critical Juniper Networks PTX flaw allows full router takeover","url":"https://www.bleepingcomputer.com/news/security/critical-juniper-networks-ptx-flaw-allows-full-router-takeover/","date":1772124132,"author":"Bill Toulas","guid":154060,"unread":true,"content":"<article>A critical vulnerability in the Junos OS Evolved network operating system running on PTX&nbsp;Series routers from Juniper Networks could allow an unauthenticated attacker to execute code remotely with root privileges. [...]</article>","contentLength":219,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Olympique Marseille confirms 'attempted' cyberattack after data leak","url":"https://www.bleepingcomputer.com/news/security/olympique-marseille-football-club-confirms-cyberattack-after-data-leak/","date":1772122290,"author":"Sergiu Gatlan","guid":154059,"unread":true,"content":"<article>French professional football club Olympique de Marseille has confirmed a cyberattack after a threat actor claimed on Monday that it breached the club's systems earlier this month. [...]</article>","contentLength":185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["security"]}