{"id":"7wt7rdxCE7L7Nv3kp2","title":"Security News","displayTitle":"Security News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":36,"items":[{"title":"Landmark Admin data breach impact now reaches 1.6 million people","url":"https://www.bleepingcomputer.com/news/security/landmark-admin-data-breach-impact-now-reaches-16-million-people/","date":1744742037,"author":"Bill Toulas","guid":23450,"unread":true,"content":"<article>Landmark Admin has issued an update to its investigation of a cyberattack it suffered in May 2024, increasing the number of impacted individuals to 1.6 million. [...]</article>","contentLength":166,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Infamous message board 4chan taken down following major hack","url":"https://www.bleepingcomputer.com/news/security/infamous-message-board-4chan-taken-down-following-major-hack/","date":1744740826,"author":"Sergiu Gatlan","guid":23432,"unread":true,"content":"<article>4chan, a notorious online forum, was taken offline earlier today after what appears to be a significant hack and has since been loading intermittently. [...]</article>","contentLength":157,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft blocks ActiveX by default in Microsoft 365, Office 2024","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-blocks-activex-by-default-in-microsoft-365-office-2024/","date":1744736242,"author":"Sergiu Gatlan","guid":23368,"unread":true,"content":"<article>Microsoft announced it will begin disabling all ActiveX controls in Windows versions of Microsoft 365 and Office 2024 applications later this month. [...]</article>","contentLength":154,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Slopsquatting","url":"https://www.schneier.com/blog/archives/2025/04/slopsquatting.html","date":1744732974,"author":"Bruce Schneier","guid":23347,"unread":true,"content":"<p>As AI coding assistants invent nonexistent software libraries to download and use, enterprising attackers <a href=\"https://www.theregister.com/2025/04/12/ai_code_suggestions_sabotage_supply_chain/\">create and upload</a> libraries with those names—laced with malware, of course.</p>","contentLength":183,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft: Exchange 2016 and 2019 reach end of support in six months","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-2016-and-2019-reach-end-of-support-in-six-months/","date":1744729641,"author":"Sergiu Gatlan","guid":23305,"unread":true,"content":"<article>​Microsoft warned that Exchange 2016 and Exchange 2019 will reach the end of support six months from now, on October 14. [...]</article>","contentLength":128,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Chinese Hackers Target Linux Systems Using SNOWLIGHT Malware and VShell Tool","url":"https://thehackernews.com/2025/04/chinese-hackers-target-linux-systems.html","date":1744725960,"author":"The Hacker News","guid":23285,"unread":true,"content":"<article>The China-linked threat actor known as UNC5174 has been attributed to a new campaign that leverages a variant of a known malware dubbed SNOWLIGHT and a new open-source tool called VShell to infect Linux systems.\n\"Threat actors are increasingly using open source tools in their arsenals for cost-effectiveness and obfuscation to save money and, in this case, plausibly blend in with the pool of</article>","contentLength":393,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhVwcaYeCYgHPgvHh00NL6MRo5ONZUCqiExrptRPTSt7pkU1klxcdKhiSysw0jCmzeQspZswu8zkBl_2hzSOvUjR4TXLEv9D8xUpXt0HmpiQERmdb_I9GQW645n5K8nWvUVFV_QQZSZbod-GRnGUCOWUs6OfVS0xaSwdTuZ57NjAAxodb8pIwPSS9Kqalru/s1600/v-main.jpg","enclosureMime":"","commentsUrl":null},{"title":"Google adds Android auto-reboot to block forensic data extractions","url":"https://www.bleepingcomputer.com/news/security/google-adds-android-auto-reboot-to-block-forensic-data-extractions/","date":1744725297,"author":"Bill Toulas","guid":23287,"unread":true,"content":"<article>Google is rolling out a new security mechanism on Android devices that will automatically reboot locked, unused devices after three consecutive days of inactivity, restoring memory to an encrypted state. [...]</article>","contentLength":209,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Critical Apache Roller Vulnerability (CVSS 10.0) Enables Unauthorized Session Persistence","url":"https://thehackernews.com/2025/04/critical-apache-roller-vulnerability.html","date":1744724640,"author":"The Hacker News","guid":23284,"unread":true,"content":"<article>A critical security vulnerability has been disclosed in the Apache Roller open-source, Java-based blogging server software that could allow malicious actors to retain unauthorized access even after a password change.\nThe flaw, assigned the CVE identifier CVE-2025-24859, carries a CVSS score of 10.0, indicating maximum severity. It affects all versions of Roller up to and including 6.1.4.</article>","contentLength":390,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgdg30x7LpUZq-_V7cgW06GN3QIm6FN8fhri2MKCKF9gNAGjx55Fu87OnQQMqoT7mjsrdmKLwAbX7GqqY1kWNdETTwjHdVatnWVZoBXRpdEG4dlmOm79v1SihN5UhPbw-pUykftCwzqpJpRwY2CcZcVOT8rRWoR5OHNVp5qwz_gdhP7k3XhN1ZDpjiP7Wuk/s1600/apache.jpg","enclosureMime":"","commentsUrl":null},{"title":"Microsoft warns of CPU spikes when typing in classic Outlook","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-cpu-spikes-when-typing-in-classic-outlook/","date":1744724475,"author":"Sergiu Gatlan","guid":23286,"unread":true,"content":"<article>Microsoft warned Windows users of increased CPU usage when typing while using recent versions of the classic Outlook email client. [...]</article>","contentLength":136,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Malicious PyPI Package Targets MEXC Trading API to Steal Credentials and Redirect Orders","url":"https://thehackernews.com/2025/04/malicious-pypi-package-targets-mexc.html","date":1744723200,"author":"The Hacker News","guid":23283,"unread":true,"content":"<article>Cybersecurity researchers have disclosed a malicious package uploaded to the Python Package Index (PyPI) repository that's designed to reroute trading orders placed on the MEXC cryptocurrency exchange to a malicious server and steal tokens.\nThe package, ccxt-mexc-futures, purports to be an extension built on top of a popular Python library named ccxt (short for CryptoCurrency eXchange Trading),</article>","contentLength":397,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJdXtd9Ylo6f1P7QljTiXFMQtpcro40XhEWP2qY_g_VXEW01JS6F4wUxcv49JRFFA1P8M2goWV3TIifA1y9TPFp8HEfYWb2SJawYrDFvPFQTYw3KTfJhZE-F3PaeTDxwOUWxCcwkHprd24UL_wsMjDDolLdOJ1XfthyphenhyphenV34-NMDq7b615BsRzFtwuYoKv-b/s1600/python-malware.jpg","enclosureMime":"","commentsUrl":null},{"title":"Majority of Browser Extensions Can Access Sensitive Enterprise Data, New Report Finds","url":"https://thehackernews.com/2025/04/majority-of-browser-extensions-can.html","date":1744716300,"author":"The Hacker News","guid":23210,"unread":true,"content":"<article>Everybody knows browser extensions are embedded into nearly every user’s daily workflow, from spell checkers to GenAI tools. What most IT and security people don’t know is that browser extensions’ excessive permissions are a growing risk to organizations.\nLayerX today announced the release of the Enterprise Browser Extension Security Report 2025, This report is the first and only report to merge</article>","contentLength":404,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZr1iutAkYWc7slZoMKvt-Tk1J5bGk18paNxiYqAlktACoyBjNlcApmZJwdndWRPto0R1SZqAXz4bnMlMxUpvpKXuyKn64r1g7NSDFXMiF9LuK58W9waa8Y3THexkEDgSUNRG599hCaye3Z3R65tUxcqjm1uTDp92fG75QPyBjg9gc6IrXJHnkrZ9zYPc/s1600/browser-data.jpg","enclosureMime":"","commentsUrl":null},{"title":"Crypto Developers Targeted by Python Malware Disguised as Coding Challenges","url":"https://thehackernews.com/2025/04/crypto-developers-targeted-by-python.html","date":1744708200,"author":"The Hacker News","guid":23187,"unread":true,"content":"<article>The North Korea-linked threat actor assessed to be behind the massive Bybit hack in February 2025 has been linked to a malicious campaign that targets developers to deliver new stealer malware under the guise of a coding assignment.\nThe activity has been attributed by Palo Alto Networks Unit 42 to a hacking group it tracks as Slow Pisces, which is also known as Jade Sleet, PUKCHONG,</article>","contentLength":385,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiFmDyWjpYw8CZMAeNl3Lv9E6WTUY5k6Kt5zCTIjRUVADYm6AGFVwH2W88uD08pPjJ6Nnm_uRfls-cc10sjQkSurnzviBpBdtMg3gSdcS-rqanMXmB_68eywErgBCL_XErf0aEwPOGd9MoPHIctlk8Kpld46ekaq69apBlHnMdETzP_YPqQbkZzO-br_dUH/s1600/python.jpg","enclosureMime":"","commentsUrl":null},{"title":"Gladinet’s Triofox and CentreStack Under Active Exploitation via Critical RCE Vulnerability","url":"https://thehackernews.com/2025/04/gladinets-triofox-and-centrestack-under.html","date":1744691940,"author":"The Hacker News","guid":23128,"unread":true,"content":"<article>A recently disclosed security flaw in Gladinet CentreStack also impacts its Triofox remote access and collaboration solution, according to Huntress, with seven different organizations compromised to date.\nTracked as CVE-2025-30406 (CVSS score: 9.0), the vulnerability refers to the use of a hard-coded cryptographic key that could expose internet-accessible servers to remote code execution attacks</article>","contentLength":398,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh8lwnTDT7Q-mlh4VT0U3LF2lnTsVx_2Vk6QszopP-ZdOgXYQ6A-q0vB4QKtvjn5sTldk3Oh9jvzMTL4tmeNzN_o_O-zs4NZmBhJ3FwS17_y5ItiHpJCTNfBM0wofbxo5bYyLzCJSRzyM7VsN_C4BQYFNuA9D3ibVwbhhL0F5eM0US_s-6_m4SLsSm6W8tA/s1600/poc-ex.jpg","enclosureMime":"","commentsUrl":null},{"title":"Meta Resumes E.U. AI Training Using Public User Data After Regulator Approval","url":"https://thehackernews.com/2025/04/meta-resumes-eu-ai-training-using.html","date":1744690200,"author":"The Hacker News","guid":23127,"unread":true,"content":"<article>Meta has announced that it will begin to train its artificial intelligence (AI) models using public data shared by adults across its platforms in the European Union, nearly a year after it paused its efforts due to data protection concerns from Irish regulators.\n\"This training will better support millions of people and businesses in Europe, by teaching our generative AI models to better</article>","contentLength":389,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiVYoPN2ELCq4MpC6RUdwDyKXYp0_NIZiYMB0kNk2L80BhY-CuhKJq4xv-bRGNOKgEa4m4hV3crPW3YTPxS8xO0xP9-M_9k0h7b63JsXX7rOOup2SUOrIBk2ZEayrRP9ya0TzoXAHNgMPx2lc-bQDytgySNTzq693ly05ild3lHzoLGLL9VEB0LZMJUSwyh/s1600/facebook-ai-eu.jpg","enclosureMime":"","commentsUrl":null},{"title":"Trump Revenge Tour Targets Cyber Leaders, Elections","url":"https://krebsonsecurity.com/2025/04/trump-revenge-tour-targets-cyber-leaders-elections/","date":1744687671,"author":"BrianKrebs","guid":23125,"unread":true,"content":"<p> last week revoked security clearances for , the former director of the <strong>Cybersecurity and Infrastructure Security Agency</strong> (CISA) who was fired by Trump after declaring the 2020 election the most secure in U.S. history. The White House memo, which also suspended clearances for other security professionals at Krebs’s employer , comes as CISA is facing huge funding and staffing cuts.</p><div><img aria-describedby=\"caption-attachment-70987\" decoding=\"async\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/chriskrebs-gi.png\" alt=\"\" width=\"750\" height=\"330\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/chriskrebs-gi.png 883w, https://krebsonsecurity.com/wp-content/uploads/2025/04/chriskrebs-gi-768x337.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/04/chriskrebs-gi-782x344.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\"><p>Chris Krebs. Image: Getty Images.</p></div><p>The extraordinary <a href=\"https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-addresses-risks-from-chris-krebs-and-government-censorship/\" target=\"_blank\" rel=\"noopener\">April 9 memo</a> directs the attorney general to investigate Chris Krebs (no relation), calling him “a significant bad-faith actor who weaponized and abused his government authority.”</p><p>The memo said the inquiry will include “a comprehensive evaluation of all of CISA’s activities over the last 6 years and will identify any instances where Krebs’ or CISA’s conduct appears to be contrary to the administration’s commitment to free speech and ending federal censorship, including whether Krebs’ conduct was contrary to suitability standards for federal employees or involved the unauthorized dissemination of classified information.”</p><p>CISA was created in 2018 during Trump’s first term, with Krebs installed as its first director. In 2020, CISA launched Rumor Control, a website that sought to rebut disinformation swirling around the 2020 election.</p><p>That effort ran directly counter to Trump’s claims that he lost the election because it was somehow hacked and stolen. The Trump campaign and its supporters filed at least 62 lawsuits contesting the election, vote counting, and vote certification in nine states, and nearly all of those cases were dismissed or dropped for lack of evidence or standing.</p><p>When the Justice Department began prosecuting people who violently attacked the U.S. Capitol on January 6, 2021, President Trump and Republican leaders shifted the narrative, claiming that Trump lost the election because the previous administration had censored conservative voices on social media.</p><p>Incredibly, the president’s memo seeking to ostracize Krebs stands reality on its head, accusing Krebs of promoting the censorship of election information, “including known risks associated with certain voting practices.” Trump also alleged that Krebs “<em>falsely and baselessly denied that the 2020 election was rigged and stolen</em>, including by inappropriately and categorically dismissing widespread election malfeasance and serious vulnerabilities with voting machines” [emphasis added].</p><p>Krebs did not respond to a request for comment. SentinelOne issued <a href=\"https://www.sentinelone.com/blog/an-official-statement-in-response-to-the-april-9-2025-executive-order/\" target=\"_blank\" rel=\"noopener\">a statement</a> saying it would cooperate in any review of security clearances held by its personnel, which is currently fewer than 10 employees.</p><p>Krebs’s former agency is now facing steep budget and staff reductions. <a href=\"https://therecord.media/trump-administration-planning-workforce-cuts-at-cisa/\" target=\"_blank\" rel=\"noopener\">reports</a> that CISA is looking to remove some 1,300 people by cutting about half its full-time staff and another 40% of its contractors.</p><p>“The agency’s National Risk Management Center, which serves as a hub analyzing risks to cyber and critical infrastructure, is expected to see significant cuts, said two sources familiar with the plans,” The Record’s  wrote. “Some of the office’s systematic risk responsibilities will potentially be moved to the agency’s Cybersecurity Division, according to one of the sources.”</p><p>CNN <a href=\"https://archive.ph/InCFx#selection-2323.226-2323.412\" target=\"_blank\" rel=\"noopener\">reports</a> the Trump administration is also advancing plans to strip civil service protections from 80% of the remaining CISA employees, potentially allowing them to be fired for political reasons.</p><p>The <strong>Electronic Frontier Foundation</strong> (EFF) urged professionals in the cybersecurity community to defend Krebs and SentinelOne, noting that other security companies and professionals could be the next victims of Trump’s efforts to politicize cybersecurity.</p><p>“The White House must not be given free reign to turn cybersecurity professionals into political scapegoats,” the EFF <a href=\"https://www.eff.org/deeplinks/2025/04/cybersecurity-community-must-not-remain-silent-executive-order-attacking-former\" target=\"_blank\" rel=\"noopener\">wrote</a>. “It is critical that the cybersecurity community now join together to denounce this chilling attack on free speech and rally behind Krebs and SentinelOne rather than cowering because they fear they will be next.”</p><p>However, <a href=\"https://www.reuters.com/world/us/cybersecurity-industry-falls-silent-trump-turns-ire-sentinelone-2025-04-10/\" target=\"_blank\" rel=\"noopener\">said</a> it found little sign of industry support for Krebs or SentinelOne, and that many security professionals are concerned about potentially being targeted if they speak out.</p><p>“Reuters contacted 33 of the largest U.S. cybersecurity companies, including tech companies and professional services firms with large cybersecurity practices, and three industry groups, for comment on Trump’s action against SentinelOne,” wrote  and . “Only one offered comment on Trump’s action. The rest declined, did not respond or did not answer questions.”</p><p>On April 3, President Trump fired , the head of the (NSA) and the , as well as Haugh’s deputy, . The president did so immediately after meeting in the Oval Office with far-right conspiracy theorist <a href=\"https://en.wikipedia.org/wiki/Laura_Loomer\" target=\"_blank\" rel=\"noopener\">Laura Loomer</a>, who reportedly urged their dismissal. Speaking to reporters on Air Force One after news of the firings broke, Trump questioned Haugh’s loyalty.</p><div><img aria-describedby=\"caption-attachment-70998\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/genhaugh-cspan.png\" alt=\"\" width=\"749\" height=\"377\"><p>Gen. Timothy Haugh. Image: C-SPAN.</p></div><p>Virginia , the top Democrat on the Senate Intelligence Committee, called it inexplicable that the administration would remove the senior leaders of NSA-CYBERCOM without cause or warning, and risk disrupting critical ongoing intelligence operations.</p><p>“It is astonishing, too, that President Trump would fire the nonpartisan, experienced leader of the National Security Agency while still failing to hold any member of his team accountable for leaking classified information on a commercial messaging app – even as he apparently takes staffing direction on national security from a discredited conspiracy theorist in the Oval Office,” Warner said in a statement.</p><p>On Feb. 28, The Record’s <a href=\"https://therecord.media/hegseth-orders-cyber-command-stand-down-russia-planning\" target=\"_blank\" rel=\"noopener\">cited</a> three sources saying Defense Secretary  ordered U.S. Cyber Command to stand down from all planning against Russia, including offensive digital actions. The following day, <a href=\"https://www.theguardian.com/us-news/2025/feb/28/trump-russia-hacking-cyber-security?ref=zetter-zeroday.com\" target=\"_blank\" rel=\"noopener\">reported</a> that analysts at CISA were verbally informed that they were not to follow or report on Russian threats, even though this had previously been a main focus for the agency.</p><p>A <a href=\"https://www.washingtonpost.com/national-security/2025/03/01/trump-putin-russia-cyber-offense-cisa\" target=\"_blank\" rel=\"noopener\">follow-up story</a> from  cited officials saying Cyber Command had received an order to halt active operations against Russia, but that the pause was intended to last only as long as negotiations with Russia continue.</p><p>The Department of Defense responded on Twitter/X that Hegseth had “neither canceled nor delayed any cyber operations directed against malicious Russian targets and there has been no stand-down order whatsoever from that priority.”</p><p>But on March 19, Reuters <a href=\"https://www.yahoo.com/news/exclusive-us-suspends-efforts-counter-060549726.html\" target=\"_blank\" rel=\"noopener\">reported</a> several U.S. national security agencies have halted work on a coordinated effort to counter Russian sabotage, disinformation and cyberattacks.</p><p>“Regular meetings between the National Security Council and European national security officials have gone unscheduled, and the NSC has also stopped formally coordinating efforts across U.S. agencies, including with the FBI, the Department of Homeland Security and the State Department,” Reuters reported, citing current and former officials.</p><p>President’s Trump’s institution of 125% tariffs on goods from China has seen Beijing strike back with 84 percent tariffs on U.S. imports. Now, some security experts are warning that the trade war <a href=\"https://www.theregister.com/2025/04/10/trade_war_reaches_cyberspace/\" target=\"_blank\" rel=\"noopener\">could spill over into a cyber conflict</a>, given China’s successful efforts to burrow into America’s critical infrastructure networks.</p><p>Over the past year, a number of Chinese government-backed digital intrusions have come into focus, including a sprawling espionage campaign involving the compromise of <a href=\"https://www.cybersecuritydive.com/news/salt-typhoon-telecom-attacks-lax-security/736233/\" target=\"_blank\" rel=\"noopener\">at least nine U.S. telecommunications providers</a>. Dubbed “<a href=\"https://www.nytimes.com/2024/10/26/us/politics/salt-typhoon-hack-what-we-know.html\" target=\"_blank\" rel=\"noopener\">Salt Typhoon</a>” by Microsoft, these telecom intrusions were pervasive enough that CISA and the FBI in December 2024 <a href=\"https://www.cisa.gov/resources-tools/resources/enhanced-visibility-and-hardening-guidance-communications-infrastructure\" target=\"_blank\" rel=\"noopener\">warned Americans</a> against communicating sensitive information over phone networks, urging people instead to use encrypted messaging apps (like Signal).</p><p>The other broad ranging China-backed campaign is known as “<a href=\"https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-038a\" target=\"_blank\" rel=\"noopener\">Volt Typhoon</a>,” which CISA described as “state-sponsored cyber actors seeking to pre-position themselves on IT networks for disruptive or destructive cyberattacks against U.S. critical infrastructure in the event of a major crisis or conflict with the United States.”</p><p>Responsibility for determining the root causes of the Salt Typhoon security debacle fell to the <a href=\"https://en.wikipedia.org/wiki/Cyber_Safety_Review_Board\" target=\"_blank\" rel=\"noopener\">Cyber Safety Review Board</a> (CSRB), a nonpartisan government entity established in February 2022 with a mandate to investigate the security failures behind major cybersecurity events. But on his first full day back in the White House, President Trump dismissed all 15 CSRB advisory committee members — likely because those advisers included Chris Krebs.</p><p>Last week,  (D-Ore.) placed a hold on Trump’s nominee to lead CISA, saying the hold would continue unless the agency published a report on the telecom industry hacks, as promised.</p><div data-testid=\"paragraph-6\"><p>“CISA’s multi-year cover up of the phone companies’ negligent cybersecurity has real consequences,” Wyden said in <a href=\"https://www.wyden.senate.gov/news/press-releases/wyden-places-hold-on-top-cybersecurity-nominee-to-force-release-of-important-details-on-security-threats-to-us-phone-networks\" target=\"_blank\" rel=\"noopener\">a statement</a>. “Congress and the American people have a right to read this report.”</p><p> reported last week Chinese officials acknowledged in a secret December meeting that Beijing was behind the widespread telecom industry compromises.</p><p>“The Chinese official’s remarks at the December meeting were indirect and somewhat ambiguous, but most of the American delegation in the room interpreted it as a tacit admission and a warning to the U.S. about Taiwan,” The Journal’s <a href=\"https://www.wsj.com/politics/national-security/in-secret-meeting-china-acknowledged-role-in-u-s-infrastructure-hacks-c5ab37cb\" target=\"_blank\" rel=\"noopener\">wrote</a>, citing a former U.S. official familiar with the meeting.</p><p>Meanwhile, China continues to take advantage of the mass firings of federal workers. On April 9, the <strong>National Counterintelligence and Security Center</strong><a href=\"https://www.dni.gov/files/NCSC/documents/products/2025-04-08-NCSC-FBI-DCSA-OnlineTargetingUSGEmployees.pdf\" target=\"_blank\" rel=\"noopener\">warned</a> (PDF) that Chinese intelligence entities are pursuing an online effort to recruit recently laid-off U.S. employees.</p><p>“Foreign intelligence entities, particularly those in China, are targeting current and former U.S. government (USG) employees for recruitment by posing as consulting firms, corporate headhunters, think tanks, and other entities on social and professional networking sites,” the alert warns. “Their deceptive online job offers, and other virtual approaches, have become more sophisticated in targeting unwitting individuals with USG backgrounds seeking new employment.”</p><div><a href=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/dni-china-hiring.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-70985\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/dni-china-hiring.png\" alt=\"\" width=\"749\" height=\"416\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/04/dni-china-hiring.png 1406w, https://krebsonsecurity.com/wp-content/uploads/2025/04/dni-china-hiring-768x426.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/04/dni-china-hiring-782x434.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\"></a></div><p>As Reuters <a href=\"https://www.reuters.com/world/us-suspends-some-efforts-counter-russian-sabotage-trump-moves-closer-putin-2025-03-19/\" target=\"_blank\" rel=\"noopener\">notes</a>, the FBI last month ended an effort to counter interference in U.S. elections by foreign adversaries including Russia, and put on leave staff working on the issue at the Department of Homeland Security.</p><p>Critics say the SAVE Act could disenfranchise millions of voters and discourage eligible voters from registering to vote. What’s more, documented cases of voter fraud are few and far between, as is voting by non-citizens. Even the conservative  acknowledges as much: An interactive “<a href=\"https://electionfraud.heritage.org/search\" target=\"_blank\" rel=\"noopener\">election fraud map</a>” published by Heritage lists just 1,576 convictions or findings of voter fraud between 1982 and the present day.</p><p>Nevertheless, the GOP-led House passed the SAVE Act with the help of four Democrats. Its passage in the Senate will require support from at least seven Democrats, Newsweek <a href=\"https://www.newsweek.com/democrats-who-could-cross-aisle-save-act-2058792\" target=\"_blank\" rel=\"noopener\">writes</a>.</p><p>In February, CISA cut roughly 130 employees, including its election security advisors. The agency also was forced to freeze all election security activities pending an internal review. The review was <a href=\"https://www.brennancenter.org/our-work/research-reports/how-federal-government-undermining-election-security\" target=\"_blank\" rel=\"noopener\">reportedly</a> completed in March, but the Trump administration has said the findings would not be made public, and there is no indication of whether any cybersecurity support has been restored.</p><p>Many state leaders have voiced anxiety over the administration’s cuts to CISA programs that provide assistance and threat intelligence to election security efforts. <strong>Iowa Secretary of State Paul Pate</strong> last week <a href=\"https://www.thegazette.com/campaigns-elections/iowas-top-elections-official-concerned-over-cybersecurity-funding-pause/\" target=\"_blank\" rel=\"noopener\">told</a> the  show I he would not want to see those programs dissolve.</p><p>“If those (systems) were to go away, it would be pretty serious,” Pate said. “We do count on a lot those cyber protections.”</p><p>Pennsylvania’s <strong>Secretary of the Commonwealth Al Schmidt</strong> recently warned the CISA election security cuts would make elections less secure, and said no state on its own can replace federal election cybersecurity resources.</p><p>The <strong>Pennsylvania Capital-Star</strong><a href=\"https://penncapital-star.com/election-2025/no-state-on-its-own-can-replace-federal-election-cybersecurity-resources-pa-voting-official-says/\" target=\"_blank\" rel=\"noopener\">reports</a> that several local election offices received bomb threats around the time polls closed on Nov. 5, and that in the week before the election a fake video showing mail-in ballots cast for Trump and Sen. Dave McCormick (R-Pa.) being destroyed and thrown away was linked to a Russian disinformation campaign.</p><p>“CISA was able to quickly identify not only that it was fraudulent, but also the source of it, so that we could share with our counties and we could share with the public so confidence in the election wasn’t undermined,” Schmidt said.</p><p>According to <a href=\"https://archive.ph/InCFx#selection-2339.13-2339.483\" target=\"_blank\" rel=\"noopener\">CNN</a>, the administration’s actions have deeply alarmed state officials, who warn the next round of national elections will be seriously imperiled by the cuts. A bipartisan association representing 46 secretaries of state, and several individual top state election officials, have pressed the White House about how critical functions of protecting election security will perform going forward. However, CNN reports they have yet to receive clear answers.</p><p>“None of the president’s powers allow him to change the rules of elections,” Nevada Secretary of State  wrote in <a href=\"https://www.msnbc.com/opinion/msnbc-opinion/nevada-18-states-are-suing-trump-election-executive-order-rcna200427\" target=\"_blank\" rel=\"noopener\">an April 11 op-ed</a>. “That is an intentional feature of our Constitution, which the Framers built in to ensure election integrity. Despite that, Trump is seeking to upend the voter registration process; impose arbitrary deadlines on vote counting; allow an unelected and unaccountable billionaire to invade state voter rolls; and withhold congressionally approved funding for election security.”</p><p>The order instructs the <strong>U.S. Election Assistance Commission</strong> to abruptly amend the voluntary federal guidelines for voting machines without going through the processes mandated by federal law. And it calls for allowing the administrator of the so-called <strong>Department of Government Efficiency</strong> (DOGE), along with DHS, to review state voter registration lists and other records to identify non-citizens.</p><p>The Atlantic’s  notes that the chief executive of the country — whose unilateral authority the Founding Fathers most feared — has literally no role in the federal election system.</p><p>“Trump’s executive order on elections ignores that design entirely,” Rosenzweig <a href=\"https://www.theatlantic.com/ideas/archive/2025/04/trump-election-rules-changes/682394/\" target=\"_blank\" rel=\"noopener\">wrote</a>. “He is asserting an executive-branch role in governing the mechanics of a federal election that has never before been claimed by a president. The legal theory undergirding this assertion — that the president’s authority to enforce federal law enables him to control state election activity — is as capacious as it is frightening.”</p></div>","contentLength":14630,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hertz confirms customer info and drivers' licenses stolen in data breach","url":"https://www.bleepingcomputer.com/news/security/hertz-confirms-customer-info-and-drivers-licenses-stolen-in-data-breach/","date":1744672563,"author":"Lawrence Abrams","guid":23085,"unread":true,"content":"<article>Car rental giant Hertz Corporation warns it suffered a data breach after customer data for its Hertz, Thrifty, and Dollar brands was stolen in the Cleo zero-day data theft attacks. [...]</article>","contentLength":186,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hertz confirms customer info, drivers' licenses stolen in data breach","url":"https://www.bleepingcomputer.com/news/security/hertz-confirms-customer-info-drivers-licenses-stolen-in-data-breach/","date":1744672563,"author":"Lawrence Abrams","guid":23098,"unread":true,"content":"<article>Car rental giant Hertz Corporation warns it suffered a data breach after customer data for its Hertz, Thrifty, and Dollar brands was stolen in the Cleo zero-day data theft attacks. [...]</article>","contentLength":186,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Govtech giant Conduent confirms client data stolen in January cyberattack","url":"https://www.bleepingcomputer.com/news/security/govtech-giant-conduent-confirms-client-data-stolen-in-january-cyberattack/","date":1744663810,"author":"Lawrence Abrams","guid":23041,"unread":true,"content":"<article>American business services giant and government contractor Conduent disclosed today that client data was stolen in a January 2025 cyberattack. [...]</article>","contentLength":148,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cybersecurity firm buying hacker forum accounts to spy on cybercriminals","url":"https://www.bleepingcomputer.com/news/security/cybersecurity-firm-buying-hacker-forum-accounts-to-spy-on-cybercriminals/","date":1744659394,"author":"Bill Toulas","guid":23017,"unread":true,"content":"<article>Swiss cybersecurity firm Prodaft has launched a new initiative called 'Sell your Source'&nbsp;where the company purchases verified and aged accounts on hacking forums to to spy on cybercriminals. [...]</article>","contentLength":197,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SSL/TLS certificate lifespans reduced to 47 days by 2029","url":"https://www.bleepingcomputer.com/news/security/ssl-tls-certificate-lifespans-reduced-to-47-days-by-2029/","date":1744652975,"author":"Bill Toulas","guid":23010,"unread":true,"content":"<article>The&nbsp;CA/Browser Forum has voted to significantly reduce&nbsp;the lifespan of SSL/TLS certificates over the next 4 years, with a final lifespan of just 47 days starting in 2029. [...]</article>","contentLength":178,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New ResolverRAT malware targets pharma and healthcare orgs worldwide","url":"https://www.bleepingcomputer.com/news/security/new-resolverrat-malware-targets-pharma-and-healthcare-orgs-worldwide/","date":1744648823,"author":"Bill Toulas","guid":22980,"unread":true,"content":"<article>A new&nbsp;remote access trojan (RAT) called 'ResolverRAT' is being used against organizations globally, with the malware used in recent attacks targeting the healthcare and pharmaceutical sectors. [...]</article>","contentLength":199,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ResolverRAT Campaign Targets Healthcare, Pharma via Phishing and DLL Side-Loading","url":"https://thehackernews.com/2025/04/resolverrat-campaign-targets-healthcare.html","date":1744646940,"author":"The Hacker News","guid":22933,"unread":true,"content":"<article>Cybersecurity researchers have discovered a new, sophisticated remote access trojan called ResolverRAT that has been observed in attacks targeting healthcare and pharmaceutical sectors.\n\"The threat actor leverages fear-based lures delivered via phishing emails, designed to pressure recipients into clicking a malicious link,\" Morphisec Labs researcher Nadav Lorber said in a report shared with The</article>","contentLength":398,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgix_43i4U2O57aK8hiqnp67hzJV2T6PAAz3IOzHGgyhDGT_nxaXPUjVqTFcMmEQ7UG2Q_XUFFwf3bsMk5H8YadvlYuvivTJJIno6L-vwWncP8CXxv9uW2BelEIswXVU6oCe7GcYRTUxEEd5rx-MORiXEyFq0H5-K7nU-7kCX6qlEWRwmQWPHs1lvwkwg6D/s1600/healthcare-cyberattack.jpg","enclosureMime":"","commentsUrl":null},{"title":"Upcoming Speaking Engagements","url":"https://www.schneier.com/blog/archives/2025/04/upcoming-speaking-engagements-45.html","date":1744646688,"author":"B. Schneier","guid":22930,"unread":true,"content":"<p>This is a current list of where and when I am scheduled to speak:</p><ul><li>I’m giving an online talk on AI and trust for the <a href=\"https://plamadiso.weizenbaum-institut.de/events-2025/\">Weizenbaum Institute</a> on April 24, 2025 at 2:00 PM CEST (8:00 AM ET).</li></ul>","contentLength":185,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Meta to resume AI training on content shared by Europeans","url":"https://www.bleepingcomputer.com/news/technology/meta-to-resume-ai-training-on-content-shared-by-europeans/","date":1744644824,"author":"Sergiu Gatlan","guid":22934,"unread":true,"content":"<article>Meta announced today that it will soon start training its artificial intelligence models using content shared by European adult users on its Facebook and Instagram social media platforms. [...]</article>","contentLength":193,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kidney dialysis firm DaVita hit by weekend ransomware attack","url":"https://www.bleepingcomputer.com/news/security/kidney-dialysis-firm-davita-hit-by-weekend-ransomware-attack/","date":1744640425,"author":"Bill Toulas","guid":22916,"unread":true,"content":"<article>Kidney dialysis firm DaVita disclosed Monday it suffered a weekend ransomware attack that encrypted parts of its network and impacted some of its operations. [...]</article>","contentLength":163,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Enhancing your DevSecOps with Wazuh, the open source XDR platform","url":"https://www.bleepingcomputer.com/news/security/enhancing-your-devsecops-with-wazuh-the-open-source-xdr-platform/","date":1744639271,"author":"Sponsored by Wazuh","guid":22915,"unread":true,"content":"<article>Security shouldn't wait until the end of development. Wazuh brings real-time threat detection, compliance, and vulnerability scanning into your DevOps pipeline—powering a stronger DevSecOps strategy from day one. Learn more about how Wazuh can help secure your development cycle. [...]</article>","contentLength":287,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft tells Windows users to ignore 0x80070643 WinRE errors","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-tells-windows-users-to-ignore-winre-install-errors/","date":1744637314,"author":"Sergiu Gatlan","guid":22870,"unread":true,"content":"<article>Microsoft says some users might see 0x80070643 installation failures when trying to deploy&nbsp;the April 2025&nbsp;Windows Recovery Environment (WinRE) updates. [...]</article>","contentLength":159,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Phishing Campaigns Use Real-Time Checks to Validate Victim Emails Before Credential Theft","url":"https://thehackernews.com/2025/04/phishing-campaigns-use-real-time-checks.html","date":1744637040,"author":"The Hacker News","guid":22932,"unread":true,"content":"<article>Cybersecurity researchers are calling attention to a new type of credential phishing scheme that ensures that the stolen information is associated with valid online accounts.\nThe technique has been codenamed precision-validating phishing by Cofense, which it said employs real-time email validation so that only a select set of high-value targets are served the fake login screens.\n\"This tactic not</article>","contentLength":398,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhmW3JR7o2QmGAfqPgoWm5Tlr_s7l7wqYOmOBeu0UgCXN6fBHw11Liw5Riy5TBZAhASOWFwG0eYQ72mcDNzF60PUtHq90NDay0GeaZrUYFBDSdRT99M8kMD8SAnvSZfUxxNb_HwJDLhA-1tsgSk2D75yDXHW4NUhBnTGh13gr1qFzmUeFSpatDj5jUYNZMY/s1600/phish.jpg","enclosureMime":"","commentsUrl":null},{"title":"Microsoft: New Windows updates fix Active Directory policy issues","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-new-emergency-windows-updates-fix-ad-policy-issues/","date":1744631561,"author":"Sergiu Gatlan","guid":22851,"unread":true,"content":"<article>Microsoft has released emergency Windows updates to address a known issue affecting local audit logon policies in Active Directory Group Policy. [...]</article>","contentLength":150,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenAI's GPT-4.1, 4.1 nano, and 4.1 mini models release imminent","url":"https://www.bleepingcomputer.com/news/artificial-intelligence/openais-gpt-41-41-nano-and-41-mini-models-release-imminent/","date":1744630396,"author":"Mayank Parmar","guid":22850,"unread":true,"content":"<article>According to references spotted on OpenAI's website, the Microsoft-backed AI startup is planning to launch five new models this week, including GPT-4.1, 4.1 nano, and 4.1 mini. [...]</article>","contentLength":182,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"⚡ Weekly Recap: Windows 0-Day, VPN Exploits, Weaponized AI, Hijacked Antivirus and More","url":"https://thehackernews.com/2025/04/weekly-recap-windows-0-day-vpn-exploits.html","date":1744629540,"author":"The Hacker News","guid":22849,"unread":true,"content":"<article>Attackers aren’t waiting for patches anymore — they are breaking in before defenses are ready. Trusted security tools are being hijacked to deliver malware. Even after a breach is detected and patched, some attackers stay hidden.\nThis week’s events show a hard truth: it’s not enough to react after an attack. You have to assume that any system you trust today could fail tomorrow. In a world</article>","contentLength":400,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhcb6GP8yUhrWIa0rYT28yl91t1rzdj8KYkWnOOi-FB-CS6Nmivn_qE-vFphi_2hqX9ak8LCjb9QcPPxZy9gBWRwNkmNN0tMWKyRCeiPommVNZimjMnvorRRiZqXGL_H4iXqwgOHl5hvPpfl1qqw_D-TL-hZSei5qjjiW0qZZvhuumFj2I9wDEJHE4OiL88/s1600/cyber.jpg","enclosureMime":"","commentsUrl":null},{"title":"China Sort of Admits to Being Behind Volt Typhoon","url":"https://www.schneier.com/blog/archives/2025/04/china-sort-of-admits-to-being-behind-volt-typhoon.html","date":1744628907,"author":"Bruce Schneier","guid":22822,"unread":true,"content":"<p> has the <a href=\"https://www.wsj.com/politics/national-security/in-secret-meeting-china-acknowledged-role-in-u-s-infrastructure-hacks-c5ab37cb?st=UfFBTh&amp;reflink=article_copyURL_share\">story</a>:</p><blockquote><p>Chinese officials acknowledged in a secret December meeting that Beijing was behind a widespread series of alarming cyberattacks on U.S. infrastructure, according to people familiar with the matter, underscoring how hostilities between the two superpowers are continuing to escalate.</p><p>The Chinese delegation linked years of intrusions into computer networks at U.S. ports, water utilities, airports and other targets, to increasing U.S. policy support for Taiwan, the people, who declined to be named, said.</p></blockquote><p>The admission wasn’t explicit:</p><blockquote><p>The Chinese official’s remarks at the December meeting were indirect and somewhat ambiguous, but most of the American delegation in the room interpreted it as a tacit admission and a warning to the U.S. about Taiwan, a former U.S. official familiar with the meeting said.</p></blockquote>","contentLength":825,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft: Windows Server 2025 restarts break connectivity on some DCs","url":"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-server-2025-restarts-break-services-on-domain-controllers/","date":1744628084,"author":"Sergiu Gatlan","guid":22825,"unread":true,"content":"<article>Microsoft warned IT admins that some Windows Server 2025 domain controllers might become inaccessible after a restart, causing apps and services to fail or remain unreachable. [...]</article>","contentLength":181,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cybersecurity in the AI Era: Evolve Faster Than the Threats or Get Left Behind","url":"https://thehackernews.com/2025/04/cybersecurity-in-ai-era-evolve-faster.html","date":1744626600,"author":"The Hacker News","guid":22823,"unread":true,"content":"<article>AI is changing cybersecurity faster than many defenders realize. Attackers are already using AI to automate reconnaissance, generate sophisticated phishing lures, and exploit vulnerabilities before security teams can react. Meanwhile, defenders are overwhelmed by massive amounts of data and alerts, struggling to process information quickly enough to identify real threats. AI offers a way to</article>","contentLength":393,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgeD_Go0-P2r9ZkoAeR0UShRywqcDzY4f6VJWwVM-miZzuPD_Ly-umcUVZ7OszqmjLusFBCUUkW_NdNCG6ADWKmSCNjyWwBnSlEiLONWrUDaRHrbnr5QZXLAGnolom_hc9L-ZQ_xuM16z4XrXsa3ZBDQEWyODARQwjZTPZbgVIEQoDwy9E-4Df91Lb2cAE/s1600/ai-hacker.jpg","enclosureMime":"","commentsUrl":null},{"title":"Pakistan-Linked Hackers Expand Targets in India with CurlBack RAT and Spark RAT","url":"https://thehackernews.com/2025/04/pakistan-linked-hackers-expand-targets.html","date":1744613700,"author":"The Hacker News","guid":22773,"unread":true,"content":"<article>A threat actor with ties to Pakistan has been observed targeting various sectors in India with various remote access trojans like Xeno RAT, Spark RAT, and a previously undocumented malware family called CurlBack RAT.\nThe activity, detected by SEQRITE in December 2024, targeted Indian entities under railway, oil and gas, and external affairs ministries, marking an expansion of the hacking crew's</article>","contentLength":397,"flags":null,"enclosureUrl":"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjHdxRuX44rzcNSq1lr55ivGhactRjIYLLTqUQNOyWrAWSGTcKZS-RXviCtiMcwWf2YSPil43T617kGoYreElbArRojklK7CKtM9P6DFHmuTm0FVDigxAsLP41pPKxojIOczZ8cFryQK2S38kPfNjvp-p5Ra2gQd9UG8j7BjvN9y44yHNHwP2IL-NxxWZJF/s1600/pak-hackers.jpg","enclosureMime":"","commentsUrl":null},{"title":"Chrome 136 fixes 20-year browser history privacy risk","url":"https://www.bleepingcomputer.com/news/security/chrome-136-fixes-20-year-browser-history-privacy-risk/","date":1744553908,"author":"Bill Toulas","guid":22824,"unread":true,"content":"<article>​Google is fixing a long-standing privacy issue&nbsp;that, for years, enabled websites to determine users' browsing history through the previously visited links. [...]</article>","contentLength":165,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["security"]}