{"id":"ETKeSdT1Jvn","title":"Podcasts","displayTitle":"Podcasts","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":20,"items":[{"title":"Joe Rogan Experience #2305 - Rich Vos","url":"https://www.youtube.com/watch?v=Fz1S-GyYB0U","date":1744736417,"author":"PowerfulJRE","guid":23408,"unread":true,"content":"<article>Rich Vos is a standup comic, writer, and actor. He's the host, along with his wife Bonnie McFarland, of the podcasts \"My Wife Hates Me,\" and \"For Worse.\" Catch his most recent special, \"Rich Vos: Anonymous,\" on Youtube.\nhttps://amzn.to/3NQJ2T0\nhttps://www.richvos.com\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!\n\nDownload the DraftKings Pick6 app NOW and use code ROGAN. \n\nGambling Problem? Call 1-800-GAMBLER. Help is available for problem gambling. Call (888) 789-7777 or visit https://ccpg.org (CT). 18+ in most eligible jurisdictions, but other age and eligibility restrictions may apply. Valid only in jurisdictions where DraftKings Pick6 operates. Pick6 not available everywhere, including, but not limited to NY, and CA-ONT (for up-to-date list of jurisdictions please visit https://pick6.draftkings.com/where-is-pick6-available). Void where prohibited. 1 per new Pick6 customer. $5+ first Pick Set to receive $50 issued as non-withdrawable Pick6 Credits that expire in 14 days (336 hours). Ends 5/4/25 at 11:59 PM ET. Terms: https://pick6.draftkings.com/promos Sponsored by DraftKings.</article>","contentLength":1109,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Fz1S-GyYB0U?version=3","enclosureMime":"","commentsUrl":null},{"title":"Michael Baggot - Theories of Consciousness","url":"https://www.youtube.com/watch?v=KQnLVclPd9I","date":1744729229,"author":"Closer To Truth","guid":23333,"unread":true,"content":"<article>Get member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nExplore diverse theories of consciousness including materialism, dualism, panpsychism, idealism and diverse ways of thinking about consciousness from the perspectives of neuroscience, philosophy, wisdom traditions. Compare and contrast diverse theories of consciousness as they are arrayed on a “Landscape of Consciousness”.\n\nMake a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nFr. Michael Baggot is currently a Professor Aggregato of Bioethics at the Pontifical Athenaeum Regina Apostolorum in Rome, Italy. He also serves as a professor for the Joint Diploma in Leadership: Service through Virtues. He teaches at the Catholic Worldview Fellowship summer program in Germany and Italy. He was an Adjunct Professor of Theology at the Christendom College Rome program. In addition, Baggot is a Research Scholar at the UNESCO Chair in Bioethics and Human Rights. Baggot also serves as a member of the Scholarly Advisory Board for Magisterium AI.\n\nCloser To Truth is now on BlueSky! Follow us for updates, new videos, musings, and more: https://bsky.app/profile/closertotruth.bsky.social\n\nCloser To Truth, hosted by Robert Lawrence Kuhn, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1587,"flags":null,"enclosureUrl":"https://www.youtube.com/v/KQnLVclPd9I?version=3","enclosureMime":"","commentsUrl":null},{"title":"Terrence Sejnowski on ChatGPT and the Future of AI | Closer To Truth Chats","url":"https://www.youtube.com/watch?v=CRHJMC9bBs0","date":1744653787,"author":"Closer To Truth","guid":22994,"unread":true,"content":"<article>Help Closer To Truth continue exploring the world's deepest questions without the need for paywalls with a tax-deductible donation of any amount: https://closertotruth.com/donate/\n\nIn \"ChatGPT and the Future of AI\", Terry Sejnowski offers a nuanced exploration of large language models (LLMs) like ChatGPT and what their future holds. How should we go about understanding LLMs? Do these language models truly understand what they are saying? Or is it possible that what appears to be intelligence in LLMs may be a mirror that merely reflects the intelligence of the interviewer? In his book, Sejnowski, a pioneer in computational approaches to understanding brain function, answers all our urgent questions about this astonishing new technology.\n\nTerrence Joseph Sejnowski is the Francis Crick Professor at the Salk Institute for Biological Studies where he directs the Computational Neurobiology Laboratory and is the director of the Crick-Jacobs center for theoretical and computational biology.\n\nWatch more CTT Chats here: https://t.ly/jJI7e</article>","contentLength":1044,"flags":null,"enclosureUrl":"https://www.youtube.com/v/CRHJMC9bBs0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Judith Wolfe - Dualism: Arguing Pros and Cons","url":"https://www.youtube.com/watch?v=ionCy_5Dq9g","date":1744642866,"author":"Closer To Truth","guid":22945,"unread":true,"content":"<article>Shop the Closer To Truth merch store for unique items like notebooks, mugs, hoodies, and more: https://bit.ly/3P2ogje\n\nDualism is the theory that ultimate reality is composed of two radically different kinds of things, physical things and non-physical things, and that these same two kinds of things, expressed as body/brain and spirit/soul, account for consciousness. What are the arguments for and against Dualism (like the ‘interaction problem’)?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nDr. Judith Wolfe is a Fellow in Theology at St John'sCollege in the University of Oxford. She has written widely on the interfacesbetween theology, philosophy and literature. She is General Editor of the Journal of Inklings Studies.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1259,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ionCy_5Dq9g?version=3","enclosureMime":"","commentsUrl":null},{"title":"Holmes Rolston III - What Kind of World did God Create?","url":"https://www.youtube.com/watch?v=Kc0A9eK4EEw","date":1744556427,"author":"Closer To Truth","guid":22648,"unread":true,"content":"<article>Receive member exclusives like early access to new content by registering for a free Closer To Truth account: https://closertotruth.com/\n\nTo claim God is the Creator is to assume the burden of explaining why God selected and created this particular world. What are the characteristics of this world that could credential it as the one that the Supreme Being brought into existence? Theists do not like to argue that our world is the ‘best possible world’.\n\nCloser To Truth is now on BlueSky! Follow us for updates, new videos, musings, and more: https://bsky.app/profile/closertotruth.bsky.social\n\nHolmes Rolston III was an American philosopher who was University Distinguished Professor of Philosophy at Colorado State University. He is best known for his contributions to environmental ethics and the relationship between science and religion.\n\nMake a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1282,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Kc0A9eK4EEw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Timothy Pawl - Philosophy of the Bible","url":"https://www.youtube.com/watch?v=Az1dwotyWtg","date":1744470019,"author":"Closer To Truth","guid":22494,"unread":true,"content":"<article>Subscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nThe philosophy of fields applies analytical methods and tools of philosophy to areas of knowledge, from science and mathematics to law and aesthetics. What happens when philosophers who believe in the Bible try to construct a “philosophy of the Bible”?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nTimothy J. Pawl is Professor of Philosophy at the University of St. Thomas, Minneapolis. His work is in the fields of metaphysics, philosophical theology, and moral psychology. Pawl's books include \"In Defense of Conciliar Christology: A Philosophical Essay\"  and \"The Incarnation\".\n\nShop the Closer To Truth merch store for unique items like notebooks, mugs, hoodies, and more: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1231,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Az1dwotyWtg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Philip Goff - The Field of Consciousness Studies","url":"https://www.youtube.com/watch?v=kMjHQB6SlGU","date":1744398050,"author":"Closer To Truth","guid":22289,"unread":true,"content":"<article>Like Closer To Truth on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nWhat is the current state of the consciousness studies field? What are the major issues and trends? What kinds of experiments are being conducted? What kinds of arguments are being made?\n\nContribute what you can to help Closer To Truth continue exploring the world's deepest questions without the need for paywalls: https://closertotruth.com/donate/\n\nPhilip Goff is a British author, panpsychist philosopher, and professor at Durham University whose research focuses on philosophy of mind and consciousness. Specifically, it focuses on how consciousness can be part of the scientific worldview.\n\nWear your support for the show with a Closer To Truth merchandise purchase: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1133,"flags":null,"enclosureUrl":"https://www.youtube.com/v/kMjHQB6SlGU?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2304 - Gary Brecka","url":"https://www.youtube.com/watch?v=nhC8lLPpGl4","date":1744390859,"author":"PowerfulJRE","guid":22228,"unread":true,"content":"<article>Gary Brecka is a human biologist, biohacker, longevity expert, and host of the \"Ultimate Human\" podcast.\nhttps://www.theultimatehuman.com/\nhttps://www.instagram.com/garybrecka/\n\nThis episode is brought to you by Visible. Live in the know with wireless that can keep up. One-line plans starting at $25/mo. Join now at https://visible.com/rogan.\n\nSave 20% off sitewide with code ROGAN at checkout https://meundies.com/rogan</article>","contentLength":421,"flags":null,"enclosureUrl":"https://www.youtube.com/v/nhC8lLPpGl4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Ernan McMullin - Is God the Cause of a Fine-Tuned Universe?","url":"https://www.youtube.com/watch?v=bcly1EaZFWg","date":1744383659,"author":"Closer To Truth","guid":22181,"unread":true,"content":"<article>Follow Closer To Truth on Instagram for new videos, announcements, and more: https://www.instagram.com/closertotruth/\n\nOur universe is astounding in that the laws of physics have to be perfect beyond belief for stars and planets, and for human beings, to even exist. Does this demonstrate, if not prove, an intelligence behind the universe, who many call God? There are other, naturalistic explanations. Can we compare natural and supernatural reasons?\n\nRegister for a free Closer To Truth membership to receive special exclusives like early access to new episodes and more: https://closertotruth.com/.\n\nErnan McMullin was an Irish philosopher who last served as the O’Hara Professor of Philosophy Emeritus at the University of Notre Dame. He was an internationally respected philosopher of science who has written and lectured extensively on subjects ranging from the relationship between cosmology and theology, to the role of values in understanding science, to the impact of Darwinism on Western religious thought. McMullin is the only person to ever hold the presidency of four of the major US philosophical associations.\n\nContribute what you can to support the show and help Closer To Truth continue exploring life's deepest questions: shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1583,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bcly1EaZFWg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2303 - Dave Smith & Douglas Murray","url":"https://www.youtube.com/watch?v=Ah6kirkSwTg","date":1744304419,"author":"PowerfulJRE","guid":21786,"unread":true,"content":"<article>Dave Smith is a stand-up comedian, libertarian political commentator, and podcaster. He's the host of the \"Part of the Problem\" podcast, as well as a co-host of the \"Legion of Skanks” podcast.\nhttps://www.comicdavesmith.com\n\nDouglas Murray is a political commentator, cultural critic, and author of numerous books, the most recent of which is \"Democracies and Death Cults: Israel and the Future of Civilization.\"\nhttps://a.co/d/fUGXIZQ\nhttps://www.douglasmurray.net\n\nGo to https://ExpressVPN.com/ROGANYT to get 4 months free!\n\nDon’t miss out on all the action - Download the DraftKings app today! Sign-up using https://dkng.co/rogan or with my promo code ROGAN. \nGAMBLING PROBLEM? CALL 1-800-GAMBLER, (800) 327-5050 or visit https://gamblinghelplinema.org (MA). Call 877-8-HOPENY/text HOPENY (467369) (NY). Please Gamble Responsibly. 888-789-7777/visit https://ccpg.org (CT), or visit https://www.mdgamblinghelp.org (MD). 21+ and present in most states. (18+ DC/KY/NH/WY). Void in ONT/OR/NH. Eligibility restrictions apply. On behalf of Boot Hill Casino &amp; Resort (KS).1 per new customer. $5+ first-time bet req. Max. $150 issued as non-withdrawable Bonus Bets that expire in 7 days (168 hours). Stake removed from payout. Terms: https://sportsbook.draftkings.com/promos. Ends 4/13/25 at 11:59 PM ET. Sponsored by DK.</article>","contentLength":1320,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Ah6kirkSwTg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Is AI morally neutral?","url":"https://www.youtube.com/watch?v=mWTHX01MKRI","date":1744300878,"author":"Closer To Truth","guid":21772,"unread":true,"content":"<article>Dr. Mark Bailey argues that AI is inherently amoral, but can humans impose a different morality? Bailey's full interview coming soon. #shorts</article>","contentLength":141,"flags":null,"enclosureUrl":"https://www.youtube.com/v/mWTHX01MKRI?version=3","enclosureMime":"","commentsUrl":null},{"title":"Raymond Tallis - Can Neuroscience Alone Explain Consciousness?","url":"https://www.youtube.com/watch?v=4YFaX1PRu-w","date":1744297207,"author":"Closer To Truth","guid":21731,"unread":true,"content":"<article>Wear your support for the show with a Closer To Truth merch purchase: https://bit.ly/3P2ogje\n\n‘Neurophilosophy’ is the view that all that is mental or mind or consciousness can be solved ultimately by neuroscience. ‘Neuromania’ is the view that trying to explain consciousness by physical processes alone is impossible (if not ridiculous). The two views are diametrically opposed. Appreciate the arguments of each. Then decide, which is correct?\n\nLike Closer To Truth on Facebook for daily videos, updates, announcements, and much more: https://shorturl.at/tak4l\n\nRaymond C. Tallis is a philosopher, poet, novelist, cultural critic, and a retired medical physician and clinical neuroscientist.\n\nMake a tax-deductible donation of any amount to help Closer To Truth continue exploring the world's deepest questions: https://shorturl.at/OnyRq\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1169,"flags":null,"enclosureUrl":"https://www.youtube.com/v/4YFaX1PRu-w?version=3","enclosureMime":"","commentsUrl":null},{"title":"Menachem Fisch - Realism vs. Anti-Realism","url":"https://www.youtube.com/watch?v=hrAnPskkuFQ","date":1744225228,"author":"Closer To Truth","guid":21350,"unread":true,"content":"<article>Make a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nDoes what we discover in science reflect what really exists in the world? Can science access external, independent, ultimate reality? “Realists” say Yes; “anti-realists”, No. Can we discern the ultimate reach of human knowledge? Clearly in science, but also, potentially, in theology. That’s what “critical realism” attempts to do.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nMenachem Fisch is an Israeli philosopher. He is the Joseph and Ceil Mazer Professor Emeritus of History and Philosophy of Science, and co-Director of the Frankfurt-Tel Aviv Center for the Study of Religious and Inter-religious Dynamics at Tel Aviv University.\n\nShop the Closer To Truth merch store for unique items like notebooks, mugs, hoodies, and more: https://bit.ly/3P2ogje\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1297,"flags":null,"enclosureUrl":"https://www.youtube.com/v/hrAnPskkuFQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2302 - Ron White","url":"https://www.youtube.com/watch?v=nNxzn-vRodY","date":1744218050,"author":"PowerfulJRE","guid":21222,"unread":true,"content":"<article>Ron White is a stand-up comic, actor, and author.\n\nhttps://www.tatersalad.com\n\nGet anything delivered on Uber Eats. Visit https://ubereats.com \n\nThis video is sponsored by BetterHelp. Visit https://BetterHelp.com/JRE</article>","contentLength":216,"flags":null,"enclosureUrl":"https://www.youtube.com/v/nNxzn-vRodY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Galen Strawson - What is Consciousness: Data or Information?","url":"https://www.youtube.com/watch?v=uBrcozQzkYE","date":1744210880,"author":"Closer To Truth","guid":21155,"unread":true,"content":"<article>Closer To Truth is now on BlueSky! Follow us for updates, new videos, musings, and more: https://bsky.app/profile/closertotruth.bsky.social\n\nTo study consciousness comprehensively and rigorously, what kinds of data or information are relevant? Data/information for Materialism theories, which are subject to the scientific method, can be well defined. But what about non-Materialism theories?\n\nMake a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nGalen John Strawson is a British analytic philosopher and literary critic who works primarily on philosophy of mind, metaphysics, John Locke, David Hume, Immanuel Kant, and Friedrich Nietzsche.\n\nCloser To Truth, hosted by Robert Lawrence Kuhn, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1020,"flags":null,"enclosureUrl":"https://www.youtube.com/v/uBrcozQzkYE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Dave Smith: Israel, Hamas, Ukraine, Russia, Conspiracies & Antisemitism | Lex Fridman Podcast #464","url":"https://www.youtube.com/watch?v=1V0bJfqEaa4","date":1744150551,"author":"Lex Fridman","guid":20935,"unread":true,"content":"<article>Dave Smith is a comedian, libertarian, political commentator, and the host of Part of the Problem podcast.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep464-sb\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\n\n*Transcript:*\nhttps://lexfridman.com/dave-smith-transcript\n\n*CONTACT LEX:*\n*Feedback* - give feedback to Lex: https://lexfridman.com/survey\n*AMA* - submit questions, videos or call-in: https://lexfridman.com/ama\n*Hiring* - join our team: https://lexfridman.com/hiring\n*Other* - other ways to get in touch: https://lexfridman.com/contact\n\n*EPISODE LINKS:*\nDave's X: https://x.com/ComicDaveSmith\nDave's YouTube: https://youtube.com/DSmithcomic\nDave's Instagram: https://instagram.com/theproblemdavesmith\nDave's Website: https://comicdavesmith.com/\nPart of the Problem Podcast: https://partoftheproblem.com/\n\n*SPONSORS:*\nTo support this podcast, check out our sponsors &amp; get discounts:\n*Call of Duty:* First-person shooter video game.\nGo to https://lexfridman.com/s/call_of_duty-ep464-sb\n*Tax Network USA:* Full-service tax firm.\nGo to https://lexfridman.com/s/tax_network_usa-ep464-sb\n*Notion:* Note-taking and team collaboration.\nGo to https://lexfridman.com/s/notion-ep464-sb\n*Shopify:* Sell stuff online.\nGo to https://lexfridman.com/s/shopify-ep464-sb\n*BetterHelp:* Online therapy and counseling.\nGo to https://lexfridman.com/s/betterhelp-ep464-sb\n\n*OUTLINE:*\n0:00 - Episode highlight\n1:26 - Introduction\n1:45 - Libertarianism\n3:00 - Ron Paul\n6:13 - Military–industrial complex\n13:06 - War on Terror\n25:25 - China and Taiwan\n33:13 - Just war theory\n40:22 - Israel and Gaza\n57:49 - Douglas Murray\n1:05:42 - Hamas\n1:22:01 - Hitler and Stalin\n1:24:15 - Darryl Cooper\n1:33:27 - Antisemitism\n1:47:00 - World leaders\n1:59:34 - Jeffrey Epstein\n2:07:37 - Sam Harris\n2:20:21 - Ukraine and Russia\n2:39:46 - Joe Rogan\n2:52:15 - Conspiracy theories\n3:10:06 - Hope\n\n*PODCAST LINKS:*\n- Podcast Website: https://lexfridman.com/podcast\n- Apple Podcasts: https://apple.co/2lwqZIr\n- Spotify: https://spoti.fi/2nEwCF8\n- RSS: https://lexfridman.com/feed/podcast/\n- Podcast Playlist: https://www.youtube.com/playlist?list=PLrAXtmErZgOdP_8GztsuKi9nrraNbKKp4\n- Clips Channel: https://www.youtube.com/lexclips\n\n*SOCIAL LINKS:*\n- X: https://x.com/lexfridman\n- Instagram: https://instagram.com/lexfridman\n- TikTok: https://tiktok.com/@lexfridman\n- LinkedIn: https://linkedin.com/in/lexfridman\n- Facebook: https://facebook.com/lexfridman\n- Patreon: https://patreon.com/lexfridman\n- Telegram: https://t.me/lexfridman\n- Reddit: https://reddit.com/r/lexfridman</article>","contentLength":2631,"flags":null,"enclosureUrl":"https://www.youtube.com/v/1V0bJfqEaa4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Bede Rundle - Is God Necessary?","url":"https://www.youtube.com/watch?v=FLTZpqqLjdA","date":1744124431,"author":"Closer To Truth","guid":20528,"unread":true,"content":"<article>Get member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nWhether God exists may depend on whether God is necessary. ‘Necessary’, in the philosophical sense, means ‘impossible not to exist’. Even if God exists, would it have been possible for God not to exist? Namely, even if God does exist, could it have been otherwise? If it were possible that God not exist, then why would God, as God is defined, exist at all?\n\nCloser To Truth is now on BlueSky! Follow us for updates, new videos, musings, and more: https://bsky.app/profile/closertotruth.bsky.social\n\nBede Rundle is an Emeritus Fellow in Philosophy at Trinity College, Oxford. Educated in New Zealand at the Victoria University of Wellington and at Oxford, he has been a Junior Research Fellow at the Queen's College, Oxford, and has held visiting appointments in North America.\n\nMake a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1338,"flags":null,"enclosureUrl":"https://www.youtube.com/v/FLTZpqqLjdA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Joe Rogan Experience #2301 - Ben Lamm","url":"https://www.youtube.com/watch?v=NRVEkc9lxH0","date":1744045402,"author":"PowerfulJRE","guid":20107,"unread":true,"content":"<article>Ben Lamm is a serial entrepreneur and the founder and CEO of Colossal Biosciences, a company dedicated to genetic engineering and de-extinction projects. Colossal’s mission includes bringing back extinct species like the woolly mammoth and advancing conservation efforts through cutting-edge biotechnology.\n\nhttps://www.colossal.com</article>","contentLength":334,"flags":null,"enclosureUrl":"https://www.youtube.com/v/NRVEkc9lxH0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Bernardo Kastrup - Panpsychism: Arguing Pro and Con","url":"https://www.youtube.com/watch?v=zcqKRJvM0Ng","date":1744038079,"author":"Closer To Truth","guid":20042,"unread":true,"content":"<article>Register for member exclusives like early access to new content with a free Closer To Truth account: https://closertotruth.com/\n\nPanpsychism is the theory that consciousness is irreducible and exists fundamentally at the foundations of reality. Panpsychism forms include ‘micropsychism,’ where fundamental particles or fields are in some sense conscious, and ‘Cosmopsychism,’ where the entire universe is in some sense conscious. What are the arguments for and against Panpsychism like the ‘combination problem’?\n\nCloser To Truth is now on BlueSky! Follow us for updates, new videos, musings, and more: https://bsky.app/profile/closertotruth.bsky.social\n\nBernardo Kastrup is a Brazilian-born Dutch philosopher and computer scientist best known for his work in the field of consciousness studies, particularly his development of analytic idealism, a form of metaphysical idealism grounded in the analytic philosophical tradition.\n\nMake a tax-deductible donation of any amount to help us continue exploring the world's deepest questions: https://closertotruth.com/donate/\n\nCloser To Truth, hosted by Robert Lawrence Kuhn, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1373,"flags":null,"enclosureUrl":"https://www.youtube.com/v/zcqKRJvM0Ng?version=3","enclosureMime":"","commentsUrl":null},{"title":"Marilyn Schlitz - Do Angels and Demons Exist?","url":"https://www.youtube.com/watch?v=qVBjzEkJt2Q","date":1743951668,"author":"Closer To Truth","guid":19715,"unread":true,"content":"<article>Shop the Closer To Truth merch store for unique items like notebooks, mugs, hoodies, and more: https://bit.ly/3P2ogje\n\nMany theologians take angels and demons seriously. Why? Certainly, most human beings believe in angels and demons. Anecdotal cases are legion. Certainly, such nonphysical beings, in one form or another, populate most of the world’s religions. But angels and demons seem out of place, anachronistic, in our modern world. Is there anything here we should take seriously?\n\nMake a tax-deductible donation of any amount to help support Closer To Truth continue making content like this: https://shorturl.at/OnyRq\n\nMarilyn Mandala Schlitz, PhD, is a clinical research scientist, medical anthropologist, writer, speaker, thought leader, and change consultant. Her work over the past three decades explores the interface of consciousness, science, and healing.\n\nSubscribe to the Closer To Truth podcast on Apple, Spotify, or wherever you listen: https://shorturl.at/mtJP4\n\nCloser To Truth, hosted by Robert Lawrence Kuhn and directed by Peter Getzels, presents the world’s greatest thinkers exploring humanity’s deepest questions. Discover fundamental issues of existence. Engage new and diverse ways of thinking. Appreciate intense debates. Share your own opinions. Seek your own answers.</article>","contentLength":1306,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qVBjzEkJt2Q?version=3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}