{"id":"GTFjXafAY7J6H6YzUvpAZyKKu6","title":"Threat Intelligence","displayTitle":"Threat Intelligence","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":11,"items":[{"title":"Webshells Hiding in .well-known Places, (Thu, Sep 25th)","url":"https://isc.sans.edu/diary/rss/32320","date":1758810289,"author":"","guid":87564,"unread":true,"content":"<article>Ever so often, I see requests for files in .well-known recorded by our honeypots. As an example:</article>","contentLength":96,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ISC Stormcast For Thursday, September 25th, 2025 https://isc.sans.edu/podcastdetail/9628, (Thu, Sep 25th)","url":"https://isc.sans.edu/diary/rss/32318","date":1758771613,"author":"","guid":87355,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Beyond the Hype: What 520+ Security Leaders Revealed About AI in Threat Intelligence","url":"https://www.recordedfuture.com/blog/beyond-the-hype-520-security-leaders-revealed-ai-threat-intelligence","date":1758758400,"author":"","guid":87508,"unread":true,"content":"<p>At Recorded Future we’ve been closely examining the use of AI in the threat intelligence lifecycle – specifically where, how, and why AI is helping threat intelligence teams improve operationalization. In our discussions with cyber threat intelligence leaders over the past year, we heard that many are rapidly expanding their use of AI in an effort to respond to threats more efficiently. But how are they using generative AI, and is it helping them operationalize processes in a more dynamic and efficient way?</p><p>To cut through the hype and understand what's actually working, we surveyed over 520 security leaders. Our findings reveal concrete insights about where AI is making the biggest impact, how organizations are successfully implementing these technologies, and why some approaches are delivering better results than others.</p><p>Now you can hear what our Co-founder and CTO Staffan Truvé has to say about these survey findings in a fireside chat with Dave Gruber, Principal Analyst from Enterprise Strategy Group. <a href=\"https://www.brighttalk.com/webcast/20971/651340?utm_campaign=communication_recording_p%5B%E2%80%A6%5Dayer-preauth=fr3jcz0DPUFZ4KUjShkyNaT7hULcY4ZL6TTF2GznyAM%3D\">Watch the full recording here</a> for insight into these three key topics:</p><ol><li>Trust in AI and automation</li><li>Common use cases for AI in the threat intelligence process</li><li>Additional benefits gained from implementing AI</li></ol><h2>AI trust in the threat intelligence process</h2><p>This discussion highlights feedback from the survey we conducted with <a href=\"https://userevidence.com/research-content/\">UserEvidence</a> on <a href=\"https://pages.recordedfutureext.com/State-of-AI-2025.html\">the state of AI and automation in threat intelligence,</a> which shows how organizations are using AI and automation in their threat intelligence process, how they plan to use it moving forward, and how much trust they have in it. For example, we found:</p><ul><li>86% of respondents trust AI-generated output.</li><li>67% of respondents believe AI will reduce analyst workloads by a quarter or more.</li><li>93% of respondents see that AI and automation are an important part of their threat intelligence strategy.</li></ul><h2>Common use cases for AI and threat intelligence</h2><p>The most common use cases around threat intelligence process automation today include report summarization, threat scoring, and recommended actions. The study shows that AI and automation are actively being used by 75% of the survey respondents, and 85% of implementations are meeting or exceeding their expectations. <a href=\"https://pages.recordedfutureext.com/State-of-AI-2025.html\">Read the report for a full breakdown of survey responses</a>.</p><h2>How AI benefits the security operations function</h2><p>The most common benefits from using AI in threat intelligence programs include improved efficiency, faster time to detect emerging threats, and the ability to prioritize relevant threats. In <a href=\"https://f.io/pttm0sVy\">this fireside chat</a>, the speakers discuss how AI opens up the ability to automate processes with increased flexibility, making it more dynamic and efficient.</p><p>How AI offers more than just operational efficiencies for threat intelligence teamsAI can deliver operational efficiencies, but it can benefit security professionals in other ways as well. When used to its fullest potential, it can empower teams to be more proactive.</p><p>Staffan Truvé states, “With extra time in the workday, teams can be more strategic with their tasks, rather than downsizing headcount resources for the software development process. Allowing more time for strategies like early, predictive threat detection will greatly transform the way practitioners defend attacks.”</p><h2>Accelerating adoption of AI threat intelligence</h2><p>With attack speed increasing, threat intelligence systems need to be faster and more efficient to quickly identify threats. This is where AI comes in. Not only does it give people an opportunity to be more strategic by freeing up time to focus on the risk landscape, it can also enable them to focus on the early, predictive stages of threats and the necessary security operations so they can be proactive rather than reactive.</p><p><a href=\"https://www.recordedfuture.com/platform/recorded-future-ai\">Learn more</a> about Recorded Future AI and how organizations and governments across the globe are turning data overload into strategic advantage.</p>","contentLength":3855,"flags":null,"enclosureUrl":"https://www.recordedfuture.com/blog/media_158baa369f216152720004773cb81bd2ec456617d.png?width=1200&format=pjpg&optimize=medium","enclosureMime":"","commentsUrl":null},{"title":"Bookworm to Stately Taurus Using the Unit 42 Attribution Framework","url":"https://unit42.paloaltonetworks.com/bookworm-to-stately-taurus/","date":1758747642,"author":"Kyle Wilhoit","guid":87233,"unread":true,"content":"<p>We connect Bookworm malware to Chinese APT Stately Taurus using our attribution framework, enhancing our understanding of threat group tradecraft.</p>","contentLength":146,"flags":null,"enclosureUrl":"https://unit42.paloaltonetworks.com/wp-content/uploads/2025/09/Stately-Taurus-Centre.jpg","enclosureMime":"","commentsUrl":null},{"title":"Exploit Attempts Against Older Hikvision Camera Vulnerability, (Wed, Sep 24th)","url":"https://isc.sans.edu/diary/rss/32316","date":1758726696,"author":"","guid":87076,"unread":true,"content":"<article>I notice a new URL showing up in our web honeypot logs, which looked a bit interesting:</article>","contentLength":87,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ISC Stormcast For Wednesday, September 24th, 2025 https://isc.sans.edu/podcastdetail/9626, (Wed, Sep 24th)","url":"https://isc.sans.edu/diary/rss/32314","date":1758683714,"author":"","guid":86824,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"RedNovember Targets Government, Defense, and Technology Organizations","url":"https://www.recordedfuture.com/research/rednovember-targets-government-defense-and-technology-organizations","date":1758672000,"author":"","guid":87006,"unread":true,"content":"<p><em>Note: The analysis cut-off date for this report was July 25, 2025</em></p><p>In July 2024, Insikt Group publicly <a href=\"https://go.recordedfuture.com/hubfs/reports/cta-2024-0716.pdf\">reported</a> on TAG-100, a threat activity group conducting suspected cyber-espionage activity targeting high-profile government, intergovernmental, and private sector organizations globally using the open-source, multi-platform Go backdoor Pantegana. At the time, we did not attribute this activity to a particular country; however, after reviewing all available evidence, we assess that TAG-100 is highly likely a Chinese state-sponsored threat activity group. Accordingly, Insikt Group now tracks this group under the designation RedNovember.</p><p>Between June 2024 and July 2025, RedNovember (which overlaps with Storm-2077) targeted perimeter appliances of high-profile organizations globally and used the Go-based backdoor Pantegana and Cobalt Strike as part of its intrusions. The group has expanded its targeting remit across government and private sector organizations, including defense and aerospace organizations, space organizations, and law firms.</p><p>Using Recorded Future Network Intelligence, Insikt Group identified new likely victims, which include a ministry of foreign affairs in central Asia, a state security organization in Africa, a European government directorate, and a Southeast Asian government. RedNovember also likely compromised at least two United States (US) defense contractors, a European engine manufacturer, and a trade-focused intergovernmental cooperation body in Southeast Asia.</p><p>We observed RedNovember reconnoitering and likely compromising edge devices for initial access, including SonicWall, Cisco Adaptive Security Appliance (ASA), F5 BIG-IP, Palo Alto Networks GlobalProtect, Sophos SSL VPN, and Fortinet FortiGate instances, as well as Outlook Web Access (OWA) instances and Ivanti Connect Secure (ICS) VPN appliances.</p><p>RedNovember’s activity exemplifies the ability to combine weaponized proof-of-concept (PoC) exploits with open-source post-exploitation frameworks such as Pantegana, lowering the entry barrier for less-capable threat actors. It also allows higher-tier groups to refrain from using customized tools during operations in which they are less concerned with being detected or in which heightened attribution obfuscation is desirable.</p><p>Insikt Group followed responsible disclosure procedures in advance of this publication per Recorded Future's notification policy.</p><ul><li>RedNovember continues to rely on command-and-control (C2) frameworks (Pantegana and Cobalt Strike) and open-source backdoors (SparkRAT) for its operations.</li><li>The threat group has significantly broadened its targeting, including by conducting spearphishing and vulnerability exploitation attempts against entities in the US Defense Industrial Base (DIB) and space organizations in Europe.</li><li>At least some of the RedNovember activity that Insikt Group observed, including in Taiwan and Panama, took place in close proximity to geopolitical and military events of key strategic interest to China.</li><li>RedNovember has also increasingly focused its initial access efforts on targeting edge devices, including security solutions such as VPNs, firewalls, load balancers, virtualization infrastructure, and email servers.</li><li>In April 2025, the threat group conducted a campaign focused on the reconnaissance and targeting of Ivanti Connect Secure (ICS) VPN devices across multiple countries. Specific targets included a major US newspaper and a specialized US engineering and military contractor.</li></ul><p>RedNovember (previously tracked as TAG-100 and overlapping with Storm-2077) is a Chinese state-sponsored cyber-espionage group that leverages open-source tools and exploits internet-facing devices to target government, intergovernmental, and private sector organizations globally. Insikt Group has previously publicly <a href=\"https://go.recordedfuture.com/hubfs/reports/cta-2024-0716.pdf\">reported</a> on RedNovember’s use of the multi-platform Go-based backdoor Pantegana and other offensive security tools, including Cobalt Strike and SparkRAT, coupled with exploitation of perimeter appliances, to conduct reconnaissance, initial access, and probable compromise activities.</p><p>RedNovember’s strategic use of open-source capabilities allows the threat group to lower operational costs and obfuscate attribution, a tactic that aligns with broader state-sponsored cyber-espionage trends that Insikt Group has observed. Combining weaponized proof-of-concept (PoC) exploits and open-source tools enables RedNovember to operate at scale. RedNovember’s activity highlights the persistent vulnerabilities of perimeter devices, which remain a significant risk vector due to limited visibility and logging capabilities.</p><p>RedNovember is one of multiple <a href=\"https://go.recordedfuture.com/hubfs/reports/cta-2023-1107.pdf\">other</a> Chinese state-sponsored threat groups that are increasingly achieving initial access to targets by targeting vulnerabilities in internet-facing devices, including security products. Targeting internet-facing devices has proven to be an effective way for Chinese state-sponsored threat groups to scale initial access and achieve initial footholds in large numbers of organizations ahead of more targeted follow-on activity.</p><p>Since our initial <a href=\"https://go.recordedfuture.com/hubfs/reports/cta-2024-0716.pdf\">public report</a> on its activity, RedNovember has continued to use the Pantegana C2 framework and Cobalt Strike as part of its intrusion activity. From our visibility and collection, RedNovember also highly likely continues to use ExpressVPN to administer its servers and may, with realistic probability, have started using other VPNs such as Warp VPN to remotely connect to its infrastructure.</p><p>While monitoring RedNovember’s active C2 servers, Insikt Group observed a number of victims on a global scale across the public and private sectors, but concentrated in the following verticals: aerospace and defense, government, and professional services.</p><p>In addition to suspected compromise activity by RedNovember, we observed other network communications between multiple organizations and C2 servers associated with RedNovember, likely reflecting, at a minimum, general browsing activity and potentially reconnaissance efforts by the threat group. While the activity could be indicative of an intent to compromise, in these cases, there is currently insufficient evidence to reach such a conclusion.</p><p>The terms “compromise,” “targeting,” “reconnaissance,” and “browsing\" are used specifically throughout this report to clarify the kind of activity observed. For example, where we assess that RedNovember compromised an entity, we will use terms such as “compromise” and “victim.”</p>","contentLength":6495,"flags":null,"enclosureUrl":"https://www.recordedfuture.com/research/media_183e8402337d74d98b3efcd12faa97983eae2de95.gif?width=1200&format=pjpg&optimize=medium","enclosureMime":"","commentsUrl":null},{"title":"Uncover Your Vendor’s Hidden Infrastructure Before it Becomes a Problem","url":"https://www.recordedfuture.com/blog/uncover-vendors-hidden-infrastructure-before-becomes-problem","date":1758672000,"author":"","guid":87102,"unread":true,"content":"<p>Third-party vendors may pass initial security assessments with clean questionnaires, solid certifications, and headquarters in a trusted country.</p><p>But what about the unseen risks?</p><p>The IP address that was actively validated to be a Command and Control (C&amp;C) Server.</p><p>The subsidiary of the vendor operating in a country with data privacy or corruption concerns.</p><p>The vendor’s facility, located in a sanctioned country.</p><p>Third-party risks often stem from cyber or physical incidents. Yet, security professionals consistently struggle to get an accurate and complete picture of all domains, subsidiaries, and physical locations for the third-party vendors they work with.</p><p>Today’s vendors aren’t single entities. They’re often complex networks of subsidiaries, acquisitions, and partnerships spread across continents. That niche technology vendor you just purchased might operate through:</p><ul><li>8 subsidiaries across 4 countries</li><li>Cloud infrastructure in jurisdictions with weak data protection laws</li><li>Legacy systems acquired through M&amp;A – systems that may never have received critical security updates</li></ul><p>At Recorded Future we’ve worked with many threat intelligence and third-party risk management teams seeking more visibility into their suppliers’ technical and subsidiary relationships.</p><p>In a recent customer survey we heard from a Director of Information Security at a financial institution that “<em>It’s often difficult to get a full picture of all domains, subsidiaries, or global operations – particularly when responding to zero-day threats or geographic disruptions</em>.”</p><h2>Introducing the Third-Party Intelligence Asset Map</h2><h2>Improving initial vendor assessments</h2><p>Traditional vendor assessments can over rely on self-reported information that can miss critical infrastructure details. The Asset Map improves initial due diligence processes by providing additional details regarding a vendor’s ecosystem before contracts are signed.</p><p>Security teams can better identify risky subsidiaries operating in high-threat jurisdictions, view any current or historical technical risks, and spot potential concentration risks in digital infrastructure. This visibility can enable teams to negotiate better contract terms, implement targeted security requirements, and make informed go/no-go decisions based on evidence of their risk exposure.</p><h2>Proactively responding to new incidents</h2><p>When threats emerge or geographic disruptions occur, security teams need immediate visibility into which vendors might be affected. The Asset Map enables quick impact assessments by showing critical cyber risks and where vendor infrastructure may be located.</p><p>Teams can quickly identify which vendors have facilities in conflict zones, use vulnerable software versions, or have IP addresses communicating with C&amp;C infrastructure. This intelligence allows security teams to proactively reach out to at-risk vendors, implement additional monitoring, and adjust risk postures before incidents escalate into business disruptions.</p><p>The Asset Map provides users with three different viewing modes to toggle between:</p><p> – provides an asset hierarchy showing asset ownership and allows the user to investigate DNS, TLS, and WHOIS data associated with domains alongside their Recorded Future Risk Score.</p><p>This helps to answer questions such as what domains and IPs are associated with this company and what are the parent-subsidiary relationship hierarchies?</p><p> – enables exploration and analysis of triggered Risk Rules and the digital assets triggering those rules, such as an IP address being validated as a C&amp;C server or recently reported as a host of an active phishing URL.</p><p>This helps users answer questions like how do these subsidiaries and digital assets contribute to Recorded Future’s risk score for this company? Or, are there IP addresses I should proactively block?</p><p> – presents facility locations along with relevant country risks, such as data and surveillance risk or physical security and travel risk. The map also provides information on where digital assets are hosted.</p><p>This view can be used to better understand the geopolitical and socioeconomic risks associated with where the company operates.</p><h2>Enhanced vendor visibility</h2><p>Questionnaires and certifications show what vendors choose to disclose. The Third-Party Intelligence Asset Map can show you what actually exists.</p><p>Map vendor hierarchies, identify high-risk assets, and assess facility locations with country-specific risk context.</p><p>Make more confident vendor decisions before contracts are signed and speed up incident response when breaches occur. Learn more about <a href=\"https://www.recordedfuture.com/products/third-party-intelligence\">Third-Party Intelligence</a>, and <a href=\"https://www.recordedfuture.com/get-started#book-demo\">request a demo</a> to uncover how to make fast, effective, data-driven decisions on third-party risks.</p><p><em>in New York City from October 7th - 9th, and at</em><em>from October 21st - 22nd to learn more about the future of third-party risk management.</em></p>","contentLength":4837,"flags":null,"enclosureUrl":"https://www.recordedfuture.com/blog/media_1bf3de56e2078bcafcd9487232b30a9f358e624d0.png?width=1200&format=pjpg&optimize=medium","enclosureMime":"","commentsUrl":null},{"title":"&#x5b;Guest Diary&#x5d; Distracting the Analyst for Fun and Profit, (Tue, Sep 23rd)","url":"https://isc.sans.edu/diary/rss/32308","date":1758632118,"author":"","guid":86577,"unread":true,"content":"<article>[This is a Guest Diary by Taylor House, an ISC intern as part of the SANS.edu Bachelor's Degree in Applied Cybersecurity (BACS) program [1].]</article>","contentLength":141,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ISC Stormcast For Tuesday, September 23rd, 2025 https://isc.sans.edu/podcastdetail/9624, (Tue, Sep 23rd)","url":"https://isc.sans.edu/diary/rss/32306","date":1758599413,"author":"","guid":86403,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Operation Rewrite: Chinese-Speaking Threat Actors Deploy BadIIS in a Wide Scale SEO Poisoning Campaign","url":"https://unit42.paloaltonetworks.com/operation-rewrite-seo-poisoning-campaign/","date":1758582011,"author":"Yoav Zemah","guid":86356,"unread":true,"content":"<p>SEO poisoning campaign \"Operation Rewrite” uses a malicious IIS module called BadIIS to redirect users to unwanted websites.</p>","contentLength":126,"flags":null,"enclosureUrl":"https://unit42.paloaltonetworks.com/wp-content/uploads/2025/09/06_Nation-State-cyberattacks_1920x900.jpg","enclosureMime":"","commentsUrl":null}],"tags":["threatintel"]}