{"id":"i2nisf4o","title":"Reddit","displayTitle":"Reddit","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":35,"items":[{"title":"Brick Lane, London","url":"https://www.reddit.com/r/europe/comments/1jcszfz/brick_lane_london/","date":1742151954,"author":"/u/novitasdigital","guid":768,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"French politician says US should give back Statue of Liberty","url":"https://www.lemonde.fr/en/politics/article/2025/03/16/french-mep-says-us-should-give-back-statue-of-liberty_6739217_5.html","date":1742149181,"author":"/u/pierrepaul","guid":736,"unread":true,"content":"<p>France should take back the Statue of Liberty because the US no longer represents the values that led France to offer the statue, a French member of the European Parliament said Sunday, March 16. \"Give us back the Statue of Liberty,\" centre-left politician Raphaël Glucksmann said at a convention of his Place Publique center-left movement.</p><p>\"We're going to say to the Americans who have chosen to side with the tyrants, to the Americans who fired researchers for demanding scientific freedom: 'Give us back the Statue of Liberty,'\" he told cheering supporters. \"We gave it to you as a gift, but apparently you despise it. So it will be just fine here at home,\" he added.</p><p>The Statue of Liberty was unveiled in New York City's harbour on October 28, 1886, for the centennial of the American Declaration of Independence as a gift from the French people to America. It was designed by Frenchman Auguste Bartholdi. Paris does have a far smaller copy of the statue on a small island on the Seine in Paris.</p><p>Glucksmann, a staunch defender of Ukraine, has strongly criticized President Donald Trump's radical change of US policy on the war. He also took aim at Trump's cuts to US research institutions, which have already prompted a French government initiative to attract some of them to work in France.</p><p>\"The second thing we're going to say to the Americans is: 'If you want to fire your best researchers, if you want to fire all the people who, through their freedom and their sense of innovation, their taste for doubt and research, have made your country the world's leading power, then we're going to welcome them,'\" continued Glucksmann.</p><p>Since Trump returned to the White House in January, his government has cut federal research funding and sought to dismiss hundreds of federal workers working on health and climate research.</p><p>Glucksmann also criticized far-right leaders in France, accusing them of being a \"fan club\" for Trump and billionaire Elon Musk, who is spearheading the president's efforts to cut spending.</p>","contentLength":2009,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jcrvwd/french_politician_says_us_should_give_back_statue/"},{"title":"London","url":"https://www.reddit.com/r/europe/comments/1jco47i/london/","date":1742139338,"author":"/u/wrapityup","guid":731,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Capital is flowing from the U.S. to Europe","url":"https://www.reddit.com/r/europe/comments/1jcnpwl/capital_is_flowing_from_the_us_to_europe/","date":1742138268,"author":"/u/PjeterPannos","guid":739,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unity protects us","url":"https://www.reddit.com/r/europe/comments/1jcn126/unity_protects_us/","date":1742136346,"author":"/u/PjeterPannos","guid":721,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Macron to EU colleagues: Stop buying American, buy European","url":"https://www.politico.eu/article/macron-to-eu-colleagues-stop-buying-american-buy-european/","date":1742132480,"author":"/u/Deedogg11","guid":741,"unread":true,"content":"<div><p>The two also agreed “to continue working towards restoring communication between the United States and Russia,” Washington says.</p></div>","contentLength":132,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jcloq7/macron_to_eu_colleagues_stop_buying_american_buy/"},{"title":"Macron to EU colleagues: Stop buying American, buy European","url":"https://www.politico.eu/article/macron-to-eu-colleagues-stop-buying-american-buy-european/","date":1742132263,"author":"/u/Deedogg11","guid":570,"unread":true,"content":"<div><p>The two also agreed “to continue working towards restoring communication between the United States and Russia,” Washington says.</p></div>","contentLength":132,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jclm8c/macron_to_eu_colleagues_stop_buying_american_buy/"},{"title":"50% of Moscow’s fuel supply at risk after Ukrainian drone strike on its largest oil refinery","url":"https://euromaidanpress.com/2025/03/16/frontline-report-50-of-moscows-fuel-supply-at-risk-after-ukrainian-drone-strike-on-its-largest-oil-refinery/","date":1742131916,"author":"/u/eaglemaxie","guid":390,"unread":true,"content":"<p data-start=\"51\" data-end=\"127\">Today, there are a lot of interesting updates from the Russian Federation.</p><p data-start=\"129\" data-end=\"470\">Ukrainian drones penetrated deep into Russian territory, and explosions lit up the skies over Moscow and several key cities. While strikes on oil refineries and military targets were significant, one attack stood out—the hit on the Druzhba pipeline—creating international ripple effects beyond Russia’s borders as exports suddenly dropped.</p><p data-start=\"472\" data-end=\"900\">As you remember from a previous report, Ukrainians destroyed a significant number of Russian air defenses in Crimea, along the front line, and deep in the rear while also threatening to strike the Kerch Strait Bridge again. This forced Russia to relocate air defense systems to cover newly exposed weak spots. However, this played into Ukraine’s strategy, as the large-scale redeployments left several key targets vulnerable.</p><p data-start=\"902\" data-end=\"1259\">This allowed Ukrainians to deploy hundreds of drones to penetrate Russia’s air defense grid, which was spread thin by the countless destroyed systems and subsequent relocations. As a result, Ukrainian drones reached as far as Moscow, with the first confirmed strike hitting the Oka-Center oil depot in the town of Serpukhov in Moscow Oblast, inflicting significant damage during the day.</p><p data-start=\"1261\" data-end=\"1623\">What followed was Russia’s most restless night yet. Russian reports state that over 337 Ukrainian drones struck Moscow, Kursk, Belgorod, Oryol, Lipetsk, Bryansk, and Ryazan in the largest drone strike to date. Strikes hit oil refineries in the Moscow area, including the city’s largest refinery, which supplies up to 50% of its diesel and gasoline consumption.</p><h3 data-start=\"1080\" data-end=\"1160\"><strong data-start=\"1084\" data-end=\"1158\">Ukraine targets Russian oil: Druzhba pipeline and refineries disrupted</strong></h3><p data-start=\"1625\" data-end=\"1925\">Explosions near the Ryazan military airfield put all Russian airports on high alert, undermining the Russian Air Force’s rapid response capabilities. Additionally, a control station for the Druzhba pipeline in Oryol was hit, halting Russian oil exports to Central Europe, particularly Hungary.</p><p data-start=\"1927\" data-end=\"2398\">The Druzhba pipeline—one of the world’s largest, with a capacity of 2 million barrels per day—is a critical conduit for Russian oil exports to Central European refineries. Hungary imports most of its crude oil and gas via the Druzhba pipeline, with over 40% of Hungarian gas being Russian, making the strike on the control station particularly devastating for them. As a result, the Hungarian Foreign Minister, Péter Szijjártó, called it an attack on their sovereignty.</p><p data-start=\"2400\" data-end=\"2807\">When the oil and gas supply stopped, the halt of operations of the Druzhba pipeline meant that Hungary would have to import much more expensive oil and gas from allies like the USA and Norway. The cancellation of Russian oil and gas exports to Hungary could jeopardize Russia’s hold on the Hungarian energy sector, as the country would have to increase its overall reliance on Europe for its energy needs.</p><p data-start=\"2809\" data-end=\"3456\">Besides gas, the second-largest Hungarian energy source is nuclear power from its only nuclear power plant in Paks. This nuclear power plant depends on Russia’s nuclear fuel, uranium rods, and Russian engineers and expertise, consolidating Russia’s monopoly on the Hungarian energy sector. Through this, Russia maintains strict control over Hungary, as only Russian specialists and companies can currently maintain the reactors and supply critical equipment and fuel for their maintenance. Since nuclear power generates over a third of the country’s electricity, Hungary remains reliant on Russia to sustain its energy infrastructure.</p><p data-start=\"3458\" data-end=\"3686\">The Hungarian Foreign Minister stated that he had discussed the situation with the Deputy Russian Energy Minister, who assured him that pipeline control station repairs were underway and supplies would resume soon.</p><h3 data-start=\"2894\" data-end=\"2957\"><strong data-start=\"2898\" data-end=\"2955\">Ukraine’s strategy: escalation or ceasefire leverage?</strong></h3><p data-start=\"3688\" data-end=\"3919\">If Russia does not accept a ceasefire—at least in the air—Ukraine can exert much more pressure on Russia’s energy hold on Hungary by launching follow-up strikes to destroy critical export infrastructure further and delay repairs.</p><p data-start=\"3921\" data-end=\"4420\">Overall, Ukrainian drone strikes on Russian oil refineries and energy infrastructure are escalating. The latest attack hit Moscow’s main refinery, which supplies half the city’s energy needs. Additionally, damage to the Druzhba pipeline control station temporarily halted Russian energy exports to Hungary. Continued strikes could strain Russia’s economy and weaken its geopolitical influence, potentially pushing it toward negotiating a ceasefire—at least in the airspace over Russia and Ukraine.</p><p data-start=\"3921\" data-end=\"4420\"><a href=\"https://youtu.be/jzX0f8pt-pY?si=IaTnP5im_An4UTGh\" target=\"_blank\" rel=\"noopener\"></a><a href=\"http://savefrom.net/?url=https%3A%2F%2Fyoutu.be%2FjzX0f8pt-pY%3Fsi%3DIaTnP5im_An4UTGh&amp;utm_source=chrome&amp;utm_medium=extensions&amp;utm_campaign=link_modifier\" target=\"_blank\" title=\"Отримай пряме посилання\" rel=\"noopener\"></a><a href=\"http://savefrom.net/?url=https%3A%2F%2Fyoutu.be%2FjzX0f8pt-pY%3Fsi%3DIaTnP5im_An4UTGh&amp;utm_source=chrome&amp;utm_medium=extensions&amp;utm_campaign=link_modifier\" target=\"_blank\" title=\"Отримай пряме посилання\" rel=\"noopener\"></a><em>, we pair up with the military blogger Reporting from Ukraine to keep you informed about what is happening on the battlefield in the Russo-Ukrainian war.</em></p><div><div><strong>You could close this page. Or you could join our community and help us produce more materials like this.&nbsp;</strong>\n\nWe keep our reporting open and accessible to everyone because we believe in the power of free information. This is why our small, cost-effective team depends on the support of readers like you to bring deliver timely news, quality analysis, and on-the-ground reports about Russia's war against Ukraine and Ukraine's struggle to build a democratic society.\n\nA little bit goes a long way: for as little as the cost of one cup of coffee a month, you can help build bridges between Ukraine and the rest of the world, plus become a co-creator and vote for topics we should cover next. <a href=\"https://www.patreon.com/euromaidanpress\" target=\"_blank\"></a>or see other ways to <a href=\"https://www.patreon.com/bePatron?u=36526209\" target=\"_blank\" data-patreon-widget-type=\"become-patron-button\">Become a Patron!</a></div></div>","contentLength":5376,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jcliak/50_of_moscows_fuel_supply_at_risk_after_ukrainian/"},{"title":"Russia has lost 100,000 military personnel in 2025, says Ukraine's commander-in-chief","url":"https://www.pravda.com.ua/eng/news/2025/03/16/7503132/","date":1742131377,"author":"/u/eaglemaxie","guid":751,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jclcbj/russia_has_lost_100000_military_personnel_in_2025/"},{"title":"Guess who claims all the credits","url":"https://www.reddit.com/r/europe/comments/1jckiur/guess_who_claims_all_the_credits/","date":1742128686,"author":"/u/A_Lazko","guid":401,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The solution is a federal Europe! Federalists in Rome","url":"https://www.reddit.com/r/europe/comments/1jck95y/the_solution_is_a_federal_europe_federalists_in/","date":1742127709,"author":"/u/EUstrongerthanUS","guid":740,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"‘We must stop Putin’: Zelensky says Russians launched 1,020 attack drones, 1,360 guided aerial bombs this week","url":"https://www.livemint.com/news/world/russians-launched-over-1-020-attack-drones-1-360-guided-aerial-bombs-zelensky-says-we-must-stop-putin-together/amp-11742121335892.html","date":1742125563,"author":"/u/sweatycat","guid":730,"unread":true,"content":"<p>“Hundreds of attacks on our cities and communities this week: Chernihiv, Kherson, Donetsk, Kharkiv, Dnipro, Odesa, Poltava, Kyiv, Mykolaiv, Zaporizhzhia, and Sumy regions. The Russians launched over 1,020 attack drones, nearly 1,360 guided aerial bombs, and more than 10 missiles of various types,” said Zelensky in a post on X.</p>","contentLength":332,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jcjolh/we_must_stop_putin_zelensky_says_russians/"},{"title":"Not for Russia to decide on peacekeepers in Ukraine, Macron says","url":"https://www.reuters.com/world/europe/not-russia-decide-peacekeepers-ukraine-macron-says-2025-03-16/","date":1742122992,"author":"/u/sweatycat","guid":385,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jcj23d/not_for_russia_to_decide_on_peacekeepers_in/"},{"title":"Finland turns down US request for eggs | Yle News","url":"https://yle.fi/a/74-20149786","date":1742119536,"author":"/u/redditforcedmesignup","guid":397,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jci953/finland_turns_down_us_request_for_eggs_yle_news/"},{"title":"Hungarian Opposition Rallies in Massive Protest Against Orbán’s Rule","url":"https://www.kyivpost.com/post/48992","date":1742119318,"author":"/u/Yveliad","guid":387,"unread":true,"content":"<p>Massive crowds rallied in Budapest on Saturday as Hungarian opposition activists came out in force to call for an end to Prime Minister Viktor Orbán’s 15-year rule.</p><p>Around 50,000 protesters descended on the capital on Hungary’s national day to support Peter Magyar, a former government insider turned leader of the anti-Orbán camp.</p><p>Magyar told his supporters the “time has come” for his Tisza party, which is leading the prime minister’s Fidesz party in most opinion polls ahead of elections in 2026, Reuters reported.</p><p>Speaking to TVP World during the demonstration, Tisza’s deputy chair Zoltán Tarr said that his movement faced significant operational challenges under the current government, which has been accused of undermining press freedom and curbing democracy.</p><p>“The biggest challenge is that Orbán’s government is doing everything in its power to somehow control and limit our activities,” Tarr claimed.</p><p>“They also go after people who openly say that they want change and say that they would like to belong to the Tisza movement. That is one of the biggest challenges, because obviously everyone is worried about his or her own existence, and this government is very particular in going after people one by one, singling them out.”</p><p>He added that state “propaganda” was spreading falsehoods about the opposition.</p><p>“They constantly make up stories which are not true but which are able to lead people in a different direction, [they] mislead them by spreading lies about us,” he said.</p><p>Magyar and his party are set to launch a popular survey on 12 key economic and political issues to give citizens a voice in the movement’s political platform in the run-up to next year’s vote.</p><p>The 43-year-old MEP has also vowed to make Hungary part of a strong Europe, in contrast to Orbán’s Euroscepticism, which has seen him regularly clashing with politicians in Brussels and other European capitals.</p><p>Speaking at a separate rally on Saturday, the 61-year-old Orbán said it was time to eliminate what he called a “shadow army” of NGOs, journalists, judges and politicians receiving payments from abroad.</p><p>He has already announced plans to crack down on organizations funded by the U.S. Agency for International Development (USAID) – which is now being dismantled by Trump – and Budapest-born billionaire George Soros, a supporter of liberal causes.</p><p>This week Orbán’s Fidesz party submitted constitutional changes that would permit the expulsion of dual citizens deemed to pose a threat to Hungary’s sovereignty.</p><p>While the Tisza movement may be riding high in recent polls, unseating Orbán would be a significant achievement. In the last parliamentary elections in 2022, a united front of anti-Fidesz candidates fell well short of Orbán’s party, which won over half of the popular vote.</p>","contentLength":2822,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jci7c2/hungarian_opposition_rallies_in_massive_protest/"},{"title":"Finland turns down US request for eggs","url":"https://yle.fi/a/74-20149786","date":1742116052,"author":"/u/Beo1217","guid":394,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jchh9z/finland_turns_down_us_request_for_eggs/"},{"title":"A work by Ben Jennings for The i Paper","url":"https://www.reddit.com/r/europe/comments/1jcgv2h/a_work_by_ben_jennings_for_the_i_paper/","date":1742113165,"author":"/u/CorleoneBaloney","guid":720,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Trump limits Kellogg’s role to Ukraine envoy after Russian complaints","url":"https://www.straitstimes.com/world/europe/trump-limits-kelloggs-role-to-ukraine-envoy-after-russian-complaints","date":1742093341,"author":"/u/Silly-avocatoe","guid":767,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jcbxvk/trump_limits_kelloggs_role_to_ukraine_envoy_after/"},{"title":"Macron asserts: 'If Kyiv invites allies onto its soil, Moscow has no say'","url":"https://www.bfmtv.com/international/asie/russie/guerre-en-ukraine-moscou-n-a-pas-son-mot-a-dire-si-kiev-demande-a-des-forces-alliees-d-etre-sur-son-territoire-affirme-macron_AD-202503150383.html","date":1742085729,"author":"/u/Wonderful-Excuse4922","guid":399,"unread":true,"content":"<div>Dans un entretien accordé à plusieurs journeaux régionais français, Emmanuel Macron a par ailleurs affirm qu'il faudra, selon lui, des \"échanges directs\" avec son homologue russe Vladimir Poutine \"et entre négociateurs français et russes pour clarifier cet agenda\" sur les garanties de sécurité à apporter à l'Ukraine.</div><p><a href=\"https://www.bfmtv.com/international/europe/ukraine/guerre-en-ukraine-macron-veut-une-pression-claire-sur-la-russie-qui-ne-donne-pas-l-impression-de-vouloir-la-paix-sincerement_AN-202503150258.html\" title=\"Guerre en Ukraine: Macron veut une &quot;pression claire&quot; sur la Russie qui &quot;ne donne pas l'impression de vouloir la paix sincèrement&quot;\">Emmanuel Macron</a> a affirmé que la Russie n'avait pas à \"accepter ou pas\" l'envoi en Ukraine de \"forces alliées\" si Kiev en fait la \"demande\" pour garantir un éventuel accord de paix, dans un entretien publié samedi 15 mars par plusieurs journaux régionaux français.</p><p>En revanche, \"à partir du moment où on rentrerait dans cette phase de cessez-le-feu\" proposée par Washington et Kiev, il faudra selon lui des \"échanges directs\" avec son homologue russe Vladimir Poutine \"et entre négociateurs français et russes pour clarifier cet agenda\" sur les garanties de sécurité à apporter à l'Ukraine.</p><p>Depuis son retour à la <a href=\"https://www.bfmtv.com/politique/elysee/macron-veut-cooperer-avec-trump-et-appelle-a-ne-pas-etre-faible-face-a-lui_AV-202501060453.html\" title=\"Macron veut &quot;coopérer&quot; avec Trump et appelle à ne pas être &quot;faible&quot; face à lui\">Maison-Blanche</a> en janvier, le président américain <a href=\"https://www.bfmtv.com/international/asie/russie/guerre-en-ukraine-vladimir-poutine-remercie-donald-trump-pour-son-attention-au-conflit_AV-202503130717.html\" title=\"Guerre en Ukraine: Vladimir Poutine remercie Donald Trump pour son &quot;attention&quot; au conflit\">Donald Trump </a>martèle sa volonté de mettre fin au conflit, trois ans après l'invasion russe de l'Ukraine, et a opéré un rapprochement spectaculaire avec le maître du Kremlin. Après une phase de tensions maximales, Américains et Ukrainiens ont renoué le dialogue cette semaine en proposant une trêve d'un mois, que la Russie n'a pas encore acceptée.</p><p>\"C'est un moment de vérité parce que si la Russie ne s'engage pas sincèrement dans la paix\", \"le président Trump va durcir les sanctions et les représailles et donc on changera totalement de dynamique\", a estimé Emmanuel Macron.</p><p>Selon le chef de l'Etat français, \"plusieurs pays européens, et d'ailleurs non européens, ont manifesté leur volonté de se joindre\" à un éventuel envoi de troupes en Ukraine pour garantir un futur accord de paix avec la Russie. Il s'agirait de \"quelques milliers d'hommes\" par Etat, déployés \"dans des points-clés, pour faire des programmes d'entraînement\" et \"montrer notre soutien dans la durée\", a-t-il assuré. Jusqu'ici, Moscou s'oppose fermement à un tel déploiement.</p><blockquote></blockquote><p>\"Les Ukrainiens ne peuvent en aucun cas faire des concessions territoriales et n'avoir aucune garantie de sécurité\", a-t-il prévenu.</p><p>S'agissant du renforcement massif de la défense acté par l'Union européenne la semaine dernière, il a expliqué avoir demandé aux industriels français de l'armement réunis vendredi à l'Elysée de \"démarcher les Etats européens qui ont pris l'habitude d'acheter américain\".</p><p>\"Ceux qui achètent (des missiles) Patriot, il faut leur proposer le SAM-T nouvelle génération franco-italien; ceux qui achètent du F35, il faut leur proposer du Rafale\", a-t-il martelé. Il entend d'ailleurs \"produire plus\" de ces avions de chasse du groupe Dassault Aviation \"plutôt que d'accélérer le programme d'avion du futur\".</p>","contentLength":2846,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jc9kwv/macron_asserts_if_kyiv_invites_allies_onto_its/"},{"title":"A river ‘died' overnight in Zambia after an acidic waste spill at a Chinese-owned mine","url":"https://apnews.com/article/mining-pollution-china-zambia-environment-93ee91d1156471aaf9a7ebd6f51333c1?fbclid=IwY2xjawJC4UNleHRuA2FlbQIxMQABHSYwd6jBPc-9Ud0ih68QPHXuoDjTBNrmdrbkPe0fy6N_USmK-YK8TgyUmw_aem_jM_aBoBLBDU9_TRAxkBalA","date":1742078489,"author":"/u/kalahiki808","guid":393,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc74ni/a_river_died_overnight_in_zambia_after_an_acidic/"},{"title":"The moment LRAD (owned by the Serbian police) was used during 15 minutes of silence - Belgrade, Serbia","url":"https://n1info.rs/vesti/video-trenutak-incidenta-upotrebljen-zvucni-top-oruzje-koje-poseduje-bezbednosni-sistem-srbije/","date":1742076193,"author":"/u/SkyLunat1c","guid":754,"unread":true,"content":"<p><strong data-attribute-id=\"emphasized-text\">Zvuk koji je prekinuo petnaestominutnu tišinu na današnjem studentskom protestu i izazvao paniku među okupljenima je zvučno oružje ili \"zvučni top\" koji poseduje bezbednosni sistem Srbije, rekao je za N1 Aleksandar Radić, vojni analitičar.</strong></p><p>Radić navodi da je u pitanju američko neletalno, agresivno, zvučno oružje koje za cilj ima da onemogući metu, odnosno, da služi za onesposobljavanje.</p><p>„Najveći problem u večerašnjem događaju je – ko je došao na ideju da se takvo oružje upotrebi? U situaciji kada su svi demonstranti bili mirni, kada se odavala petnaestominutna pošta nastradalima oružje je upotrebljeno. Jedini cilj tog čina je brutalan prikaz sile, dokaz arogancije, a motiv mržnja prema sopstvenom narodu“, navodi za portal N1 Radić.</p><p>On kaže da „zvučni top“ od pre nekoliko godina poseduje bezbednosni sistem Srbije.</p><p>Narodni poslanik Zdravko Ponoš, takođe, navodi i da je prema informacijama koje je on dobio u pitanju zvučno oružje.</p><p>„Ta reakcija okupljenih, da imaju osećaj kao da je nešto prošlo pored njih je posledica upotrebe zvuka, a sa ciljem da se uplaše“, rekao je Ponoš.</p><p>On je objasnio i da osim što se njime izazvala panika, ta vrsta oružja može da se koristi na više načina.</p><p>„Upotreba tog oružja može naštetiti i zdravlju, a to što je upotrebljena u vreme dok je odavana pošta nastradalima je potpuni skandal“, naveo je Zdravko Ponoš.</p>","contentLength":1412,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jc6bvi/the_moment_lrad_owned_by_the_serbian_police_was/"},{"title":"'European Defence' by Nicolas Vadot","url":"https://www.reddit.com/r/europe/comments/1jc5q0p/european_defence_by_nicolas_vadot/","date":1742074268,"author":"/u/PjeterPannos","guid":396,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Once Again, Ukrainian Drones Are Blowing Up Russian Drone Factories","url":"https://www.forbes.com/sites/davidaxe/2025/03/15/once-again-ukrainian-drones-are-blowing-up-russian-drone-factories/","date":1742073289,"author":"/u/AndroidOne1","guid":391,"unread":true,"content":"<figure role=\"presentation\"><figcaption><p>A drone strike on a Russian drone factory in  April 2024.</p></figcaption></figure><p>Drones blowing up drone factories is now an established trend in a war increasingly dominated by unmanned aerial vehicles of all shapes and sizes.</p><p>On or just before March 13, long-range attack drones belonging to the Ukrainian defense intelligence agency struck a hidden drone manufacturing facility in Obukhovo, just outside Moscow 300 miles from the border with Ukraine.</p><p>The facility was concealed in a concrete plant. “Local residents were the first to report powerful explosions and a fire at the facility,” the Estonian analyst WarTranslated <a href=\"https://x.com/wartranslated/status/1900131591654977784\" rel=\"nofollow noopener noreferrer\" target=\"_blank\" title=\"https://x.com/wartranslated/status/1900131591654977784\" data-ga-track=\"ExternalLink:https://x.com/wartranslated/status/1900131591654977784\" aria-label=\"observed\">observed</a>.</p><p>It’s not the first time Ukrainian drones have targeted Russian drone factories. In April, Ukraine sortied one of its then-new Aeroprakt A-22 sport plane drones to <a href=\"https://www.forbes.com/sites/davidaxe/2024/04/02/ukraine-packed-a-cessna-style-plane-with-explosives-added-remote-controls-and-kamikazed-it-into-a-russian-drone-factory-600-miles-away/\" target=\"_self\" title=\"https://www.forbes.com/sites/davidaxe/2024/04/02/ukraine-packed-a-cessna-style-plane-with-explosives-added-remote-controls-and-kamikazed-it-into-a-russian-drone-factory-600-miles-away/\" data-ga-track=\"InternalLink:https://www.forbes.com/sites/davidaxe/2024/04/02/ukraine-packed-a-cessna-style-plane-with-explosives-added-remote-controls-and-kamikazed-it-into-a-russian-drone-factory-600-miles-away/\" aria-label=\"strike a drone plant\">strike a drone plant</a> in Yelabuga, 550 miles east of Moscow.</p><p>The 2024 raid remains one of the deepest in Ukraine’s escalating campaign of deep strikes on Russian targets, And it may have been the first in which the Ukrainian drones went after the industry supporting Russia’s own drones.</p><p>It makes sense for the Ukrainians to continue striking Russian drone factories. Ukraine’s edge in drone warfare is perhaps its most important advantage as Russia’s wider war on Ukraine grinds into its 37th month.</p><p>Ukrainian drones are so thick in the sky in many of the most important sectors that any Russian vehicles that leave their dugouts “operate in a one-way manner,” one Russian blogger <a href=\"https://www.forbes.com/sites/davidaxe/2025/03/07/russian-vehicles-operate-in-a-one-way-manner-as-ukrainian-drones-swarm-the-battlefield/\" target=\"_self\" title=\"https://www.forbes.com/sites/davidaxe/2025/03/07/russian-vehicles-operate-in-a-one-way-manner-as-ukrainian-drones-swarm-the-battlefield/\" data-ga-track=\"InternalLink:https://www.forbes.com/sites/davidaxe/2025/03/07/russian-vehicles-operate-in-a-one-way-manner-as-ukrainian-drones-swarm-the-battlefield/\" aria-label=\"complained\">complained</a>.</p><p>Struggling to jam the well-made Ukrainian drones, the Russians are trying to at least match the explosive UAVs vehicle-for-vehicle—if not exceed them on a technological level.</p><p>Elite Russian drone groups were the first in Ukraine to deploy unjammable fiber-optic drones that send and receive signals via miles-long cables instead of via radio datalinks, which are vulnerable to Ukrainian electronic warfare.</p><p>And now the Kremlin is ramping up production of the most numerous first-person-view drones in order to keep pace with Ukrainian production. The Kremlin has announced it will acquire as many as 4 million FPV drones this year; the defense ministry in Kyiv <a href=\"https://www.forbes.com/sites/davidaxe/2025/03/12/45-million-drones-is-a-lot-of-drones-its-ukraines-new-production-target-for-2025/\" target=\"_self\" title=\"https://www.forbes.com/sites/davidaxe/2025/03/12/45-million-drones-is-a-lot-of-drones-its-ukraines-new-production-target-for-2025/\" data-ga-track=\"InternalLink:https://www.forbes.com/sites/davidaxe/2025/03/12/45-million-drones-is-a-lot-of-drones-its-ukraines-new-production-target-for-2025/\" aria-label=\"is hoping to acquire\">is hoping to acquire</a> 4.5 million. The gap is closing.</p><p>In blowing up the drone factories, ironically with drones, the Ukrainian intelligence agency hopes to throttle Russian production—and ensure that most of the tiny UAVs buzzing over the front line ... are Ukrainian.</p>","contentLength":2411,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc5dgm/once_again_ukrainian_drones_are_blowing_up/"},{"title":"Carney orders review of F-35 fighter jet purchase from U.S.’s Lockheed Martin","url":"https://www.ctvnews.ca/politics/article/carney-orders-review-of-f-35-fighter-jet-purchase-from-uss-lockheed-martin/","date":1742069954,"author":"/u/Old_General_6741","guid":750,"unread":true,"content":"<p>Updated:&nbsp;<time datetime=\"2025-03-15T19:38:32.556Z\">March 15, 2025 at 3:38PM EDT</time></p><p>Published:&nbsp;<time datetime=\"2025-03-15T16:56:06.375Z\">March 15, 2025 at 12:56PM EDT</time></p>","contentLength":79,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc45o4/carney_orders_review_of_f35_fighter_jet_purchase/"},{"title":"The numbers","url":"https://www.reddit.com/r/europe/comments/1jc3ivs/the_numbers/","date":1742068275,"author":"/u/JexFr","guid":403,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"France's Macron to host Canada's Carney in Paris on Monday","url":"https://www.reuters.com/world/europe/frances-macron-host-canadas-carney-paris-monday-2025-03-15/","date":1742065591,"author":"/u/Advanced_Drink_8536","guid":388,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc2ixn/frances_macron_to_host_canadas_carney_in_paris_on/"},{"title":"On Trump's order, US launches large-scale attacks on Iran-backed Houthis","url":"https://www.jpost.com/breaking-news/article-846181","date":1742065053,"author":"/u/barsik_","guid":389,"unread":true,"content":"<p>The United States struck <a href=\"https://www.jpost.com/tags/houthi\">Houthi targets</a> in <a href=\"https://www.jpost.com/tags/yemen\">Yemen</a> on Saturday evening in a message to Iran, at a time when the administration is proposing to open negotiations on its nuclear program, a US official told </p><p>The strikes will last \"days, possible weeks\" an official told Reuters.</p><p>The Houthi-run health ministry reported that the US strikes have killed over 23 people and wounded more than 20 others in Yemen on Saturday.</p><p>An Israeli official told  that the US informed Israel in advance of the attacks on Yemen.&nbsp;</p><p>The air and naval strikes hit the Houthis’ radars, air defenses, and missile and drone systems,  reported.</p><p>The Houthi TV channel said that an electrical installation in the city of Dahyan, in the Saada province in northwestern Yemen, was also struck resulting in a loss of electricity across the city.</p><figure><figcaption> Smoke rises from the site of Israeli air strikes at the port of Hodeidah, in Hodeidah, Yemen July 21, 2024. (credit: REUTERS/STRINGER)</figcaption></figure><p>US President Donald Trump wrote on his Truth Social account that “today, I have ordered the United States military to launch decisive and powerful military action against the Houthi terrorists in Yemen. They have waged an unrelenting campaign of piracy, violence, and terrorism against American, and other, ships, aircraft, and drones.”Trump also slammed his predecessor, former president Joe Biden, for his “pathetically weak” handling of the Houthi threat.</p><p>“Funded by Iran, the Houthi thugs have fired missiles at US aircraft, and targeted our troops and allies. These relentless assaults have cost the US and world economy many billions of dollars while, at the same time, putting innocent lives at risk,” the president stressed.</p><section><section><div><div><p>Stay updated with the latest news!</p><p>Subscribe to The Jerusalem Post Newsletter</p></div></div></section></section><p>“The Houthi attack on American vessels will not be tolerated,” Trump wrote. “We will use overwhelming lethal force until we have achieved our objective. The Houthis have choked off shipping in one of the most important waterways of the world, grinding vast swaths of global commerce to a halt, and attacking the core principle of freedom of navigation upon which international trade and commerce depends.”</p><h3><strong>Donald Trump: Houthis, your time is up, starting today</strong></h3><p>The president concluded the post with a message to the Houthis and to Iran.</p><p>“To all Houthi terrorists, YOUR TIME IS UP, AND YOUR ATTACKS MUST STOP, STARTING TODAY. IF THEY DON’T, HELL WILL RAIN DOWN UPON YOU LIKE NOTHING YOU HAVE EVER SEEN BEFORE!” he wrote. “To Iran: Support for the Houthi terrorists must end IMMEDIATELY! Do NOT threaten the American people, their president, who has received one of the largest mandates in presidential history, or worldwide shipping lanes. If you do, BEWARE, because America will hold you fully accountable and, we won’t be nice about it!”</p><p>The strike’s goal is to open international shipping lanes in the Red Sea, which have been disrupted by the Houthis.Houthi-run Al Masirah TV previously said on Saturday that an attack targeted the Yemeni capital Sana’a, without providing further details.</p><p>The Iran-backed Houthi terror group paused attacks on Israel, which it began in support of Hamas, during the Israel-Hamas ceasefire. However, the Houthis announced last week that they would recommence attacks in response to Israel’s blockade on aid in Gaza.</p><p><em>This is a developing story.</em></p><p><em>Amichai Stein contributed to this report.</em></p>","contentLength":3398,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc2bf3/on_trumps_order_us_launches_largescale_attacks_on/"},{"title":"Breathtaking video: 800.000+ people are on the streets of Belgrade (Serbia) - protest against corruption","url":"https://v.redd.it/899b61dp5woe1","date":1742064901,"author":"/u/MrUncleBro","guid":567,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1jc29fk/breathtaking_video_800000_people_are_on_the/"},{"title":"Pro European Demonstrations in Romania","url":"https://www.reddit.com/r/europe/comments/1jc25my/pro_european_demonstrations_in_romania/","date":1742064614,"author":"/u/mirceabyd","guid":398,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Glow of Freedom – Protests in Belgrade, Serbia 15.3.2025.","url":"https://www.reddit.com/r/europe/comments/1jc1e1b/the_glow_of_freedom_protests_in_belgrade_serbia/","date":1742062551,"author":"/u/Flashy-Diamond9613","guid":395,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Prime Minister Carney orders review of F-35 fighter jet purchase from U.S.’s Lockheed Martin","url":"https://montreal.citynews.ca/2025/03/15/carney-orders-review-of-f-35-fighter-jet-purchase-from-u-s-s-lockheed-martin/","date":1742059810,"author":"/u/BonkMcSlapchop","guid":392,"unread":true,"content":"<p>Prime Minister Mark Carney has asked for a review of Canada’s plan to purchase a fleet of F-35 fighter jets.</p><p>The deal with Lockheed Martin and the U.S. government is for 88 planes at a cost of about US$85 million each.</p><p>A spokesperson for Defence Minister Bill Blair said Carney has asked Blair to look into whether the F-35 contract is the best investment for Canada given the “changing environment,” or if there are better options.</p><p>“At this time, the contract to purchase the F-35 remains in place, and Canada has made a legal commitment of funds for the first 16 aircraft,” Laurent de Casanove said in a statement to CityNews. “The Prime Minister has also asked the Minister of National Defence to work with CAF/DND to determine if the F-35 contract, as it stands, is the best investment for Canada, and if there are other options that could better meet Canada’s needs.”</p><p>“To be clear, we are not cancelling the F-35 contract.” </p><p>Carney became prime minister on Friday, in the midst of a trade war with the United States and threats by U.S. President Donald Trump to annex Canada.&nbsp;</p><p>The new fleet is set to replace the Royal Canadian Air Force’s aging CF-18s, with the first four of the 88 planes expected to be delivered in 2026 and the final 18 in 2032.&nbsp;</p><p>In an interview with the CBC Friday, Blair said he will be looking at whether all the jets need to be F-35s, or whether there are other alternatives, “particularly where there may be opportunities” to assemble, support and maintain the jets in Canada.</p><p>“The direction I’ve been given by the prime minister is go and look at all of our options to make sure that we make the right decision for Canada,” he said.</p><p>Blair said he will consult with the Canadian Air Force, the chief of the defence staff, and the Department of National Defence, as well as allies and partners “to see what is possible.”</p><p>A spokesperson for Lockheed Martin referred questions to the Canadian and U.S. governments.&nbsp;</p><p>“Lockheed Martin values our strong partnership and history with the Royal Canadian Air Force and looks forward to continuing that partnership into the future,” the company said in a statement.</p><p>The White House did not respond to a request for comment Saturday afternoon.</p><h2>On-again, off-again decision to buy F-35s</h2><p>The Conservative government first committed to buying 65 F-35s without a competition in 2010, but concerns about the cost and capabilities forced it to reconsider.</p><p>Then, in 2015, the Liberals promised to instead launch an open competition to replace the CF-18s and not to buy the F-35 at all.</p><p>The government planned to buy 18 Super Hornets without a competition as an “interim” measure but cancelled the plan after Boeing launched a trade dispute with Montreal aerospace firm Bombardier.</p><p>Ottawa initiated an open bidding process for the new fleet in July 2019.</p><p>In January 2023, Canada announced it would buy the F-35 fighter jet with the first four of the 88 planes expected to be delivered in 2026 and the final 18 in 2032.</p><p>At the time, Defence Minister Anita Anand called the F-35 the best choice for Canada.</p><h2>A mixed fleet of planes ‘less disruptive, but costly and complex’</h2><p>Michael Byers, a professor at the University of British Columbia and co-director of the Outer Space Institute, has previously argued that Canada should cancel the contract because the planes are highly computerized, with Lockheed Martin refusing to share the full source code, and Canada would never be able to have full control of them.</p><p>He said Saturday the 16 planes that Canada has already paid for are sunk costs, and the country should “cut its losses.”</p><p>“We need planes that can operate to their full capacity without U.S.-controlled computer systems,” he said.</p><p>Philippe Lagassé, a Carleton University associate professor specializing in defence policy and procurement, said there is currently a “large scale transition underway” from the CF-18s to the F-35s, which doesn’t only include the planes, but also the also the “infrastructure, training, munitions, and operational constructs for North America.”</p><p>Lagassé, who also served as a member of the independent review panel that looked at the options to replace the CF-18s, said changing all those plans would be a massive undertaking.</p><p>“It can all be done, but it will put significant pressure on the RCAF and leave Canada with less capability for some time,” he said.</p><p>Opting for a mixed fleet of F-35s and another plane “would be less disruptive, but costly and complex.”</p><p>The Parliamentary Budget Officer has said the total cost to buy, fly and maintain the new F-35 fleet would be an estimated $73.9 billion. A 2023 report estimated the acquisition phase would cost $19.8 billion, including $10.7 billion for 88 planes, $2.1 billion for weapons and ammunition and $5.9 billion for elements like design and depot costs, infrastructure and training.</p>","contentLength":4889,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jc0co6/prime_minister_carney_orders_review_of_f35/"},{"title":"Zelenskyy: Partners agree that Ukraine and Europe can be strengthened in 3 years","url":"https://www.pravda.com.ua/eng/news/2025/03/15/7503060/","date":1742058753,"author":"/u/eaglemaxie","guid":386,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1jbzy15/zelenskyy_partners_agree_that_ukraine_and_europe/"},{"title":"After filling up the square in front of the Serbian parliament, protesters have now filled up the Slavija square also","url":"https://www.reddit.com/r/europe/comments/1jbzfgj/after_filling_up_the_square_in_front_of_the/","date":1742057426,"author":"/u/Landrayi","guid":400,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A glimpse of the largest protest in Serbian history happening right now in Belgrade.","url":"https://www.reddit.com/r/europe/comments/1jbyw2u/a_glimpse_of_the_largest_protest_in_serbian/","date":1742055995,"author":"/u/vuxeee","guid":404,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Pro European Demonstrations in Rome","url":"https://www.reddit.com/r/europe/comments/1jbx4iu/pro_european_demonstrations_in_rome/","date":1742051211,"author":"/u/HuskyBoss219","guid":402,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["reddit"]}