{"id":"MvwLKznkcWQJt9LV3qspiNNstpReRGojdXM3bsYDh","title":"Kubernetes Blog","displayTitle":"Dev - Kubernetes Blog","url":"https://kubernetes.io/feed.xml","feedLink":"https://kubernetes.io/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Spotlight on SIG Apps","url":"https://kubernetes.io/blog/2025/03/12/sig-apps-spotlight-2025/","date":1741737600,"author":"","guid":486,"unread":true,"content":"<p>In our ongoing SIG Spotlight series, we dive into the heart of the Kubernetes project by talking to\nthe leaders of its various Special Interest Groups (SIGs). This time, we focus on\n,\nthe group responsible for everything related to developing, deploying, and operating applications on\nKubernetes. <a href=\"https://www.linkedin.com/in/sandipanpanda\">Sandipan Panda</a>\n(<a href=\"https://www.devzero.io/\">DevZero</a>) had the opportunity to interview <a href=\"https://github.com/soltysh\">Maciej\nSzulik</a> (<a href=\"https://defenseunicorns.com/\">Defense Unicorns</a>) and <a href=\"https://github.com/janetkuo\">Janet\nKuo</a> (<a href=\"https://about.google/\">Google</a>), the chairs and tech leads of\nSIG Apps. They shared their experiences, challenges, and visions for the future of application\nmanagement within the Kubernetes ecosystem.</p><p><strong>Sandipan: Hello, could you start by telling us a bit about yourself, your role, and your journey\nwithin the Kubernetes community that led to your current roles in SIG Apps?</strong></p><p>: Hey, my name is Maciej, and I’m one of the leads for SIG Apps. Aside from this role, you\ncan also find me helping\n<a href=\"https://github.com/kubernetes/community/tree/master/sig-cli#readme\">SIG CLI</a> and also being one of\nthe Steering Committee members. I’ve been contributing to Kubernetes since late 2014 in various\nareas, including controllers, apiserver, and kubectl.</p><p>: Certainly! I'm Janet, a Staff Software Engineer at Google, and I've been deeply involved\nwith the Kubernetes project since its early days, even before the 1.0 launch in 2015. It's been an\namazing journey!</p><p>My current role within the Kubernetes community is one of the chairs and tech leads of SIG Apps. My\njourney with SIG Apps started organically. I started with building the Deployment API and adding\nrolling update functionalities. I naturally gravitated towards SIG Apps and became increasingly\ninvolved. Over time, I took on more responsibilities, culminating in my current leadership roles.</p><p><em>All following answers were jointly provided by Maciej and Janet.</em></p><p><strong>Sandipan: For those unfamiliar, could you provide an overview of SIG Apps' mission and objectives?\nWhat key problems does it aim to solve within the Kubernetes ecosystem?</strong></p><p>As described in our\n<a href=\"https://github.com/kubernetes/community/blob/master/sig-apps/charter.md#scope\">charter</a>, we cover a\nbroad area related to developing, deploying, and operating applications on Kubernetes. That, in\nshort, means we’re open to each and everyone showing up at our bi-weekly meetings and discussing the\nups and downs of writing and deploying various applications on Kubernetes.</p><p><strong>Sandipan: What are some of the most significant projects or initiatives currently being undertaken\nby SIG Apps?</strong></p><p>At this point in time, the main factors driving the development of our controllers are the\nchallenges coming from running various AI-related workloads. It’s worth giving credit here to two\nworking groups we’ve sponsored over the past years:</p><h2>Best practices and challenges</h2><p><strong>Sandipan: SIG Apps plays a crucial role in developing application management best practices for\nKubernetes. Can you share some of these best practices and how they help improve application\nlifecycle management?</strong></p><ol><li><p>Implementing <a href=\"https://kubernetes.io/docs/tasks/configure-pod-container/configure-liveness-readiness-startup-probes/\">health checks and readiness probes</a>\nensures that your applications are healthy and ready to serve traffic, leading to improved\nreliability and uptime. The above, combined with comprehensive logging, monitoring, and tracing\nsolutions, will provide insights into your application's behavior, enabling you to identify and\nresolve issues quickly.</p></li><li><p><a href=\"https://kubernetes.io/docs/concepts/workloads/autoscaling/\">Auto-scale your application</a> based\non resource utilization or custom metrics, optimizing resource usage and ensuring your\napplication can handle varying loads.</p></li><li><p>Use Deployment for stateless applications, StatefulSet for stateful applications, Job\nand CronJob for batch workloads, and DaemonSet for running a daemon on each node. Use\nOperators and CRDs to extend the Kubernetes API to automate the deployment, management, and\nlifecycle of complex applications, making them easier to operate and reducing manual\nintervention.</p></li></ol><p><strong>Sandipan: What are some of the common challenges SIG Apps faces, and how do you address them?</strong></p><p>The biggest challenge we’re facing all the time is the need to reject a lot of features, ideas, and\nimprovements. This requires a lot of discipline and patience to be able to explain the reasons\nbehind those decisions.</p><p><strong>Sandipan: How has the evolution of Kubernetes influenced the work of SIG Apps? Are there any\nrecent changes or upcoming features in Kubernetes that you find particularly relevant or beneficial\nfor SIG Apps?</strong></p><p>The main benefit for both us and the whole community around SIG Apps is the ability to extend\nkubernetes with <a href=\"https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/\">Custom Resource Definitions</a>\nand the fact that users can build their own custom controllers leveraging the built-in ones to\nachieve whatever sophisticated use cases they might have and we, as the core maintainers, haven’t\nconsidered or weren’t able to efficiently resolve inside Kubernetes.</p><p><strong>Sandipan: What opportunities are available for new contributors who want to get involved with SIG\nApps, and what advice would you give them?</strong></p><p>We get the question, \"What good first issue might you recommend we start with?\" a lot :-) But\nunfortunately, there’s no easy answer to it. We always tell everyone that the best option to start\ncontributing to core controllers is to find one you are willing to spend some time with. Read\nthrough the code, then try running unit tests and integration tests focusing on that\ncontroller. Once you grasp the general idea, try breaking it and the tests again to verify your\nbreakage. Once you start feeling confident you understand that particular controller, you may want\nto search through open issues affecting that controller and either provide suggestions, explaining\nthe problem users have, or maybe attempt your first fix.</p><p>Like we said, there are no shortcuts on that road; you need to spend the time with the codebase to\nunderstand all the edge cases we’ve slowly built up to get to the point where we are. Once you’re\nsuccessful with one controller, you’ll need to repeat that same process with others all over again.</p><p><strong>Sandipan: How does SIG Apps gather feedback from the community, and how is this feedback\nintegrated into your work?</strong></p><p>We always encourage everyone to show up and present their problems and solutions during our\nbi-weekly <a href=\"https://github.com/kubernetes/community/tree/master/sig-apps#meetings\">meetings</a>. As long\nas you’re solving an interesting problem on top of Kubernetes and you can provide valuable feedback\nabout any of the core controllers, we’re always happy to hear from everyone.</p><p><strong>Sandipan: Looking ahead, what are the key focus areas or upcoming trends in application management\nwithin Kubernetes that SIG Apps is excited about? How is the SIG adapting to these trends?</strong></p><p>Definitely the current AI hype is the major driving factor; as mentioned above, we have two working\ngroups, each covering a different aspect of it.</p><p><strong>Sandipan: What are some of your favorite things about this SIG?</strong></p><p>Without a doubt, the people that participate in our meetings and on\n<a href=\"https://kubernetes.slack.com/messages/sig-apps\">Slack</a>, who tirelessly help triage issues, pull\nrequests and invest a lot of their time (very frequently their private time) into making kubernetes\ngreat!</p><p>SIG Apps is an essential part of the Kubernetes community, helping to shape how applications are\ndeployed and managed at scale. From its work on improving Kubernetes' workload APIs to driving\ninnovation in AI/ML application management, SIG Apps is continually adapting to meet the needs of\nmodern application developers and operators. Whether you’re a new contributor or an experienced\ndeveloper, there’s always an opportunity to get involved and make an impact.</p><p>If you’re interested in learning more or contributing to SIG Apps, be sure to check out their <a href=\"https://github.com/kubernetes/community/tree/master/sig-apps\">SIG\nREADME</a> and join their bi-weekly <a href=\"https://github.com/kubernetes/community/tree/master/sig-apps#meetings\">meetings</a>.</p>","contentLength":7391,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","k8s"]}