{"id":"VMK7D8tQvwsLtnxKHzNdF9c4Yhtuqm","title":"Hacker News: Best","displayTitle":"Best of HackerNews","url":"https://hnrss.org/best","feedLink":"https://news.ycombinator.com/best","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":50,"items":[{"title":"Death rates rose in hospital ERs after private equity firms took over","url":"https://www.nbcnews.com/news/us-news/death-rates-rose-hospital-ers-private-equity-firms-took-study-finds-rcna233211","date":1758807170,"author":"coloneltcb","guid":87647,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45372442"},{"title":"Helium Browser","url":"https://helium.computer/","date":1758754276,"author":"spacebuffer","guid":87577,"unread":true,"content":"<div><h2>Powerful when you need it</h2><p>Open pages side-by-side with split view to get even more things done at once. Quickly\n            copy page links with ⌘+Shift+C and share your discoveries with ease. Install any web\n            apps and use them as standalone desktop apps without duplicating Chromium.</p></div><div><h2>Designed to get out of your way</h2><p>Helium's interface is compact and minimalistic, but it doesn't compromise on beauty or\n            functionality. More web content fits on the screen at once, and the browser interface\n            doesn't get in your way. You can hide everything extra from the toolbar if it annoys\n            you. <p> Helium is built with attention to detail. Nothing jiggles or flickers abnormally. Your\n            actions aren't throttled or stopped by lag. Everything's fast, smooth, and simple.\n            Comfort and simplicity are among our top priorities.</p></p></div><div><h2>Works with all Chromium extensions, privately</h2><p>All Chromium extensions are supported and work right away, by default, including all MV2\n            extensions. We'll keep support for MV2 extensions for as long as possible. <p> Helium anonymizes all internal requests to the Chrome Web Store via Helium services.\n            Thanks to this, Google can't track your extension downloads or target ads using this\n            data. No other browser does this.</p></p></div>","contentLength":1322,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45366867"},{"title":"Everything that's wrong with Google Search in one image","url":"https://bitbytebit.substack.com/p/everything-thats-wrong-with-google","date":1758751908,"author":"recroad","guid":87334,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45366566"},{"title":"Terence Tao: The role of small organizations in society has shrunk significantly","url":"https://mathstodon.xyz/@tao/115259943398316677","date":1758731544,"author":"bertman","guid":87296,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45362697"},{"title":"Just let me select text","url":"https://aartaka.me/select-text.html","date":1758722197,"author":"ayoisaiah","guid":87231,"unread":true,"content":"<a href=\"https://aartaka.me/about.html\">By Artyom Bologov</a><section><p>\nThere are lots of tourists in Armenia in the summer.\nFrom all over the world really.\nSpeaking a stupefying range of languages.\nWith bios and prompt answers in these numerous languages.\nNot necessarily discernible to me due to my language learning stagnation.\n\n</p><p>\nSo there’s this profile of a pretty German girl.\nWith bio and prompts in (an undeniably beautiful) German.\nSpeaking English, she made the decision to use her mother tongue for the bio.\nA totally valid choice.\n\n</p><p>\nSo I want to know the story she tells with her profile:\n\n</p><ul><li> look up the exact meaning of some mistranslated German word,\n</li><li> and realize the unexpected poetic meaning she put into these 300 chars.\n</li></ul><p>\nExcept… I can’t do that.\nThe text is not selectable/copyable in Bumble app.\nI have to do a bunch of relatively unsurmountable steps to do what should’ve taken half a minute.\nLike screenshot the profile and scrape the text with iOS Photos text recognition.\nOr use some OCR (web)app elsewhere.\nIt’s… discouraging.\nThus I give up and swipe left.\nA shame—she was beautiful at the very least!\n\n</p></section><section><p>\nBy making the text in your UI non-selectable, you turn it into… an image essentially?\nImages, audio, video, and interactive JS-heavy pages are multidimentional media.\nNot really manipulable and referenceable in any reasonable way.\n<a href=\"https://w3.org/TR/media-frags\">(Not even with Media Fragments—they were turned down by everyone.)</a>\nYou lose a whole dimension (🥁) of functionality and benefit by going with such media or their semblance text.\n\n</p><p>\nPodcasts are not easy to roll back to useful part.\nVideo transcripts don’t make sense without the visuals.\nWeb graphics are opaque -es you can’t gut.\n\n</p><p>\nText is copyable.\nText is translatable.\nText is accessible (as in a11y.)\nText is lightweight.\nText is fundamental to how we people process information.\n\n</p><p>\nThat’s why we still use text in our UIs.\nWe want to convey the meaning.\nWe strive to provide unambiguous instructions.\nWe need to be understood.\nSo why make the text harder to process and understand?\n\n</p></section><section><p>\nWhenever you disable text selection/copying on your UI, you commit a crime against the user.\nCrime against comprehension.\nCrime against accessibility.\nCrime against the meaning.\nStop incapacitating your users, allow them to finally use the text.\n\n</p><h2>Leave feedback! (via email)</h2></section>","contentLength":2292,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45360475"},{"title":"US airlines are pushing to remove protections for passengers and add more fees","url":"https://www.travelandtourworld.com/news/article/american-joins-delta-southwest-united-and-other-us-airlines-push-to-strip-away-travelers-rights-and-add-more-fees-by-rolling-back-key-protections-in-new-deregulation-move/","date":1758717059,"author":"duxup","guid":87295,"unread":true,"content":"<p> Published on\nSeptember 23, 2025</p><p>American Airlines joins with Delta, Southwest, United, and other US <a href=\"https://www.regulations.gov/comment/DOT-OST-2025-0026-0845\">airlines</a> are pushing to remove key <a href=\"https://www.reginfo.gov/public/do/eAgendaViewRule?pubId=202504&amp;RIN=2105-AF20\">protections</a> for passengers and add more fees by rolling back rules, claiming it will lower costs and boost competition, but it may leave travelers with fewer rights and more hidden charges. Under the guise of lowering costs and boosting competition, these changes are likely to result in the erosion of consumer rights – the right to cancel a ticket with an automatic refund, transparency of pricing, and the right to sit with your family on the same reservation. Airlines claim that removing these ‘protections’ will decrease airfare and increase competition on the routes. The prospects for travelers, on the other hand, will likely be more fees, less certainty of receiving the service paid for, and diminished responsibility from the airlines for service failures. If these projections become reality, deregulation will aggravate the air travel experience for the consumer making it more expensive and more opaque.</p><h3>The Airline Industry’s Deregulatory Push</h3><p>The U.S. airline industry is pushing for a significant rollback of consumer protections, which many see as a major step backward for air travel. Airline lobbyists, representing carriers like American, Delta, Southwest, United, and the Airlines for America (A4A) association, have laid out a detailed agenda that would fundamentally alter the landscape of air travel, making it more difficult for passengers to know what they’re actually paying for and less likely to receive compensation when things go wrong.</p><p>This agenda centers on weakening or eliminating four major consumer protections:</p><ol><li><strong>Automatic Refunds for Cancellations</strong>: Airlines want to remove the requirement to provide automatic refunds when flights are cancelled or significantly altered. Passengers may instead receive only vouchers or no compensation at all, leaving them without recourse in the event of a major flight disruption.</li><li>: The airlines also aim to strip away rules that require them to disclose all fees (like baggage, seat assignments, and service charges) upfront. Instead of the clear, itemized pricing system that passengers currently rely on, airlines could hide fees until later in the booking process, making the true cost of a ticket much higher than expected.</li><li><strong>Family Seating Guarantees</strong>: Under current regulations, airlines must ensure that families with young children are seated together without additional charges. This would no longer be guaranteed under the new proposal, meaning families could face extra costs just to sit next to one another.</li><li><strong>Accessibility Protections for Disabled Passengers</strong>: The deregulation proposal also targets protections for disabled passengers, weakening their access to support and assistance during air travel.</li></ol><h3>The Airline Industry’s Argument: Deregulation as a Path to Lower Prices</h3><p>The airline industry’s argument for deregulation is grounded in a belief that removing these protections will lead to lower prices, more competition, and better services for consumers. Airline lobbyists argue that deregulation, which began with the Airline Deregulation Act of 1978, has led to increased competition, lower airfares, and more choices for passengers.</p><p>However, while some might agree that competition can drive prices down, there’s a serious concern that deregulation could lead to more surprise charges and less accountability for airlines. Instead of benefiting consumers, deregulation may open the door for airlines to charge excessive fees for basic services, which are often hidden until later in the booking process. This could leave passengers paying far more than they anticipated and receiving less value for their money.</p><h3>The Airlines’ Detailed Deregulatory Agenda</h3><p>The Airlines for America (A4A), the industry group representing major U.S. airlines, has strongly supported deregulation, arguing that it has benefited both airlines and passengers since the 1970s. In a recent document, A4A outlined their full deregulatory wish list, which includes the following key points:</p><ol><li>: A4A strongly advocates for the continuation of deregulation, claiming that it has led to lower prices, increased competition, and better services for consumers. The group argues that removing regulations would allow airlines to better compete in the market and reinvest in improving services for passengers.</li><li><strong>Criticism of the Biden Administration’s Regulatory Actions</strong>:<ul><li><strong>Ancillary Fee Transparency</strong>: A4A opposes the U.S. Department of Transportation’s (DOT) rules requiring airlines to disclose ancillary fees upfront, arguing that these rules exceed the DOT’s authority and don’t provide any clear benefits to consumers.</li><li>: A4A calls for the repeal or revision of refund rules that, according to them, go beyond what’s required by law, imposing unnecessary costs on airlines without providing any clear benefit to the public.</li><li><strong>Flight Delay and Cancellations</strong>: The group also criticizes DOT’s policies on flight delays and cancellations, claiming the rules unfairly penalize airlines, particularly when disruptions are caused by factors beyond their control.</li></ul></li><li>: A4A outlines several changes they would like to see the DOT pursue:<ul><li><strong>Rescinding Unlawful Regulations</strong>: A4A seeks the repeal of certain regulations, such as family seating and mobility aid assistance rules, which they argue exceed DOT’s authority.</li><li>: The group wants to limit DOT’s authority on flight refund rules, particularly for minor operational changes, such as changes to flight numbers or itineraries that don’t cause harm to passengers.</li></ul></li><li><strong>Economic Impact of Deregulation</strong>: A4A points to the success of deregulation, citing a rise in low-cost carriers, which have made air travel more affordable. They also highlight the significant decrease in airfare prices, which has directly benefited consumers.</li><li><strong>Investment in Airline Operations</strong>: A4A argues that deregulation has allowed airlines to reinvest in their services, improving customer satisfaction and innovation.</li><li><strong>Support for Technological Innovation</strong>: The airline industry is also backing the use of technology, including artificial intelligence (AI) and biometrics, to improve operational efficiency and the customer experience.</li></ol><h3>Why Deregulation is a Concern for Passengers</h3><p>While the airline industry argues that deregulation will lead to lower prices and more competition, critics are skeptical. Here are the key reasons why deregulation could harm consumers:</p><ol><li>: If airlines are no longer required to disclose fees upfront, passengers may face a barrage of surprise charges, from baggage fees to seat selection costs. The cost of air travel could increase significantly, even if base fares appear lower.</li><li><strong>No Guarantees for Families</strong>: The proposal to eliminate the guarantee that families will be seated together without extra charges could lead to more stress for families travelling with young children. Parents may find themselves paying additional fees just to sit next to their kids.</li><li><strong>Less Accountability for Cancellations</strong>: Airlines would have more power to decide whether or not to refund passengers for flight cancellations. This could lead to more vouchers, rather than cash refunds, leaving passengers at the mercy of airlines’ own policies.</li><li><strong>Weaker Protections for Disabled Passengers</strong>: The weakening of accessibility regulations could make it more difficult for passengers with disabilities to access the services and assistance they need during their travel.</li><li><strong>Less Competition, Not More</strong>: While deregulation advocates claim it will lead to more competition, the reality is that fewer protections for consumers could allow major airlines to exploit passengers without fear of consequences. Smaller carriers may also struggle to compete on an uneven playing field.</li></ol><h3>The Risk of Over-Regulation vs. Consumer Protection</h3><p>The battle between over-regulation and consumer protection is a complex issue. While it’s true that some regulations may stifle innovation, the protections that are in place help ensure fair treatment and transparency for consumers. The question is not whether airlines should be regulated, but how much regulation is necessary to strike a balance between profitability and protecting passengers.</p><p>In Europe, stricter regulations have led to fewer delays and cancellations, and the market remains competitive with budget airlines thriving under the current system. The fear is that deregulation in the U.S. could result in a situation where airlines dominate the market, and passengers are left with fewer rights and more fees.</p><p>As a passenger, it’s important to stay informed about these changes and advocate for your rights. Here are some steps you can take:</p><ul><li>: Keep up with the latest news and updates on airline regulations.</li><li><strong>Contact Your Representatives</strong>: Let your senators and congress members know how you feel about the deregulation of the airline industry.</li><li>: Understand the protections you currently have and how they might change.</li></ul><p>American Airlines, Delta, Southwest, United, and other U.S. airlines are pushing to remove key protections for passengers and add more fees by rolling back regulations, arguing that it will lower costs and increase competition, but it could also lead to fewer rights and more hidden charges for travelers.</p><p>The deregulation push by U.S. airlines is a major threat to passenger rights. While airlines argue that deregulation will lead to cheaper fares and more competition, the reality is likely to be more fees, less transparency, and fewer protections for passengers. If successful, this move could turn back the clock to a time when flying was riddled with hidden charges and unfair treatment.</p><p>The future of air travel depends on consumers, advocacy groups, and lawmakers standing up for passenger rights. The airline industry may be pushing for deregulation, but it’s up to the public to ensure that the changes made are in the best interest of all passengers, not just the airlines. The battle is not just about cheaper tickets, but about ensuring that air travel remains fair, transparent, and accountable for everyone.</p>","contentLength":10081,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45359378"},{"title":"EU age verification app not planning desktop support","url":"https://github.com/eu-digital-identity-wallet/av-doc-technical-specification/issues/22","date":1758714770,"author":"sschueller","guid":87576,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45359074"},{"title":"Yt-dlp: Upcoming new requirements for YouTube downloads","url":"https://github.com/yt-dlp/yt-dlp/issues/14404","date":1758714114,"author":"phewlink","guid":87103,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45358980"},{"title":"Huntington's disease treated for first time","url":"https://www.bbc.com/news/articles/cevz13xkxpro","date":1758713850,"author":"_zie","guid":87575,"unread":true,"content":"<div data-component=\"text-block\"><p>One of the cruellest and most devastating diseases – Huntington's – has been successfully treated for the first time, say doctors.</p><p>The disease runs through families, relentlessly kills brain cells and resembles a combination of dementia, Parkinson's and motor neurone disease.</p><p>An emotional research team became tearful as they described how data shows the disease was slowed by 75% in patients.</p><p>It means the decline you would normally expect in one year would take four years after treatment, giving patients decades of \"good quality life\", Prof Sarah Tabrizi told BBC News.</p><p>The new treatment is a type of gene therapy given during 12 to 18 hours of delicate brain surgery.</p></div><div data-component=\"text-block\"><p>The first symptoms of Huntington's disease tend to appear in your 30s or 40s and is normally fatal within two decades – opening the possibility that earlier treatment could prevent symptoms from ever emerging.</p><p>Prof Tabrizi, director of the University College London Huntington's Disease Centre, described the results as \"spectacular\". </p><p>\"We never in our wildest dreams would have expected a 75% slowing of clinical progression,\" she said.</p><p>None of the patients who have been treated are being identified, but one was medically retired and has returned to work. Others in the trial are still walking despite being expected to need a wheelchair.</p><p>Treatment is likely to be very expensive. However, this is a moment of real hope in a disease that hits people in their prime and devastates families.</p></div><div data-component=\"text-block\"><p>Huntington's runs through Jack May-Davis' family. He has the faulty gene that causes the disease, as did his dad, Fred, and his grandmother, Joyce.</p><p>Jack said it was \"really awful and horrible\" watching his dad's inexorable decline. </p><p>The first symptoms appeared in Fred's late 30s, including changes in behaviour and the way he moved. He eventually needed 24/7 palliative care before he died at the age of 54, in 2016.</p><p>Jack is 30, a barrister's clerk, newly engaged to Chloe and has taken part in research at UCL to turn his diagnosis into a positive.</p><p>But he'd always known he was destined to share his father's fate, until today.</p><p>Now he says the \"absolutely incredible\" breakthrough has left him \"overwhelmed\" and able to look to a future that \"seems a little bit brighter, it does allow me to think my life could be that much longer\".</p></div><div data-component=\"text-block\"><p>Huntington's disease is caused by an error in part of our DNA called the huntingtin gene.</p><p>If one of your parents has Huntington's disease, there's a 50% chance that you will inherit the altered gene and will eventually develop Huntington's too.</p><p>This mutation turns a normal protein needed in the brain – called the huntingtin protein – into a killer of neurons.</p><p>The goal of the treatment is to reduce levels of this toxic protein permanently, in a single dose.</p><p>The therapy uses cutting edge genetic medicine combining gene therapy and gene silencing technologies.</p></div><div data-component=\"text-block\"><p>It starts with a safe virus that has been altered to contain a specially designed sequence of DNA.</p><p>This is infused deep into the brain using real-time MRI scanning to guide a microcatheter to two brain regions - the caudate nucleus and the putamen. This takes 12 to 18 hours of neurosurgery.</p><p>The virus then acts like a microscopic postman – delivering the new piece of DNA inside brain cells, where it becomes active.</p><p>This turns the neurons into a factory for making the therapy to avert their own death.</p><p>The cells produce a small fragment of genetic material (called microRNA) that is designed to intercept and disable the instructions (called messenger RNA) being sent from the cells' DNA for building mutant huntingtin.</p><p>This results in lower levels of mutant huntingtin in the brain.</p></div><div data-component=\"text-block\"><p>Results from the trial - which involved 29 patients - have been released in a statement by the company uniQure, but have not yet been published in full for review by other specialists.</p><p>The data showed that three years after surgery there was an average 75% slowing of the disease based on a measure which combines cognition, motor function and the ability to manage in daily life.</p><p>The data also shows the treatment is saving brain cells. Levels of neurofilaments in spinal fluid – a clear sign of brain cells dying – should have increased by a third if the disease continued to progress, but was actually lower than at the start of the trial.</p><p>\"This is the result we've been waiting for,\" said Prof Ed Wild, consultant neurologist at the National Hospital for Neurology and Neurosurgery at UCLH.</p><p>\"There was every chance that we would never see a result like this, so to be living in a world where we know this is not only possible, but the actual magnitude of the effect is breathtaking, it's very difficult to fully encapsulate the emotion.\"</p><p>He said he was \"a bit teary\" thinking about the impact it could have on families.</p></div><div data-component=\"text-block\"><p>The treatment was considered safe, although some patients did develop inflammation from the virus that caused headaches and confusion that either resolved or needed steroid treatment.</p><p>Prof Wild anticipates the therapy \"should last for life\" because brain cells are not replaced by the body in the same manner as blood, bone and skin are constantly renewed.</p><p>Approximately 75,000 people have Huntington's disease in the UK, US and Europe with hundreds of thousands carrying the mutation meaning they will develop the disease.</p><p>UniQure says it will apply for a licence in the US in the first quarter of 2026 with the aim of launching the drug later that year. Conversations with authorities in the UK and Europe will start next year, but the initial focus is on the US.</p><p>Dr Walid Abi-Saab, the chief medical officer at uniQure, said he was \"incredibly excited\" about what the results mean for families, and added that the treatment had \"the potential to fundamentally transform\" Huntington's disease.</p><p>However, the drug will not be available for everyone due to the highly complex surgery and the anticipated cost.</p><p>\"It will be expensive for sure,\" says Prof Wild.</p><p>There isn't an official price for the drug. Gene therapies are often pricey, but their long-term impact means that can still be affordable. In the UK, the NHS does pay for a £2.6m-per-patient gene therapy for haemophilia B.</p></div><div data-component=\"text-block\"><p>Prof Tabrizi says this gene therapy \"is the beginning\" and will open the gates for therapies that can reach more people.</p><p>She paid tribute to the \"truly brave\" volunteers who took part in the trial, saying she was \"overjoyed for the patients and families\".</p><p>She is already working with a group of young people who know they have the gene, but don't yet have symptoms – known as stage zero Huntington's – and is aiming to do the first prevention trial to see if the disease can be significantly delayed or even stopped completely.</p></div>","contentLength":6665,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45358940"},{"title":"That Secret Service SIM farm story is bogus","url":"https://cybersect.substack.com/p/that-secret-service-sim-farm-story","date":1758702260,"author":"sixhobbits","guid":87056,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45357693"},{"title":"Baldur's Gate 3 Steam Deck – Native Version","url":"https://larian.com/support/faqs/steam-deck-native-version_121","date":1758673619,"author":"_JamesA_","guid":87016,"unread":true,"content":"<p>Upon release of Hotfix #34 on your Steam Deck, your device will install the Native version.</p><p>If you are unsure whether the build has been installed correctly, you can do the following:</p><ul><li>Go to the game’s Steam page. Click on the Settings button and select Properties.</li></ul><ul><li>Once in the Properties page, go to the Compatibility tab.</li><li>Tick the box for “Force the use of a specific Steam Play compatibility tool”.</li></ul><ul><li>Select any version that has Linux Runtime.</li></ul><ul><li>Allow the game to update if an update appears.</li></ul><p><strong>What’s the difference between the Steam Deck Native and Proton version?</strong></p><p>Our Proton version runs on the Steam Deck via the Proton compatibility layer, which requires extra CPU processing power. Running the game natively on the Steam Deck requires less CPU usage and memory consumption overall!</p><p><strong>Can I still switch back to the Proton version?</strong></p><p>Yes. If you’re having issues with the Steam Deck Native build, you can revert to the Proton version. Take the following steps to do so:</p><p>Go to the game’s Steam page. Click on the Settings button and select Properties.<img alt=\"\" height=\"470\" src=\"http://cmsapi.larian.com/uploads/rte/image-20250923105112-17-68d2b3e1f30f3.png\" width=\"751\"></p><ul><li>Once in the Properties page, go to the Compatibility tab.</li><li>Tick the box for “Force the use of a specific Steam Play compatibility tool”.</li></ul><ul><li>Select any Proton version 8 or higher.</li></ul><ul><li>Allow the game to update.</li></ul><p><strong>Now that there is a Steam Deck Native build, is Baldur’s Gate 3 supported on Linux?</strong></p><p>Larian does not provide support for the Linux platform. The Steam Deck Native build is only supported on Steam Deck.</p><p><strong>Where are my saves located currently (before using the Steam Deck Native version)?</strong></p><p>Before the Steam Deck Native version becomes the primary version, your saves will be in the compatdata folder: /home/deck/.local/share/Steam/steamapps/compatdata/1086940/pfx/drive_c/users/steamuser/AppData/Local/Larian Studios/Baldur's Gate 3/PlayerProfiles/Public</p><p><strong>Where are my saves located when I use the Steam Deck Native version?</strong></p><p>After the Steam Deck Native version becomes the primary version, your saves will be in the following folder: /home/deck/.local/share/Larian Studios/Baldur's Gate 3/PlayerProfiles/Public</p><p><strong>Why are my saves in different folders?</strong></p><p>When Baldur’s Gate 3 runs on the Proton compatibility layer, the Proton version will store the saves in the compatdata folder, which is a mirrored version of the Windows file storage system. On the Steam Deck Native version, the saves are stored natively on the SteamOS file storage system.</p><p><strong>Will my savegames be transferred over to the new version when I use the Steam Deck Native version?</strong></p><p>If your Steam Cloud saves are turned on, your most recent saves will be synced to the Steam Deck Native savegame folder automatically.</p><p><strong>What if I don’t have Cloud saves turned on, or I want my older saves?</strong></p><p>Your saves are still stored on the Steam Deck, but they will be stored in the compatdata folder.\nYou can manually transfer these files via the Desktop:</p><ul><li>First, switch to Desktop Mode by clicking on the Steam button and selecting Power. Then click on Switch to Desktop.</li></ul><ul><li>If&nbsp;you have a mouse and keyboard to hand, plug them in to make your life a little easier, and click on the folder icon on the bar at the bottom.</li><li>In the explorer window, navigate to: /home/deck/.local/share/Steam/steamapps/compatdata/1086940/pfx/drive_c/users/steamuser/AppData/Local/Larian Studios/Baldur's Gate 3/PlayerProfiles/Public</li><li>Copy the Savegames folder.</li><li>Navigate to: /home/deck/.local/share/Larian Studios/Baldur's Gate 3/PlayerProfiles/Public</li><li>Paste the copied folder in this location.</li></ul><p><strong>Will my old saves still take up storage space on my Steam Deck?</strong></p><p>Yes, your old saves will still take up storage space. If you want to save some space and you don't plan on using the Proton version, you can delete the compatdata folder after you've copied over the folders.</p><p><strong>Will my mods be transferred over automatically?</strong></p><p>If you are logged into your Larian Account and have it connected to mod.io, all mods you are subscribed to will be downloaded when the transition to Steam Deck Native occurs.</p><p><strong>What if I’m not logged into a Larian Account or connected to <a href=\"http://mod.io\">mod.io</a>?</strong></p><p>You can either manually download the mods from the Mod Manager or transfer them manually from the previous folder.&nbsp;</p><ul><li>To do so,switch to Desktop Mode by clicking on the Steam button and selecting Power. Then click on Switch to Desktop.</li></ul><ul><li>Click on the folder icon on the bar at the bottom.</li></ul><ul><li>In the explorer window, navigate to: /home/deck/.local/share/Steam/steamapps/compatdata/1086940/pfx/drive_c/users/steamuser/AppData/Local/Larian Studios/Baldur's Gate 3</li><li>Navigate to: /home/deck/.local/share/Larian Studios/Baldur's Gate 3/</li><li>Paste the copied folder in this location.</li></ul><p><strong>The game looks really blurry/fuzzy to me, is there a way to fix that?</strong></p><p>If you’re playing on default settings, the game may be looking a little blurry due to the use of FSR 1 as the default Upscaling Type. You can try to switch it to FSR 2.2 to achieve a better image quality, though at the cost of some performance loss.</p><p>To do so, go into the game’s settings menu. Under the Video tab, scroll down until you find a setting called Upscaling Type. You can switch this over to FSR 2.2 for the best balance between performance and image sharpness.</p>","contentLength":5104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45354644"},{"title":"Find SF parking cops","url":"https://walzr.com/sf-parking/","date":1758650767,"author":"alazsengul","guid":86776,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45350690"},{"title":"Always Invite Anna","url":"https://sharif.io/anna-alexei","date":1758641603,"author":"walterbell","guid":86766,"unread":true,"content":"<p>I was lucky enough to make a few friends my first semester of college. We ended up hanging out quite a bit during those early months.</p><p>We’d all get excited for the weekends because Friday nights meant going out to party. Everyone except for Anna, that is.</p><p>Anna was quiet, shy, and a definitely a goody-two-shoes. She was from Alabama and spoke with a pronounced southern drawl I’d rarely heard in Maryland. She was reserved but friendly once you got to know her. Anna cared about school a lot. She was almost always studying whenever I saw her.</p><p>Every Friday night we’d make plans to go out together and party. But Anna would always refuse to come. She’d say something along the lines of “I have to study” or “I just don’t feel like it tonight.”</p><p>Eventually, we stopped inviting Anna out. Everyone except Alexei.</p><p>I liked Alexei the most in our friend group. He was valedictorian of his high school, played tennis at a competitive level, and was remarkably smart. If anyone deserved to have an ego, it was Alexei. Yet somehow he managed to be the kindest person I’d ever known. But my absolute favorite thing about Alexei was that he always invited Anna to come party with us.</p><p>One Friday night as we were all about to leave the dorms for a house party, Alexei stopped us. “Hold on, let’s invite Anna.” We headed over to her dorm and invited her to come with us. She said “Sorry, I have to study for my Arabic exam next week, but you guys have fun.”</p><p>Alexei continued to invite Anna every time we went out for the rest of the semester. And Anna said no every single time.</p><p>Curious about his persistence, I asked him “Why do you keep inviting Anna out when she’ll just say no?”</p><p>I’ll never forget what he told me: “I know she’s always going to say no, but that’s not the point. I invite her out so she’ll always feel included in the group.”</p><p>After that first semester, the friend group disbanded and we all went our separate ways. Many years later I ran into Anna and we ended up catching up. She told me how difficult her first semester of college had been. She was very close with her mom and sister and missed them terribly.</p><p>But then she said something that stayed with me: She was grateful. She was grateful to be part of that brief friend group because she felt like she had a family away from home. And that even though she never partied with us, she always felt included because we would stop by her room and invite her anyway.</p>","contentLength":2461,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45348495"},{"title":"Shopify, pulling strings at Ruby Central, forces Bundler and RubyGems takeover","url":"https://joel.drapper.me/p/rubygems-takeover/","date":1758641129,"author":"bradgessler","guid":87015,"unread":true,"content":"<p>Ruby Central recently took over a collection of open source projects from their maintainers without their consent. <a href=\"https://pup-e.com/goodbye-rubygems.pdf\">News</a> of the takeover was first <a href=\"https://bsky.app/profile/duckinator.bsky.social/post/3lz6exzgtcc2j\">broken</a> by <a href=\"https://pup-e.com\">Ellen</a> on 19 September.</p><p>I have spoken to about a dozen people directly involved in the events, and seen a recording of a key meeting between Ruby Gems maintainers and Ruby Central, to uncover what went on.</p><p>Here’s a quick summary of what I know:</p><ol><li>Shopify demanded that Ruby Central take full control of the RubyGems GitHub repositories and the  and  gems, threatening to withdraw funding if Ruby Central did not comply.</li><li>HSBT jumped the gun and implemented the takeover plan adding Marty Haught as an owner and reducing maintainers permissions before Marty had discussed this with the maintainers.</li><li>Marty met with the maintainers after their access was temporarily restored.</li><li>Marty (and by extension, Ruby Central) understood that Ruby Central did not have the right to take over these GitHub repositories or gems from their long established community maintainers.</li><li>Marty presented alternatives such as making a fork of the relevant RubyGems projects and warned Ruby Central of the consequences of doing the takeover.</li><li>The board voted to execute the takeover anyway and Marty executed it immediately.</li><li>A number of board members subsequently misrepresented the takeover to the Ruby community on social media.</li><li>This was premeditated. Shopify had organised an on-call rotation to take over from the previous maintainers, some of which at the time were also operating the RubyGems.org Service.</li><li>Shopify specifically demanded that at least one of the RubyGems maintainers, André Arko, be excluded from returning to the project. André has been working on RubyGems for over a decade and was also one of the founders of Ruby Together, an organization that merged with Ruby Central.</li></ol><p>On , HSBT (Hiroshi Shibata) — a member of Ruby core and maintainer of RubyGems — renamed the RubyGems GitHub enterprise to “Ruby Central”, added a new owner, Marty Haught, and downgraded the permissions of several other maintainers.</p><p>According to one of the maintainers, when HSBT was challenged, he refused to revert these changes claiming he needed permission from Marty. On , Marty said the changes were a mistake and HSBT reverted  of the changes. However, Marty was not removed as an owner, even though the other maintainers never agreed to him being added.</p><p>On , RubyGems maintainers met with Marty on Zoom.</p><p>Marty explained he’s been working on “operational planning” for the RubyGems.org Service. He was putting together a new Operator Agreement that all the operators of the RubyGems.org Service would need to sign.</p><p>He also mentioned that it had been identified as a risk that there were external individuals with ownership permissions over repositories that are necessary for running the RubyGems.org Service. He said HSBT prematurely changed the ownership permissions before the operational plan was complete.</p><p>During the discussion, the maintainers clarified with Marty the distinction between the RubyGems source code and the RubyGems.org Service.</p><p> is a collection of community owned, community maintained repositories of code that are held in commons for everyone in the Ruby community to use.</p><p>The  is entirely separate from that. It’s a specific deployment: a domain name and servers that happen to be running RubyGems source code. It is operated by Ruby Central.</p><p>This distinction is important. Anyone else could run the RubyGems source code on their own servers with their own domains. And Ruby Central could decide to run  source code on its servers — whether that be a fork of the RubyGems source code or otherwise.</p><p>The RubyGems maintainers have been developing this software for decades, predating Ruby Central’s operation of the RubyGems.org Service. Their contributions represent countless hours of unpaid work, establishing a clear history of community ownership and stewardship.</p><p>Ruby Central did contribute financially towards RubyGems maintenance, but these contributions did not confer ownership. Ruby Central’s funding of RubyGems development is no different than if they had contributed to the development of Rails, RSpec, or any other open source project. In no case would such funding grant them ownership rights over the project itself.</p><p>Similarly, Ruby Central’s employment of some RubyGems maintainers to operate the RubyGems.org Service does not transfer ownership of the separate open source projects.</p><p>Having personally reviewed a recording of this meeting, I have no doubt that Marty understood this distinction. The RubyGems source code and GitHub organisation was  owned by Ruby Central, even though Ruby Central operated a service with the same name.</p><p>On , the team started losing access again. This time they were  from the GitHub organisation, their  email accounts were disabled and they were removed as owners of the  and  gems. One maintainer, André Arko, was on-call for the RubyGems.org Service at the time when his access to GitHub and Fastly was revoked.</p><p>The Ruby Central board had voted for Ruby Central to take control of the RubyGems GitHub repositories and gems. And since Marty was now an owner, he was able to execute this order.</p><p>When Ruby Central decided to platform DHH at the final RailsConf, they lost $250,000 USD of annual sponsorship from Sidekiq, and this I understand left them almost entirely dependent on Shopify.</p><p>An anonymous source told me that during Rails World, members of Ruby Central, Ruby Core, Rails Core and representatives from major companies (Shopify, GitHub) discussed possible funding options.</p><p>According to this source, Ruby Central was presented with a proposal for long-term support, but this would only happen if certain RubyGems maintainers were removed.</p><p>Another source has confirmed to me that a meeting between Rails Foundation and Ruby Central did take place at Rails World, however they were not able to verify the agenda or who was in attendance.</p><p>I do know that the Rails World conference was attended by HSBT, DHH, Shan Cureton, Marty Haught, Ufuk Kayserilioglu and Rafael França.</p><p>I also know that Shopify specifically put immense financial pressure on Ruby Central to take full control of the RubyGems GitHub organisation and Ruby gems.</p><p>Freedom Dumlao, a Ruby Central board member, described the board vote saying “if I had voted the other way, I felt I’d be voting to start the process of shutting down Ruby Central”.</p><p>A source familiar with the events told me that Shopify’s pressure was both carrot and stick. Essentially, do what we ask and we’ll reward you with  funding, long-term financial stability. Don’t do this and you’ll never see a dollar of enterprise money again.</p><p>This to me strongly suggests that other companies were involved, perhaps through the Rails Foundation. But I have not been able to confirm anything beyond Shopify’s involvement.</p><p>According to a source familiar with the events, the Ruby Central board was made aware by Marty of the risks and damage this takeover would likely do to the community. Apparently he also highlighted other options besides the takeover, such as forking some of the projects.</p><p>Despite this, the board voted in favour of carrying out the takeover and Marty executed it immediately with his new owner privileges.</p><p>Shopify had given Ruby Central a hard deadline and it seems that Ruby Central only capitulated at the last moment.</p><p>I don’t know if the timing was intentional, but this takeover happened on the second day of the EuRuKo conference in Europe, which meant many outspoken European Rubyists were distracted at the time.</p><p>Because this takeover meant locking out most of the RubyGems.org Service operators including André who was on-call at the time, Shopify had contributed engineers to a new on-call rotation ready to spring into action after the takeover.</p><p>A post that feels like AI-generated corporate speak and bears no signature from anyone at Ruby Central willing to take responsibility.</p><p>The response says, “To strengthen supply chain security, we are taking important steps to ensure that administrative access to the RubyGems.org, RubyGems, and Bundler is securely managed. This includes both our production systems and GitHub repositories. In the near term we will temporarily hold administrative access to these projects while we finalize new policies that limit commit and organization access rights. This decision was made and approved by the Ruby Central Board as part of our fiduciary responsibility.”</p><p>But while Ruby Central has the right to lock down the RubyGems.org Service infrastructure, it never owned the RubyGems GitHub repositories.</p><p>DHH ignored Ellen’s post but instead retweeted the Ruby Central announcement with the caption “Ruby Central is making the right moves to ensure the Ruby supply chain is beyond reproach both technically and organisationally.”</p><p>When the Advanced Custom Fields plugin was stolen by WordPress, DHH <a href=\"https://x.com/dhh/status/1845197490829889605\">said</a> “This is totally crazy. Like if the operators of rubygems dot org just decided to expropriate the official Rails gems, hand over control to a new team, and lock the core team out of it. We’re in uncharted and dangerous territory for open source now. What a sad sight.”</p><p>Ruby Central board member and Shopify employee Ufuk Kayserilioglu misrepresented what happened, responding to Bluesky threads. For example he <a href=\"https://bsky.app/profile/ufuk.dev/post/3lz757f6zlc2s\">said</a>, “Ruby Central has been running the rubygems.org system for years now, so this can hardly be considered a supply chain attack. On the contrary, we have a legal obligation to all the users of the system to keep it safe and secure.”</p><p>But no one accused Ruby Central of taking over the RubyGems.org Service and the takeover of the RubyGems GitHub organization and gems was not required to meet Ruby Central’s legal obligations. Remember, Ruby Central was in full control of what source code it deployed to the RubyGems.org Service which it operated.</p><p>He also said “How is limiting access to critical and shared infra &amp; code a supply chain attack?” once again conflating the RubyGems source code with the RubyGems.org Service.</p><p>This is a misrepresentation of the real situation where Ruby Central was responsible for operating the RubyGems.org Service but did not own the RubyGems source code, repositories or gems.</p><p>He goes on to talk about supply chain attacks, which I admit is a convenient cover, but I don’t believe is the genuine reason for the takeover.</p><p>He then confirms that a deadline loomed. “Either Ruby Central puts controls in place to ensure the safety and stability of the infrastructure we are responsible for, or lose the funding that we use to keep those things online and going. With less than 24 hours to go, we were still working on this. Conversations with some maintainers were still happening as far as I know but the cooperation we were hoping for was not emerging.”</p><p>He doesn’t mention Shopify, but based on my other sources, I know it was Shopify that applied this pressure.</p><p>“It was clear that we weren’t quite ready yet, but in the end we were out of time. A vote had to be cast so we could ensure we did not lose funding necessary to operate RubyGems. What I voted for, was to direct Marty, Ruby Central’s Director of Open Source, to temporarily remove access and lock down the systems, get operator agreements in place with maintainers, and then re-enable access to those folks who needed and wanted it. Marty did exactly what the board asked of him.”</p><p>This again highlights the pressure Shopify put on Ruby Central.</p><p>Two sources directly involved told me that access specifically would not be re-enabled for André who had been singled out. Sources have also suggested that Shopify had been pressuring Ruby Central to end their relationship with André and remove him from the RubyGems project for some period of time prior to this taking place.</p><p>On 23 September, Ruby Central shared a video address by Shan Cureton (Executive Director, Ruby Central) on behalf of Ruby Central’s board and team.</p><p>In it she claims that Bundler and RubyGems came under Ruby Central’s responsibility through the merger with Ruby Together. But Ruby Together never owned Bundler or RubyGems.</p><p>She mentioned the departure of a “lead maintainer” [André] and transition of security engineer [Samuel Giddins] as raising questions around access to RubyGems, Bundler and the RubyGems.org Service.</p><p>She says sponsors (plural) and companies who depend on Ruby tooling came to them with supply chain concerns. She explained that they couldn’t reach agreement with existing maintainers in the timelines they were facing.</p><p>I have seen the meeting with the maintainers and can tell you the conversation was primarily about ownership, not security. None of the maintainers had a problem with Ruby Central restricting access to the RubyGems.org Service that it operated.</p><p>They had a problem with Ruby Central taking control of the RubyGems open source code repositories and gems, which Ruby Central never owned.</p><p>She explains that the board voted to remove administrative and commit privileges until agreements could be put in place. She said it was never meant to be permanent.</p><p>She said “this is not a shutdown of community contribution and it’s not permanent”. However, my sources tell me this will be permanent for at least André and likely Samuel.</p><p>She said on-call coverage remains in place. We know that André was on-call when his access was revoked, so she must be talking about the new on-call rotation which Shopify contributed to.</p><p>She said “all of these changes are being made in good faith.” But we know that these changes were made at Shopify’s request to take control of the RubyGems projects and specifically to exclude André (and likely Samuel too).</p><p>She also talked about two new agreements:  cover access to production systems for on-call and maintenance responsibilities.  cover access to Bundler and RubyGem code repositories, covering both paid and volunteer maintainers.</p><p>The Operator Agreements make sense, but it is not Ruby Central’s place to run the RubyGems projects including Bundler and the RubyGems.org source code, which are community owned as explained previously.</p><p>She said, “in most open source projects where the code is a library or framework, you usually don’t see formal operator agreements. People contribute under contributor license agreements, codes of conduct or decisions made by a steering committee. But RubyGems.org is different. It’s not just code, it’s a production service. It runs critical infrastructure for the Ruby ecosystem, processes billions of downloads, stores sensitive metadata and is relied on by companies that have compliance requirements. Because it’s a service, Ruby Central carries the legal liability, the financial exposure and the operational risk. This is why Operator Agreements are necessary. They ensure access is tied to responsibility and accountability.”</p><p>Here she conflates RubyGems.org (the source code) with the RubyGems.org Service operated by Ruby Central and running on the domain name .</p><p>Claiming that Ruby Central owns the RubyGems.org repository because it operates a service that uses the source code is like claiming you own Rails because you have a Rails app and sponsored someone who contributed a PR to the project.</p><p>It’s confusing because of how the projects are named, and Ruby Central are taking advantage of that confusion.</p><p>The reality is Ruby Central never owned the Ruby Gems source code. They could only take it because Marty was added by HSBT without the consent of other maintainers.</p><p>An important piece of context is that André and Samuel started a new cooperative with Kasper Timm Hansen and Sam Stephenson called <a href=\"https://spinel.coop\">Spinel</a>.</p><p>Spinel is developing a new Ruby management tool called . It was <a href=\"https://andre.arko.net/2025/08/25/rv-a-new-kind-of-ruby-management-tool/\">introduced</a> on 25 August 2025, right before Rails World.</p><p>In his blog post, André says, “For the last ten years or so of working on Bundler, I’ve had a wish rattling around: I want a better dependency manager. It doesn’t just manage your gems, it manages your ruby versions, too. It doesn’t just manage your ruby versions, it installs pre-compiled rubies so you don’t have to wait for ruby to compile from source every time. And more than all of that, it makes it completely trivial to run any script or tool written in ruby, even if that script or tool needs a different ruby than your application does.”</p><p><a href=\"https://bsky.app/profile/rmfranca.bsky.social/post/3lz7alpobhc2x\">Bluesky threads</a> reveal that Rafael França (Shopify / Rails Core) saw this tool as a threat, saying “some of the “admins” even announced publicly many days ago they were launching a competitor tool [rv] and were funding raising for it. I’d not trust the system to such “admin”.”</p><p>He also quoted the  README which says, “Get rid of rvm, rbenv, chruby, asdf, mise, ruby-build, ruby-install, bundler, and rubygems, all at once”, adding the caption “I’m not so sure I trust them to not sabotage rubygems or bundler.”</p><ol><li>I don’t know how each member voted or exactly how the information was presented to the board. I was hoping that someone would leak it to me, but so far that has not happened.</li><li>I don’t know if other groups or companies were involved, though circumstantial evidence and hearsay seems to point to this.</li></ol><p>It is not clear that Ruby Central’s plans include returning control of the RubyGems codebases to their original owners.</p><p>I am concerned that Ruby Central seems to be vulnerable to coercion by Shopify.</p><p>I am concerned that Ruby Central’s board with full knowledge of the consequences and the alternatives voted to take over a collection of open source projects from their maintainers without consent. Especially when these maintainers were acting in good faith at the time. This is the organisation we are meant to trust to host our Ruby gems.</p><p>I am concerned that Rails Core seems to consider  a “threat” rather than an exciting development, and I wonder if the “threat” is more Spinel than . It seems likely that Spinel would be less susceptible to enterprise coercion and could offer a genuine alternative to RubyCentral’s RubyGems Service.</p><p>I was employed by Shopify between 2017 and 2022.</p><p>I have put this story together to the best of my ability based on hours of conversations with many different people involved. But I am not a professional journalist and I may have missed something. If I have made a mistake, please <a href=\"https://joel.drapper.me/cdn-cgi/l/email-protection#f09a9f959cb094829180809582de9d95\">let me know</a>.</p><p>I am willing to talk to anyone involved to make sure the community has a fair and honest understanding of the events that took place.</p><ul><li>Removed a couple of names listed as being in attendance at Rails World. On reflection I did not feel they were relevant.</li><li>Added a quote from DHH about WordPress.</li></ul><ul><li>Changed how I refer to “the RubyGems.org Service”. Previously I said “the RubyGems Service”.</li></ul>","contentLength":18725,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45348390"},{"title":"Libghostty is coming","url":"https://mitchellh.com/writing/libghostty-is-coming","date":1758635788,"author":"kingori","guid":86775,"unread":true,"content":"<p>Over two years ago, in <a href=\"https://mitchellh.com/writing/ghostty-and-useful-zig-patterns\">one of my first public talks about Ghostty</a>,\nI shared my vision for : an embeddable library for any application\nto embed their own fully functional, modern, and fast terminal emulator.\nLibghostty is finally starting to take shape, and I'm excited to share\nmore details about my plans for it.</p><p>The first libghostty library will be : a zero-dependency\nlibrary that provides an API for parsing terminal sequences and\nmaintaining terminal state, extracted directly from Ghostty's real-world proven\ncore. It doesn't even require libc!</p><div><div><p>: This post is predominantly a roadmap update for libghostty and announcing what\nwill be the first shippable component of it. The Zig API is available for testing now, but the C\nAPI is not ready and will be coming very shortly. In both cases, it is early testing quality and\nnot ready for general usage.</p></div></div><p>Let's start with some background on why I believe libghostty must exist.</p><p>There are hundreds of programs that implement some form of terminal emulation.\nThe most obvious are the actual general purpose terminal emulators like\nGhostty, Kitty, iTerm2, etc. But terminal multiplexers like\n<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/tmux/tmux\">tmux</a> or <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://zellij.dev/\">zellij</a> are\nalso full terminal emulators! Editors embed their own terminal\nemulators too, such as <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/JetBrains/jediterm\">jediterm</a> for\nJetBrains products, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://xtermjs.org/\">Xterm.js</a> for VS Code,\nor <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/zed-industries/zed/blob/a0514af58955a21401b4c10918a45c9c241a4a74/Cargo.toml#L444\">Alacritty</a>\nin Zed.</p><p>In addition to fully functional terminal emulators, many websites and applications\nimplement read-only terminal emulation to display logs or command output.\nFor example, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.blog/news-insights/product-news/a-better-logs-experience-with-github-actions/#opening-the-door-to-a-more-colorful-experience\">GitHub Actions output</a>\nparses simple color sequences (but not much else). And hosting providers\nlike Vercel or Render implement a simple form of terminal emulation\nallowing line clearing and redrawing within build logs as well as\nparsing colors.</p><p>Many of these implementations are ad-hoc, one-off solutions. They aren't\nusing any shared library or codebase. Terminal emulation is a classic\nproblem that appears simple on the surface but is riddled with unexpected\ncomplexities and edge cases. As a result, most of these implementations\nare incomplete, buggy, and slow.</p><p>Beyond correctness, implementing any form of terminal emulation is a\n for most developers. Terminal emulation is not the core\nbusiness of JetBrains, Visual Studio Code, GitHub, Vercel, Render, etc.\nIt'd benefit them if they could have a stable, reusable solution\nthat's consistent everywhere.</p><p>My answer to this is libghostty: a cross-platform, minimal dependency\nlibrary that exposes a C API so feature-rich, correct, and fast terminal\nfunctionality can be embedded by any application anywhere.</p><h2><a href=\"https://mitchellh.com/writing/libghostty-is-coming#the-beginning-libghostty-vt\" aria-hidden=\"true\" tabindex=\"-1\"></a>The Beginning: </h2><p>The first libghostty library will be : a zero-dependency\n(not even libc) library that provides an API for parsing terminal sequences\nand maintaining terminal state such as cursor position, current styles,\ntext wrapping, and more.</p><p>Parsing terminal sequences is the most core functionality of a terminal\nemulator, and is required by full terminal emulators like Ghostty down to\nsimple read-only style-only views such as GitHub Actions or Vercel build output.</p><p>The <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://vt100.net/emu/dec_ansi_parser\">state diagram</a> might\nappear relatively simple at first glance, but an implementation\nis unexpectedly challenging to get right. For example,\n<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/JetBrains/jediterm/pull/311\">Jediterm doesn't handle intermediates correctly</a>,\ncausing the widely supported \"change cursor shape\" sequence to swallow\na character in every JetBrains editor at the time of this post.</p><p>For style-only parsing, many developers skip the full state diagram. Instead,\nthey do some light web searching, parse simple\nANSI sequences such as  or , and claim \"color support.\"\nBut style-only sequences are vastly more complex than that, for example they\nsupport RGB which itself can be in <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/ghostty-org/ghostty/blob/8cb52323e5575877eef44029c153eda006cece80/src/terminal/color.zig#L400-L438\">a dozen formats</a>.\nAnd I still haven't found a single web console that renders\n<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/ghostty-org/ghostty/blob/8cb52323e5575877eef44029c153eda006cece80/src/terminal/Parser.zig#L672-L722\">this complex style sequence</a>\ncorrectly.</p><p> aims to fix all of this.</p><p> is extracted from Ghostty and inherits all of the real world\nbenefits: SIMD-optimized parsing, very good Unicode support, highly optimized\nmemory usage, a robust fuzzed and Valgrind-tested codebase, excellent feature\ncompatibility such as parsing Kitty Graphics Protocol or Tmux Control Mode, and more.</p><p>All of this is packaged up into a single zero-dependency C API (it doesn't\neven rely on libc), allowing it to be easily embedded into any popular\nlanguage ecosystem.</p><p>Given the minimal footprint,  will be \nInitial targets will be macOS and Linux for both  and \narchitectures, since those are the primary targets for Ghostty the\napplication. But I plan to expand support to additional targets such as Windows,\nembedded devices, and the web via WASM.  will have broader\nsupport than Ghostty the GUI, due to its tighter scope.</p><p> is just the beginning. Longer term, we will provide more\n libs that expose additional functionality such as input\nhandling (keyboard encoding is a big one), GPU rendering (provide us with\nan OpenGL or Metal surface and we'll take care of the rest), GTK widgets\nand Swift frameworks that handle the entire terminal view, and more.</p><p>As fundamental pieces stabilize, we will continue to offer more and more\nfunctionality. These will be structured as a family of libraries to minimize\ndependency requirements, code size, and overall maintenance complexity.</p><p>I just merged the pull request\n<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/ghostty-org/ghostty/pull/8840\">exposing  as a Zig module</a>.\nThis PR includes a minimal example program, too. If you're a Zig developer,\nyou can start experimenting with  immediately.</p><p>The C API isn't ready yet, but it is what I'm working on  and\nit'll be available for testing soon. All of the work required is defining the\nC API, since the core logic is of course all there and has been used by Ghostty\nfor years. Plus, the Ghostty macOS app already consumes an\n<a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/ghostty-org/ghostty/blob/main/include/ghostty.h\">internal-only C API</a>.</p><div><div><p>If you look at the internal-only C header, please ignore the mess. It isn't a  C API. It is\ninternal-only and exists to satisfy the needs of the macOS application. This isn't a generally\nconsumable libghostty, although it is used by <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://orbstack.dev/\">real commercial products\nalready</a> to embed Ghostty. We'll take a clean slate approach defining the C\nAPI for wider usage.</p></div></div><p>I plan to version  separately from Ghostty the application.\nThis blog post marks the public alpha (not promising API stability)\nand I'm hoping to motivate some developers to come use it and eventually\nwrite some language bindings once the C API is ready.</p><p>I hope to ship a tagged version of  within the next 6 months,\nbut it'll all depend on if its ready or not.</p><p>We're at the critical stage of libghostty where we're designing the API,\nand the best way to design an API is with feedback from real consumers.\nGhostty is one consumer, we have some community members working on other\nlibghostty-consuming projects, but we could use as many as we can get!</p><p>If you see a use case in your projects or organization for libghostty,\nplease <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://discord.gg/ghostty\">join the Ghostty Discord</a> and collaborate\nwith the developers working on this. If you don't want to join Discord,\nemail me (email in the footer of this website).</p><p>The state of  at this stage could be considered ,\nso don't expect a polished, stable experience. We're looking for hackers\nthat want to get on the ground early.</p><div><div><p>The \"alpha\" quality is with respect to the API (functions and types) itself. The core logic is\nshared with Ghostty and is extremely stable and proven in the real world.</p></div></div><p>I'm super excited that Ghostty the application has finally reached the\nstability where we can start moving towards the  goal.\n is the next frontier for Ghostty and I think it has the\nability to make a far larger impact than Ghostty can as a standalone\napplication itself.</p><p>Don't worry, there's plenty of changes for Ghostty the application\nand none of this diminishes my excitement or plans for that. Wider\nusage of  will result in a more feature rich and stable\nGhostty application, too, since Ghostty itself is a consumer of\n.</p>","contentLength":7719,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45347117"},{"title":"Delete FROM users WHERE location = 'Iran';","url":"https://gist.github.com/avestura/ce2aa6e55dad783b1aba946161d5fef4","date":1758605428,"author":"avestura","guid":86514,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45343108"},{"title":"Nine things I learned in ninety years","url":"http://edwardpackard.com/wp-content/uploads/2025/09/Nine-Things-I-Learned-in-Ninety-Years.pdf","date":1758596586,"author":"coderintherye","guid":86765,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45342364"},{"title":"Qwen3-Omni: Native Omni AI model for text, image and video","url":"https://github.com/QwenLM/Qwen3-Omni","date":1758563421,"author":"meetpateltech","guid":86479,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45336989"},{"title":"Cap'n Web: a new RPC system for browsers and web servers","url":"https://blog.cloudflare.com/capnweb-javascript-rpc-library/","date":1758546332,"author":"jgrahamc","guid":86406,"unread":true,"content":"<p>Allow us to introduce <a href=\"https://github.com/cloudflare/capnweb\"></a>, an RPC protocol and implementation in pure TypeScript.</p><p>Cap'n Web is a spiritual sibling to <a href=\"https://capnproto.org/\"></a>, an RPC protocol I (Kenton) created a decade ago, but designed to play nice in the web stack. That means:</p><ul><li><p>Like Cap'n Proto, it is an object-capability protocol. (\"Cap'n\" is short for \"capabilities and\".) We'll get into this more below, but it's incredibly powerful.</p></li><li><p>That said, it integrates nicely with TypeScript.</p></li><li><p>Also unlike Cap'n Proto, Cap'n Web's underlying serialization is human-readable. In fact, it's just JSON, with a little pre-/post-processing.</p></li><li><p>It works over HTTP, WebSocket, and postMessage() out-of-the-box, with the ability to extend it to other transports easily.</p></li><li><p>It works in all major browsers, Cloudflare Workers, Node.js, and other modern JavaScript runtimes.</p></li><li><p>The whole thing compresses (minify+gzip) to under 10&nbsp;kB with no dependencies.</p></li></ul><p>Cap'n Web is more expressive than almost every other RPC system, because it implements an <b>object-capability RPC model</b>. That means it:</p><ul><li><p>Supports bidirectional calling. The client can call the server, and the server can also call the client.</p></li><li><p>Supports passing functions by reference: If you pass a function over RPC, the recipient receives a \"stub\". When they call the stub, they actually make an RPC back to you, invoking the function where it was created. This is how bidirectional calling happens: the client passes a callback to the server, and then the server can call it later.</p></li><li><p>Similarly, supports passing objects by reference: If a class extends the special marker type , then instances of that class are passed by reference, with method calls calling back to the location where the object was created.</p></li><li><p>Supports promise pipelining. When you start an RPC, you get back a promise. Instead of awaiting it, you can immediately use the promise in dependent RPCs, thus performing a chain of calls in a single network round trip.</p></li><li><p>Supports capability-based security patterns.</p></li></ul><p>In short, Cap'n Web lets you design RPC interfaces the way you'd design regular JavaScript APIs – while still acknowledging and compensating for network latency.</p><p>The best part is, Cap'n Web is absolutely trivial to set up.</p><p>A client looks like this:</p><pre><code>import { newWebSocketRpcSession } from \"capnweb\";\n\n// One-line setup.\nlet api = newWebSocketRpcSession(\"wss://example.com/api\");\n\n// Call a method on the server!\nlet result = await api.hello(\"World\");\n\nconsole.log(result);\n</code></pre><p>And here's a complete Cloudflare Worker implementing an RPC server:</p><pre><code>import { RpcTarget, newWorkersRpcResponse } from \"capnweb\";\n\n// This is the server implementation.\nclass MyApiServer extends RpcTarget {\n  hello(name) {\n    return `Hello, ${name}!`\n  }\n}\n\n// Standard Workers HTTP handler.\nexport default {\n  fetch(request, env, ctx) {\n    // Parse URL for routing.\n    let url = new URL(request.url);\n\n    // Serve API at `/api`.\n    if (url.pathname === \"/api\") {\n      return newWorkersRpcResponse(request, new MyApiServer());\n    }\n\n    // You could serve other endpoints here...\n    return new Response(\"Not found\", {status: 404});\n  }\n}\n</code></pre><p>That's it. That's the app.</p><ul><li><p>You can add more methods to , and call them from the client.</p></li><li><p>You can have the client pass a callback function to the server, and then the server can just call it.</p></li><li><p>You can define a TypeScript interface for your API, and easily apply it to the client and server.</p></li></ul><div><h3>Why RPC? (And what is RPC anyway?)</h3><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#why-rpc-and-what-is-rpc-anyway\" aria-hidden=\"true\"></a></div><p>Remote Procedure Calls (RPC) are a way of expressing communications between two programs over a network. Without RPC, you might communicate using a protocol like HTTP. With HTTP, though, you must format and parse your communications as an HTTP request and response, perhaps designed in <a href=\"https://en.wikipedia.org/wiki/REST\"></a> style. RPC systems try to make communications look like a regular function call instead, as if you were calling a library rather than a remote service. The RPC system provides a \"stub\" object on the client side which stands in for the real server-side object. When a method is called on the stub, the RPC system figures out how to serialize and transmit the parameters to the server, invoke the method on the server, and then transmit the return value back.</p><p>But this reputation is outdated. When RPC was first invented some 40 years ago, async programming barely existed. We did not have Promises, much less async and await. Early RPC was synchronous: calls would block the calling thread waiting for a reply. At best, latency made the program slow. At worst, network failures would hang or crash the program. No wonder it was deemed \"broken\".</p><p>Things are different today. We have Promise and async and await, and we can throw exceptions on network failures. We even understand how RPCs can be pipelined so that a chain of calls takes only one network round trip. Many large distributed systems you likely use every day are built on RPC. It works.</p><p>The fact is, RPC fits the programming model we're used to. Every programmer is trained to think in terms of APIs composed of function calls, not in terms of byte stream protocols nor even REST. Using RPC frees you from the need to constantly translate between mental models, allowing you to move faster.</p><div><h3>When should you use Cap'n Web?</h3><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#when-should-you-use-capn-web\" aria-hidden=\"true\"></a></div><p>Cap'n Web is useful anywhere where you have two JavaScript applications speaking to each other over a network, including client-to-server and microservice-to-microservice scenarios. However, it is particularly well-suited to interactive web applications with real-time collaborative features, as well as modeling interactions over complex security boundaries.</p><p>Cap'n Web is still new and experimental, so for now, a willingness to live on the cutting edge may also be required!</p><div><h2>Features, features, features…</h2><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#features-features-features\" aria-hidden=\"true\"></a></div><p>Here's some more things you can do with Cap'n Web.</p><p>Sometimes a WebSocket connection is a bit too heavyweight. What if you just want to make a quick one-time batch of calls, but don't need an ongoing connection?</p><p>For that, Cap'n Web supports HTTP batch mode:</p><pre><code>import { newHttpBatchRpcSession } from \"capnweb\";\n\nlet batch = newHttpBatchRpcSession(\"https://example.com/api\");\n\nlet result = await batch.hello(\"World\");\n\nconsole.log(result);\n</code></pre><p><i>(The server is exactly the same as before.)</i></p><p>Note that once you've awaited an RPC in the batch, the batch is done, and all the remote references received through it become broken. To make more calls, you need to start over with a new batch. However, you can make multiple calls in a single batch:</p><pre><code>let batch = newHttpBatchRpcSession(\"https://example.com/api\");\n\n// We can call make multiple calls, as long as we await them all at once.\nlet promise1 = batch.hello(\"Alice\");\nlet promise2 = batch.hello(\"Bob\");\n\nlet [result1, result2] = await Promise.all([promise1, promise2]);\n\nconsole.log(result1);\nconsole.log(result2);\n</code></pre><p>And that brings us to another feature…</p><div><h3>Chained calls (Promise Pipelining)</h3><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#chained-calls-promise-pipelining\" aria-hidden=\"true\"></a></div><p>Here's where things get magical.</p><p>In both batch mode and WebSocket mode, you can make a call that depends on the result of another call, without waiting for the first call to finish. In batch mode, that means you can, in a single batch, call a method, then use its result in another call. The entire batch still requires only one network round trip.</p><p>For example, say your API is:</p><pre><code>class MyApiServer extends RpcTarget {\n  getMyName() {\n    return \"Alice\";\n  }\n\n  hello(name) {\n    return `Hello, ${name}!`\n  }\n}\n</code></pre><pre><code>let namePromise = batch.getMyName();\nlet result = await batch.hello(namePromise);\n\nconsole.log(result);\n</code></pre><p>Notice the initial call to  returned a promise, but we used the promise itself as the input to , without awaiting it first. With Cap'n Web, this just works: The client sends a message to the server saying: \"Please insert the result of the first call into the parameters of the second.\"</p><p>Or perhaps the first call returns an object with methods. You can call the methods immediately, without awaiting the first promise, like:</p><pre><code>let batch = newHttpBatchRpcSession(\"https://example.com/api\");\n\n// Authencitate the API key, returning a Session object.\nlet sessionPromise = batch.authenticate(apiKey);\n\n// Get the user's name.\nlet name = await sessionPromise.whoami();\n\nconsole.log(name);\n</code></pre><p>This works because the promise returned by a Cap'n Web call is not a regular promise. Instead, it's a JavaScript Proxy object. Any methods you call on it are interpreted as speculative method calls on the eventual result. These calls are sent to the server immediately, telling the server: \"When you finish the call I sent earlier, call this method on what it returns.\"</p><div><h3>Did you spot the security?</h3><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#did-you-spot-the-security\" aria-hidden=\"true\"></a></div><p>This last example shows an important security pattern enabled by Cap'n Web's object-capability model.</p><p>When we call the authenticate() method, after it has verified the provided API key, it returns an authenticated session object. The client can then make further RPCs on the session object to perform operations that require authorization as that user. The server code might look like this:</p><pre><code>class MyApiServer extends RpcTarget {\n  authenticate(apiKey) {\n    let username = await checkApiKey(apiKey);\n    return new AuthenticatedSession(username);\n  }\n}\n\nclass AuthenticatedSession extends RpcTarget {\n  constructor(username) {\n    super();\n    this.username = username;\n  }\n\n  whoami() {\n    return this.username;\n  }\n\n  // ...other methods requiring auth...\n}\n</code></pre><p>Here's what makes this work: <b>It is impossible for the client to \"forge\" a session object. The only way to get one is to call authenticate(), and have it return successfully.</b></p><p>In most RPC systems, it is not possible for one RPC to return a stub pointing at a new RPC object in this way. Instead, all functions are top-level, and can be called by anyone. In such a traditional RPC system, it would be necessary to pass the API key again to every function call, and check it again on the server each time. Or, you'd need to do authorization outside the RPC system entirely.</p><p>This is a common pain point for WebSockets in particular. Due to the design of the web APIs for WebSocket, you generally cannot use headers nor cookies to authorize them. Instead, authorization must happen in-band, by sending a message over the WebSocket itself. But this can be annoying for RPC protocols, as it means the authentication message is \"special\" and changes the state of the connection itself, affecting later calls. This breaks the abstraction.</p><p>The authenticate() pattern shown above neatly makes authentication fit naturally into the RPC abstraction. It's even type-safe: you can't possibly forget to authenticate before calling a method requiring auth, because you wouldn't have an object on which to make the call. Speaking of type-safety…</p><p>If you use TypeScript, Cap'n Web plays nicely with it. You can declare your RPC API once as a TypeScript interface, implement in on the server, and call it on the client:</p><pre><code>// Shared interface declaration:\ninterface MyApi {\n  hello(name: string): Promise&lt;string&gt;;\n}\n\n// On the client:\nlet api: RpcStub&lt;MyApi&gt; = newWebSocketRpcSession(\"wss://example.com/api\");\n\n// On the server:\nclass MyApiServer extends RpcTarget implements MyApi {\n  hello(name) {\n    return `Hello, ${name}!`\n  }\n}\n</code></pre><p>Now you get end-to-end type checking, auto-completed method names, and so on.</p><p>Note that, as always with TypeScript, no type checks occur at runtime. The RPC system itself does not prevent a malicious client from calling an RPC with parameters of the wrong type. This is, of course, not a problem unique to Cap'n Web – JSON-based APIs have always had this problem. You may wish to use a runtime type-checking system like Zod to solve this. (Meanwhile, we hope to add type checking based directly on TypeScript types in the future.)</p><div><h2>An alternative to GraphQL?</h2><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#an-alternative-to-graphql\" aria-hidden=\"true\"></a></div><p>If you’ve used GraphQL before, you might notice some similarities. One benefit of GraphQL was to solve the “waterfall” problem of traditional REST APIs by allowing clients to ask for multiple pieces of data in one query. For example, instead of making three sequential HTTP calls:</p><pre><code>GET /user\nGET /user/friends\nGET /user/friends/photos</code></pre><p>…you can write one GraphQL query to fetch it all at once.</p><p>That’s a big improvement over REST, but GraphQL comes with its own tradeoffs:</p><ul><li><p><b>New language and tooling.</b> You have to adopt GraphQL’s schema language, servers, and client libraries. If your team is all-in on JavaScript, that’s a lot of extra machinery.</p></li><li><p> GraphQL queries are declarative, which makes them great for fetching data, but awkward for chaining operations or mutations. For example, you can’t easily say: “create a user, then immediately use that new user object to make a friend request, all-in-one round trip.”</p></li><li><p><b>Different abstraction model.</b> GraphQL doesn’t look or feel like the JavaScript APIs you already know. You’re learning a new mental model rather than extending the one you use every day.</p></li></ul><div><h3>How Cap'n Web goes further</h3><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#how-capn-web-goes-further\" aria-hidden=\"true\"></a></div><p>Cap'n Web solves the waterfall problem  introducing a new language or ecosystem. It’s just JavaScript. Because Cap'n Web supports promise pipelining and object references, you can write code that looks like this:</p><pre><code>let user = api.createUser({ name: \"Alice\" });\nlet friendRequest = await user.sendFriendRequest(\"Bob\");</code></pre><p>What happens under the hood? Both calls are pipelined into a single network round trip:</p><ol><li><p>Take the result of that call (a new User object).</p></li><li><p>Immediately invoke sendFriendRequest() on that object.</p></li></ol><p>All of this is expressed naturally in JavaScript, with no schemas, query languages, or special tooling required. You just call methods and pass objects around, like you would in any other JavaScript code.</p><p>In other words, GraphQL gave us a way to flatten REST’s waterfalls. Cap'n Web lets us go even further: it gives you the power to model complex interactions exactly the way you would in a normal program, with no impedance mismatch.</p><div><h3>But how do we solve arrays?</h3><a href=\"https://blog.cloudflare.com/capnweb-javascript-rpc-library/#but-how-do-we-solve-arrays\" aria-hidden=\"true\"></a></div><p>With everything we've presented so far, there's a critical missing piece to seriously consider Cap'n Web as an alternative to GraphQL: handling lists. Often, GraphQL is used to say: \"Perform this query, and then, for every result, perform this other query.\" For example: \"List the user's friends, and then for each one, fetch their profile photo.\"</p><p>In short, we need an  operation that can be performed without adding a round trip.</p><p>Cap'n Proto, historically, has never supported such a thing.</p><p>But with Cap'n Web, we've solved it. You can do:</p><pre><code>let user = api.authenticate(token);\n\n// Get the user's list of friends (an array).\nlet friendsPromise = user.listFriends();\n\n// Do a .map() to annotate each friend record with their photo.\n// This operates on the *promise* for the friends list, so does not\n// add a round trip.\n// (wait WHAT!?!?)\nlet friendsWithPhotos = friendsPromise.map(friend =&gt; {\n  return {friend, photo: api.getUserPhoto(friend.id))};\n}\n\n// Await the friends list with attached photos -- one round trip!\nlet results = await friendsWithPhotos;\n</code></pre><p> takes a callback function, which needs to be applied to each element in the array. As we described earlier,  when you pass a function to an RPC, the function is passed \"by reference\", meaning that the remote side receives a stub, where calling that stub makes an RPC back to the client where the function was created.</p><p>But that is NOT what is happening here. That would defeat the purpose: we don't want the server to have to round-trip to the client to process every member of the array. We want the server to just apply the transformation server-side.</p><p>To that end, is special. It does not send JavaScript code to the server, but it does send something like \"code\", restricted to a domain-specific, non-Turing-complete language. The \"code\" is a list of instructions that the server should carry out for each member of the array. In this case, the instructions are:</p><ol><li><p>Invoke <code>api.getUserPhoto(friend.id)</code>.</p></li><li><p>Return an object , where friend is the original array element and photo is the result of step 1.</p></li></ol><p>But the application code just specified a JavaScript method. How on Earth could we convert this into the narrow DSL?</p><p>The answer is record-replay: On the client side, we execute the callback once, passing in a special placeholder value. The parameter behaves like an RPC promise. However, the callback is required to be synchronous, so it cannot actually await this promise. The only thing it can do is use promise pipelining to make pipelined calls. These calls are intercepted by the implementation and recorded as instructions, which can then be sent to the server, where they can be replayed as needed.</p><p>And because the recording is based on promise pipelining, which is what the RPC protocol itself is designed to represent, it turns out that the \"DSL\" used to represent \"instructions\" for the map function is <i>just the RPC protocol itself</i>. 🤯</p><p>Cap'n Web's underlying protocol is based on JSON – but with a preprocessing step to handle special types. Arrays are treated as \"escape sequences\" that let us encode other values. For example, JSON does not have an encoding for  objects, but Cap'n Web does. You might see a message that looks like this:</p><pre><code>{\n  event: \"Birthday Week\",\n  timestamp: [\"date\", 1758499200000]\n}\n</code></pre><p>To encode a literal array, we simply double-wrap it in :</p><pre><code>{\n  names: [[\"Alice\", \"Bob\", \"Carol\"]]\n}\n</code></pre><p>In other words, an array with just one element which is itself an array, evaluates to the inner array literally. An array whose first element is a type name, evaluates to an instance of that type, where the remaining elements are parameters to the type.</p><p>On top of this basic encoding, we define an RPC protocol inspired by Cap'n Proto – but greatly simplified.</p><p>Since Cap'n Web is a symmetric protocol, there is no well-defined \"client\" or \"server\" at the protocol level. There are just two parties exchanging messages across a connection. Every kind of interaction can happen in either direction.</p><p>In order to make it easier to describe these interactions, I will refer to the two parties as \"Alice\" and \"Bob\".</p><p>Alice and Bob start the connection by establishing some sort of bidirectional message stream. This may be a WebSocket, but Cap'n Web also allows applications to define their own transports. Each message in the stream is JSON-encoded, as described earlier.</p><p>Alice and Bob each maintain some state about the connection. In particular, each maintains an \"export table\", describing all the pass-by-reference objects they have exposed to the other side, and an \"import table\", describing the references they have received. Alice's exports correspond to Bob's imports, and vice versa. Each entry in the export table has a signed integer ID, which is used to reference it. You can think of these IDs like file descriptors in a POSIX system. Unlike file descriptors, though, IDs can be negative, and an ID is never reused over the lifetime of a connection.</p><p>At the start of the connection, Alice and Bob each populate their export tables with a single entry, numbered zero, representing their \"main\" interfaces. Typically, when one side is acting as the \"server\", they will export their main public RPC interface as ID zero, whereas the \"client\" will export an empty interface. However, this is up to the application: either side can export whatever they want.</p><p>From there, new exports are added in two ways:</p><ul><li><p>When Alice sends a message to Bob that contains within it an object or function reference, Alice adds the target object to her export table. IDs assigned in this case are always negative, starting from -1 and counting downwards.</p></li><li><p>Alice can send a \"push\" message to Bob to request that Bob add a value to his export table. The \"push\" message contains an expression which Bob evaluates, exporting the result. Usually, the expression describes a method call on one of Bob's existing exports – this is how an RPC is made. Each \"push\" is assigned a positive ID on the export table, starting from 1 and counting upwards. Since positive IDs are only assigned as a result of pushes, Alice can predict the ID of each push she makes, and can immediately use that ID in subsequent messages. This is how promise pipelining is achieved.</p></li></ul><p>After sending a push message, Alice can subsequently send a \"pull\" message, which tells Bob that once he is done evaluating the \"push\", he should proactively serialize the result and send it back to Alice, as a \"resolve\" (or \"reject\") message. However, this is optional: Alice may not actually care to receive the return value of an RPC, if Alice only wants to use it in promise pipelining. In fact, the Cap'n Web implementation will only send a \"pull\" message if the application has actually awaited the returned promise.</p><p>Putting it together, a code sequence like this:</p><pre><code>let namePromise = api.getMyName();\nlet result = await api.hello(namePromise);\n\nconsole.log(result);</code></pre><p>Might produce a message exchange like this:</p><pre><code>// Call api.getByName(). `api` is the server's main export, so has export ID 0.\n-&gt; [\"push\", [\"pipeline\", 0, \"getMyName\", []]\n// Call api.hello(namePromise). `namePromise` refers to the result of the first push,\n// so has ID 1.\n-&gt; [\"push\", [\"pipeline\", 0, \"hello\", [[\"pipeline\", 1]]]]\n// Ask that the result of the second push be proactively serialized and returned.\n-&gt; [\"pull\", 2]\n// Server responds.\n&lt;- [\"resolve\", 2, \"Hello, Alice!\"]</code></pre><p>Cap'n Web is new and still highly experimental. There may be bugs to shake out. But, we're already using it today. Cap'n Web is the basis of <a href=\"https://developers.cloudflare.com/changelog/2025-09-16-remote-bindings-ga/\"><u>the recently-launched \"remote bindings\" feature in Wrangler</u></a>, allowing a local test instance of workerd to speak RPC to services in production. We've also begun to experiment with it in various frontend applications – expect more blog posts on this in the future.</p><p>In any case, Cap'n Web is open source, and you can start using it in your own projects now.</p>","contentLength":21499,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45332883"},{"title":"Cloudflare is sponsoring Ladybird and Omarchy","url":"https://blog.cloudflare.com/supporting-the-future-of-the-open-web/","date":1758546213,"author":"jgrahamc","guid":86160,"unread":true,"content":"<p>At Cloudflare, we believe that helping build a better Internet means encouraging a healthy ecosystem of options for how people can connect safely and quickly to the resources they need. Sometimes that means we tackle immense, Internet-scale problems with established partners. And sometimes that means we support and partner with fantastic open teams taking big bets on the next generation of tools.</p><p>To that end, today we are excited to announce our support of two independent, open source projects: <a href=\"https://ladybird.org/\"></a>, an ambitious project to build a completely independent browser from the ground up, and <a href=\"https://omarchy.org/\"></a>, an opinionated Arch Linux setup for developers.&nbsp;</p><div><h2>Two open source projects strengthening the open Internet&nbsp;</h2><a href=\"https://blog.cloudflare.com/supporting-the-future-of-the-open-web/#two-open-source-projects-strengthening-the-open-internet\" aria-hidden=\"true\"></a></div><p>Cloudflare has a long history of supporting open-source software – both through <a href=\"https://blog.cloudflare.com/tag/open-source/\"><u>our own projects shared with the community</u></a> and <a href=\"https://developers.cloudflare.com/sponsorships/\"></a> projects that we support. We see our sponsorship of Ladybird and Omarchy as a natural extension of these efforts in a moment where energy for a diverse ecosystem is needed more than ever.&nbsp;&nbsp;</p><div><h3>Ladybird, a new and independent browser&nbsp;</h3><a href=\"https://blog.cloudflare.com/supporting-the-future-of-the-open-web/#ladybird-a-new-and-independent-browser\" aria-hidden=\"true\"></a></div><p>Most of us spend a significant amount of time using a web browser –&nbsp; in fact, you’re probably using one to read this blog! The beauty of browsers is that they help users experience the open Internet, giving you access to everything from the largest news publications in the world to a tiny website hosted on a Raspberry Pi.&nbsp;&nbsp;</p><p>Unlike dedicated apps, browsers reduce the barriers to building an audience for new services and communities on the Internet. If you are launching something new, you can offer it through a browser in a world where most people have absolutely zero desire to install an app just to try something out. Browsers help encourage competition and new ideas on the open web.</p><p>While the openness of how browsers work has led to an explosive growth of services on the Internet, browsers themselves have consolidated to a tiny handful of viable options. There’s a high probability you’re reading this on a Chromium-based browser, like Google’s Chrome, along with about <a href=\"https://radar.cloudflare.com/reports/browser-market-share-2025-q2\"><u>65% of users on the Internet.</u></a> However, that consolidation has also scared off new entrants in the space. If all browsers ship on the same operating systems, powered by the same underlying technology, we lose out on potential privacy, security and performance innovations that could benefit developers and everyday Internet users.&nbsp;</p><p><sup><i>A screenshot of Cloudflare Workers developer docs in Ladybird&nbsp;</i></sup></p><p>This is where Ladybird comes in: it’s not Chromium based – everything is built from scratch. The Ladybird project has two main components: LibWeb, a brand-new rendering engine, and LibJS, a brand-new JavaScript engine with its own parser, interpreter, and bytecode execution engine.&nbsp;</p><p>Building an engine that can correctly and securely render the modern web is a monumental task that requires deep technical expertise and navigating decades of specifications governed by standards bodies like the W3C and WHATWG. And because Ladybird implements these standards directly, it also stress-tests them in practice. Along the way, the project has found, reported, and sometimes fixed countless issues in the specifications themselves, contributions that strengthen the entire web platform for developers, browser vendors, and anyone who may attempt to build a browser in the future.</p><p>Whether to build something from scratch or not is a perennial source of debate between software engineers, but absent the pressures of revenue or special interests, we’re excited about the ways Ladybird will prioritize privacy, performance, and security, potentially in novel ways that will influence the entire ecosystem.</p><p><sup><i>A screenshot of the Omarchy development environment</i></sup></p><div><h3>Omarchy, an independent development environment&nbsp;</h3><a href=\"https://blog.cloudflare.com/supporting-the-future-of-the-open-web/#omarchy-an-independent-development-environment\" aria-hidden=\"true\"></a></div><p>Developers deserve choice, too. Beyond the browser, a developer’s operating system and environment is where they spend a ton of time – and where a few big players have become the dominant choice. Omarchy challenges this by providing a complete, opinionated Arch Linux distribution that transforms a bare installation into a modern development workstation that developers are <a href=\"https://github.com/basecamp/omarchy\"></a>.</p><p>Perfecting one’s development environment can be a career-long art, but learning how to do so shouldn’t be a barrier to beginning to code. The beauty of Omarchy is that it makes Linux approachable to more developers by doing most of the setup for them, making it look good, and then making it configurable. Omarchy provides most of the tools developers need – like Neovim, Docker, and Git – out of the box, and <a href=\"https://learn.omacom.io/2/the-omarchy-manual\"></a>.</p><p>At its core, Omarchy embraces Linux for all of its complexity and configurability, and makes a version of it that is accessible and fun to use for developers that don’t have a deep background in operating systems. Projects like this ensure that a powerful, independent Linux desktop remains a compelling choice for people building the next generation of applications and Internet infrastructure.&nbsp;</p><div><a href=\"https://blog.cloudflare.com/supporting-the-future-of-the-open-web/#our-support-comes-with-no-strings-attached\" aria-hidden=\"true\"></a></div><p>We want to be very clear here: we are supporting these projects because we believe the Internet can be better if these projects, and more like them, succeed. No requirement to use our technology stack or any arrangement like that. We are happy to partner with great teams like Ladybird and Omarchy simply because we believe that our missions have real overlap.</p><p>Ladybird is still in its early days, with an alpha release planned for 2026, but we encourage anyone who is interested to consider contributing to the <a href=\"https://github.com/LadybirdBrowser/ladybird/tree/master\"></a> as they prepare for launch.</p><blockquote><p><i>\"Cloudflare knows what it means to build critical web infrastructure on the server side. With Ladybird, we’re tackling the near-monoculture on the client side, because we believe it needs multiple implementations to stay healthy, and we’re extremely thankful for their support in that mission.”</i></p><p>– , Founder, Ladybird&nbsp;&nbsp;</p></blockquote><p><a href=\"https://github.com/basecamp/omarchy/releases/tag/v3.0.0\"></a> was released just last week with faster installation and increased Macbook compatibility, so if you’ve been Linux-curious for a while now, we encourage you to try it out!</p><blockquote><p><i>\"Cloudflare's support of Omarchy has ensured we have the fastest ISO and package delivery from wherever you are in the world. Without a need to manually configure mirrors or deal with torrents. The combo of a super CDN, great R2 storage, and the best DDoS shield in the business has been a huge help for the project.\"</i></p><p>– , Creator of Omarchy and Ruby on Rails</p></blockquote><p>A better Internet is one where people have more choice in how they browse and develop new software. We’re incredibly excited about the potential of Ladybird, Omarchy, and other audacious projects that support a free and open Internet. </p>","contentLength":6582,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45332860"},{"title":"You did this with an AI and you do not understand what you're doing here","url":"https://hackerone.com/reports/3340109","date":1758527977,"author":"redbell","guid":86159,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45330378"},{"title":"How I, a non-developer, read the tutorial you, a developer, wrote for me","url":"https://anniemueller.com/posts/how-i-a-non-developer-read-the-tutorial-you-a-developer-wrote-for-me-a-beginner","date":1758504454,"author":"wonger_","guid":86158,"unread":true,"content":"<p>“Hello! I am a developer. Here is my relevant experience: I code in Hoobijag and sometimes jabbernocks and of course ABCDE++++ (but never ABCDE+/^+ are you kidding? ha!)&nbsp; and I like working with Shoobababoo and occasionally kleptomitrons. I’ve gotten to work for Company doing Shoobaboo-ing code things and that’s what led me to the Snarfus. So, let’s dive in!&nbsp;</p><p>I first started doing Very Simple Thing with Snarfus, but the more I used it the more I saw the potential! Despite the jaggle of the chromus, it’s really multi-purpose. And that’s what led me to argyling the pintafore with the quagmire instead of the hoobastank! I know, crazy. But it was kind of working, and actually a lot of fun… Until I hit a big roadblock: the fisterfunk will NOT talk to the shamrock portal or even send beep-boops back to the Snarfus! Of course, you know what that means&nbsp;— Now the entire hoob-tunnel is clogged with gramelions. Unacceptable.&nbsp;</p><p>I almost gave up but then I realized: If I connect the backside Snarfus stagnator to the backside shamrock Klingon troglodyte emulater, it’s good! Everything beep-boops and ding-dongs and I get the Actual Topic of the Tutorial, which lets me do the Very Simple Thing the way I want after all! Pretty cool.</p><p>So here’s how to set it up:&nbsp;</p><ol><li><p>In the terminal, ajkl;gawgor;iqeg;iJLkqen.&nbsp; wl;R aw;oeiga 4648664 arjarwgj;llj;ja fadgfgajkljl; wlj;sdjk;lfas</p></li><li><p>Next go to folder/hidden/deep/in/the/file/system/surprise!.file and copy the contents of the file. If it’s not there, it might be in library/library/library/llibrary/liiiiiibrarrrary/llllliiiiibrary/hidden/hidden/hiding/you can’t find me/hidden/nope/never/hahahahereiam.file.</p></li><li><p>Now go back to the terminal and paste in the file contents, then type in 64A786AGR45JAR; rdja;jg [[]][[]][[]][[]]][[]()()()()()()()()(){{}{}{}|{}{|}{}{|}{ ////////////////!! !!!! !! //// !!! agjlkargji;lwej;OI [ASRGASG[]ASGDASG[]EAEadgasg[]EAGE[edaga][]ahgr-0-0=-0-=0-=0=0-0=-0-=0=-0-=0=-0=-0!!!</p></li><li><p>Open Snarfus and upload the file you just made.&nbsp;</p></li><li><p>Just for shits and giggles, youcan de-sham the chronostatiomatrix by running —()()(]]asdg a=-do —cd go cd stay —sususudododo baby shark—][] but that’s optional.&nbsp;</p></li></ol><p>Let me know how it goes for you. I’d love to hear if anybody uses this approach with GewGawGamma or ometer2.7.”</p>","contentLength":2305,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45328247"},{"title":"Quicksort explained IKEA-style","url":"https://idea-instructions.com/quick-sort/","date":1758454521,"author":"foehrenwald","guid":87574,"unread":true,"content":"<p> is an efficient sorting algorithm based on a “divide and conquer” approach. Choosing the dividing element at random is a good strategy to avoid bad worst-case runtime.</p><ul><li>v1.1: Change title from  to  to make it sound even more Swedish</li><li>v1.2: Update the IDEA logo</li></ul><p>Initially published 2018-03-16.</p>","contentLength":292,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45321849"},{"title":"They Thought They Were Free (1955)","url":"https://press.uchicago.edu/Misc/Chicago/511928.html","date":1758452202,"author":"nataliste","guid":86157,"unread":true,"content":"<p>\"What no one seemed to notice,\" said a colleague of mine, a philologist, \"was the ever widening gap, after 1933, between the government and the people. Just think how very wide this gap was to begin with, here in Germany. And it became always wider. You know, it doesn’t make people close to their government to be told that this is a people’s government, a true democracy, or to be enrolled in civilian defense, or even to vote. All this has little, really nothing, to do with  one is governing.</p><p>\"What happened here was the gradual habituation of the people, little by little, to being governed by surprise; to receiving decisions deliberated in secret; to believing that the situation was so complicated that the government had to act on information which the people could not understand, or so dangerous that, even if the people could not understand it, it could not be released because of national security. And their sense of identification with Hitler, their trust in him, made it easier to widen this gap and reassured those who would otherwise have worried about it.</p><p>\"This separation of government from people, this widening of the gap, took place so gradually and so insensibly, each step disguised (perhaps not even intentionally) as a temporary emergency measure or associated with true patriotic allegiance or with real social purposes. And all the crises and reforms (real reforms, too) so occupied the people that they did not see the slow motion underneath, of the whole process of government growing remoter and remoter.</p><p>\"You will understand me when I say that my Middle High German was my life. It was all I cared about. I was a scholar, a specialist. Then, suddenly, I was plunged into all the new activity, as the university was drawn into the new situation; meetings, conferences, interviews, ceremonies, and, above all, papers to be filled out, reports, bibliographies, lists, questionnaires. And on top of that were the demands in the community, the things in which one had to, was ‘expected to’ participate that had not been there or had not been important before. It was all rigmarole, of course, but it consumed all one’s energies, coming on top of the work one really wanted to do. You can see how easy it was, then, not to think about fundamental things. One had no time.\"</p><p>\"Those,\" I said, \"are the words of my friend the baker. ‘One had no time to think. There was so much going on.’\"</p><p>\"Your friend the baker was right,\" said my colleague. \"The dictatorship, and the whole process of its coming into being, was above all . It provided an excuse not to think for people who did not want to think anyway. I do not speak of your ‘little men,’ your baker and so on; I speak of my colleagues and myself, learned men, mind you. Most of us did not want to think about fundamental things and never had. There was no need to. Nazism gave us some dreadful, fundamental things to think about—we were decent people—and kept us so busy with continuous changes and ‘crises’ and so fascinated, yes, fascinated, by the machinations of the ‘national enemies,’ without and within, that we had no time to think about these dreadful things that were growing, little by little, all around us. Unconsciously, I suppose, we were grateful. Who wants to think?</p><p>\"To live in this process is absolutely not to be able to notice it—please try to believe me—unless one has a much greater degree of political awareness, acuity, than most of us had ever had occasion to develop. Each step was so small, so inconsequential, so well explained or, on occasion, ‘regretted,’ that, unless one were detached from the whole process from the beginning, unless one understood what the whole thing was in principle, what all these ‘little measures’ that no ‘patriotic German’ could resent must some day lead to, one no more saw it developing from day to day than a farmer in his field sees the corn growing. One day it is over his head.</p><p>\"How is this to be avoided, among ordinary men, even highly educated ordinary men? Frankly, I do not know. I do not see, even now. Many, many times since it all happened I have pondered that pair of great maxims,  and —‘Resist the beginnings’ and ‘Consider the end.’ But one must foresee the end in order to resist, or even see, the beginnings. One must foresee the end clearly and certainly and how is this to be done, by ordinary men or even by extraordinary men? Things  have. And everyone counts on that .</p><p>\"Your ‘little men,’ your Nazi friends, were not against National Socialism in principle. Men like me, who were, are the greater offenders, not because we  better (that would be too much to say) but because we  better. Pastor Niemöller spoke for the thousands and thousands of men like me when he spoke (too modestly of himself) and said that, when the Nazis attacked the Communists, he was a little uneasy, but, after all, he was not a Communist, and so he did nothing; and then they attacked the Socialists, and he was a little uneasier, but, still, he was not a Socialist, and he did nothing; and then the schools, the press, the Jews, and so on, and he was always uneasier, but still he did nothing. And then they attacked the Church, and he was a Churchman, and he did something—but then it was too late.\"</p><p>\"You see,\" my colleague went on, \"one doesn’t see exactly where or how to move. Believe me, this is true. Each act, each occasion, is worse than the last, but only a little worse. You wait for the next and the next. You wait for one great shocking occasion, thinking that others, when such a shock comes, will join with you in resisting somehow. You don’t want to act, or even talk, alone; you don’t want to ‘go out of your way to make trouble.’ Why not?—Well, you are not in the habit of doing it. And it is not just fear, fear of standing alone, that restrains you; it is also genuine uncertainty.</p><p>\"Uncertainty is a very important factor, and, instead of decreasing as time goes on, it grows. Outside, in the streets, in the general community, ‘everyone’ is happy. One hears no protest, and certainly sees none. You know, in France or Italy there would be slogans against the government painted on walls and fences; in Germany, outside the great cities, perhaps, there is not even this. In the university community, in your own community, you speak privately to your colleagues, some of whom certainly feel as you do; but what do they say? They say, ‘It’s not so bad’ or ‘You’re seeing things’ or ‘You’re an alarmist.’</p><p>\"And you  an alarmist. You are saying that  must lead to , and you can’t prove it. These are the beginnings, yes; but how do you know for sure when you don’t know the end, and how do you know, or even surmise, the end? On the one hand, your enemies, the law, the regime, the Party, intimidate you. On the other, your colleagues pooh-pooh you as pessimistic or even neurotic. You are left with your close friends, who are, naturally, people who have always thought as you have.</p><p>\"But your friends are fewer now. Some have drifted off somewhere or submerged themselves in their work. You no longer see as many as you did at meetings or gatherings. Informal groups become smaller; attendance drops off in little organizations, and the organizations themselves wither. Now, in small gatherings of your oldest friends, you feel that you are talking to yourselves, that you are isolated from the reality of things. This weakens your confidence still further and serves as a further deterrent to—to what? It is clearer all the time that, if you are going to do anything, you must  an occasion to do it, and then you are obviously a troublemaker. So you wait, and you wait.</p><p>\"But the one great shocking occasion, when tens or hundreds or thousands will join with you, never comes.  the difficulty. If the last and worst act of the whole regime had come immediately after the first and smallest, thousands, yes, millions would have been sufficiently shocked—if, let us say, the gassing of the Jews in ’43 had come immediately after the ‘German Firm’ stickers on the windows of non-Jewish shops in ’33. But of course this isn’t the way it happens. In between come all the hundreds of little steps, some of them imperceptible, each of them preparing you not to be shocked by the next. Step C is not so much worse than Step B, and, if you did not make a stand at Step B, why should you at Step C? And so on to Step D.</p><p>\"And one day, too late, your principles, if you were ever sensible of them, all rush in upon you. The burden of self-deception has grown too heavy, and some minor incident, in my case my little boy, hardly more than a baby, saying ‘Jewish swine,’ collapses it all at once, and you see that everything, everything, has changed and changed completely under your nose. The world you live in—your nation, your people—is not the world you were born in at all. The forms are all there, all untouched, all reassuring, the houses, the shops, the jobs, the mealtimes, the visits, the concerts, the cinema, the holidays. But the spirit, which you never noticed because you made the lifelong mistake of identifying it with the forms, is changed. Now you live in a world of hate and fear, and the people who hate and fear do not even know it themselves; when everyone is transformed, no one is transformed. Now you live in a system which rules without responsibility even to God. The system itself could not have intended this in the beginning, but in order to sustain itself it was compelled to go all the way.</p><p>\"You have gone almost all the way yourself. Life is a continuing process, a flow, not a succession of acts and events at all. It has flowed to a new level, carrying you with it, without any effort on your part. On this new level you live, you have been living more comfortably every day, with new morals, new principles. You have accepted things you would not have accepted five years ago, a year ago, things that your father, even in Germany, could not have imagined.</p><p>\"Suddenly it all comes down, all at once. You see what you are, what you have done, or, more accurately, what you haven’t done (for that was all that was required of most of us: that we do nothing). You remember those early meetings of your department in the university when, if one had stood, others would have stood, perhaps, but no one stood. A small matter, a matter of hiring this man or that, and you hired this one rather than that. You remember everything now, and your heart breaks. Too late. You are compromised beyond repair.</p><p>\"What then? You must then shoot yourself. A few did. Or ‘adjust’ your principles. Many tried, and some, I suppose, succeeded; not I, however. Or learn to live the rest of your life with your shame. This last is the nearest there is, under the circumstances, to heroism: shame. Many Germans became this poor kind of hero, many more, I think, than the world knows or cares to know.\"</p><p>I said nothing. I thought of nothing to say.</p><p>\"I can tell you,\" my colleague went on, \"of a man in Leipzig, a judge. He was not a Nazi, except nominally, but he certainly wasn’t an anti-Nazi. He was just—a judge. In ’42 or ’43, early ’43, I think it was, a Jew was tried before him in a case involving, but only incidentally, relations with an ‘Aryan’ woman. This was ‘race injury,’ something the Party was especially anxious to punish. In the case at bar, however, the judge had the power to convict the man of a ‘nonracial’ offense and send him to an ordinary prison for a very long term, thus saving him from Party ‘processing’ which would have meant concentration camp or, more probably, deportation and death. But the man was innocent of the ‘nonracial’ charge, in the judge’s opinion, and so, as an honorable judge, he acquitted him. Of course, the Party seized the Jew as soon as he left the courtroom.\"</p><p>\"Yes, the judge. He could not get the case off his conscience—a case, mind you, in which he had acquitted an innocent man. He thought that he should have convicted him and saved him from the Party, but how could he have convicted an innocent man? The thing preyed on him more and more, and he had to talk about it, first to his family, then to his friends, and then to acquaintances. (That’s how I heard about it.) After the ’44  they arrested him. After that, I don’t know.\"</p><p>\"Once the war began,\" my colleague continued, \"resistance, protest, criticism, complaint, all carried with them a multiplied likelihood of the greatest punishment. Mere lack of enthusiasm, or failure to show it in public, was ‘defeatism.’ You assumed that there were lists of those who would be ‘dealt with’ later, after the victory. Goebbels was very clever here, too. He continually promised a ‘victory orgy’ to ‘take care of’ those who thought that their ‘treasonable attitude’ had escaped notice. And he meant it;  was not just propaganda. And that was enough to put an end to all uncertainty.</p><p>\"Once the war began, the government could do anything ‘necessary’ to win it; so it was with the ‘final solution of the Jewish problem,’ which the Nazis always talked about but never dared undertake, not even the Nazis, until war and its ‘necessities’ gave them the knowledge that they could get away with it. The people abroad who thought that war against Hitler would help the Jews were wrong. And the people in Germany who, once the war had begun, still thought of complaining, protesting, resisting, were betting on Germany’s losing the war. It was a long bet. Not many made it.\"</p>","contentLength":13601,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45321663"},{"title":"Ultrasonic Chef's Knife","url":"https://seattleultrasonics.com/","date":1758384776,"author":"hemloc_io","guid":86156,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45314592"},{"title":"Less is safer: Reducing the risk of supply chain attacks","url":"https://obsidian.md/blog/less-is-safer/","date":1758319349,"author":"saeedesmaili","guid":86155,"unread":true,"content":"<p>Supply chain attacks are malicious updates that sneak into open source code used by many apps. Here’s how we design Obsidian to ensure that the app is a <a href=\"https://obsidian.md/security\">secure and private</a> environment for yourthoughts.</p><p>It may sound obvious but the primary way we reduce the risk of supply chain attacks is to avoid depending on third-party code. Obsidian has a low number of dependencies compared to other apps in our category. See a list of open source libraries on <a href=\"https://help.obsidian.md/credits#Third+party+acknowledgements\">our Creditspage</a>.</p><p>Features like <a href=\"https://help.obsidian.md/bases\">Bases</a> and <a href=\"https://help.obsidian.md/plugins/canvas\">Canvas</a> were implemented from scratch instead of importing off-the-shelf libraries. This gives us full control over what runs inObsidian.</p><ul><li><strong>For small utility functions</strong> we almost always re-implement them in ourcode.</li><li> we fork them and keep them inside our codebase if the licenses allowsit.</li><li> like pdf.js, Mermaid, and MathJax, we include known-good, version-locked files and only upgrade occasionally, or when security fixes land. We read release notes, look at upstream changes, and test thoroughly beforeswitching.</li></ul><p>This approach keeps our dependency graph shallow with few sub-dependencies. A smaller surface area lowers the chance of a malicious update slippingthrough.</p><h3>What actually ships in theapp</h3><p>Only a handful of packages are part of the app you run, e.g. Electron, CodeMirror, moment.js. The other packages help us build the app and never ship to users, e.g. esbuild oreslint.</p><h3>Version pinning andlockfiles</h3><p>All dependencies are strictly version-pinned and committed with a lockfile. The lockfile is the source of truth for builds so we get deterministic installs. This gives us a straightforward audit trail when reviewingchanges.</p><p>We do not run postinstall scripts. This prevents packages from executing arbitrary code duringinstallation.</p><h3>Slow, deliberate upgrades</h3><p>When we do dependency updates,we:</p><ol><li>Read the dependency’s changelogline-by-line.</li><li>Check sub-dependencies introduced by the newversion.</li><li>Diff upstream&nbsp;when the change set is large orrisky.</li><li>Run automated and manual tests&nbsp;across platforms and critical userpaths.</li><li>Commit the new lockfile&nbsp;only after these reviewspass.</li></ol><p>In practice, we&nbsp;rarely&nbsp;update dependencies because they generally work and do not require frequent changes. When we do, we treat each change as if we were taking a newdependency.</p><p>We don’t rush upgrades. There is a delay between upgrading any dependency and pushing a release. That gap acts as an early-warning window: the community and security researchers often detect malicious versions quickly. By the time we’re ready to ship, the ecosystem has usually flagged any problematicreleases.</p><p>No single measure can eliminate supply chain risk. But choosing fewer dependencies, shallow graphs, exact version pins, no postinstall, and a slow, review-heavy upgrade cadence together make Obsidian much less likely to be impacted, and give us a long window to detect problems before code reachesusers.</p><p>If you’re curious about our broader approach to security, see our <a href=\"https://obsidian.md/security\">security page</a> and pastaudits.</p>","contentLength":2951,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45307242"},{"title":"Trump to impose $100k fee for H-1B worker visas, White House says","url":"https://www.reuters.com/business/media-telecom/trump-mulls-adding-new-100000-fee-h-1b-visas-bloomberg-news-reports-2025-09-19/","date":1758311973,"author":"mriguy","guid":85455,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45305845"},{"title":"I regret building this $3000 Pi AI cluster","url":"https://www.jeffgeerling.com/blog/2025/i-regret-building-3000-pi-ai-cluster","date":1758292127,"author":"speckx","guid":86154,"unread":true,"content":"<p>I ordered a set of 10 Compute Blades in April 2023 (two years ago), and they just arrived a few weeks ago. In that time Raspberry Pi upgraded the CM4 to a CM5, so I ordered a set of 10 16GB CM5 Lite modules for my blade cluster. That should give me 160 GB of total RAM to play with.</p><p>This was the biggest Pi cluster I've built, and it set me back around $3,000, shipping included:</p><p>There's another Pi-powered blade computer, the <a href=\"https://www.kickstarter.com/projects/1907647187/small-board-big-possibilities-xerxes-pi\">Xerxes Pi</a>. It's smaller and cheaper, but it just wrapped up  Kickstarter. Will it ship in less than two years? Who knows, but I'm a sucker for crowdfunded blade computers, so of course I backed it!</p><p>But my main question, after sinking in a substantial amount of money: are Pi clusters even  it anymore? I There's no way this cluster could beat the $8,000, 4-node Framework Desktop cluster in performance. But what about in , or in efficiency or compute density?</p><p>There's only one way to find out.</p><h2>Compute Blade Cluster Build</h2><p>I made a video going over everything in this blog post—and the entire cluster build (and rebuild, and rebuild again) process. You can watch it here, or on YouTube:</p><p>But if you're on the blog, you're probably not the type to sit through a video anyway. So moving on...</p><h2>Clustering means doing everything over  times</h2><p>In the course of going from 'everything's in the box' to 'running AI and HPC benchmarks reliably', I rebuilt the cluster basically three times:</p><ol><li>First, my hodgepodge of random NVMe SSDs laying around the office was unreliable. Some drives wouldn't work with the Pi 5's PCIe bus, it seems, other ones were a little flaky (there's a reason these were spares sitting around the place, and not in use!)</li><li>After replacing all the SSDs with <a href=\"https://amzn.to/4lPJ0JC\">Patriot P300s</a>, they were more reliable, but the CM5s would throttle under load</li><li>I put <a href=\"https://amzn.to/45YACBV\">these CM heatsinks</a> on without screwing them in... then realized they would pop off sometimes, so I took all the blades out  and screwed them into the CM5s/Blades so they were more secure for the long term.</li></ol><h2>Compute Blade Cluster HPL Top500 Test</h2><p>Before I installed heatsinks, the cluster got 275 Gflops, which is an 8.5x speedup over a single 8 GB CM5. Not bad, but I noticed the cluster was only using 105 Watts of power during the run. Definitely more headroom available.</p><p>After fixing the thermals, the cluster did not throttle, and used around 130W. At full power, I got 325 Gflops, which is a 10x performance improvement (for 10x 16GB CM5s) over a single 8 GB CM5.</p><p>But the Pi cluster is  more energy efficient, on a Gflops/W basis:</p><p>The Pi is a little less cost-effective for HPC applications than a Framework Desktop running a AMD's fastest APU. So discounting the fact we're only talking CPUs, I don't think any hyperscalers are looking to swap out a few thousand AMD EPYC systems for 10,000+ Raspberry Pis :)</p><p>But what about AI use cases?</p><h2>Compute Blade Cluster AI Test</h2><p>With 160 GB of total RAM, shared by the CPU and iGPU, this could be a small, efficient AI Cluster, right? Well, you'd think.</p><p>A small model (Llama 3.2:3B), running on a single Pi, isn't horrible; you get about 6 tokens per second. But that is pretty weak compared to even an Intel N100 (much less a single Framework Desktop):</p><p>You could have 10 nodes running 10 models, and that might be a very niche use case, but the real test would be running a  AI model across all nodes. So I switched tracks to Llama 3.3:70B, which is a 40 GB model. It  to run across multiple Pis, since no single Pi has more than 16 GB of RAM.</p><p>Just as with the Framework cluster, llama.cpp RPC was  slow, since it splits up the model layers on all the cluster members, then goes round-robin style asking each node to perform its prompt processing, then token generation.</p><p>The Pi cluster couldn't even make it to token generation (tg) on my default settings, so I had to dial things back and only generate 16 tokens at a time to allow it to complete.</p><p>And after all that? Only 0.28 tokens per second, which is  than the Framework Cluster, running the same model (except on AI Max iGPUs with Vulkan).</p><p>I also tried <a href=\"https://github.com/exo-explore/exo\">Exo</a> and <a href=\"https://github.com/b4rtaz/distributed-llama\">distributed-llama</a>. Exo was having trouble even running a small 3B model on even a 2 or 3 node Pi cluster configuration, so I stopped trying to get that working.</p><p>Distributed llama worked, but only with up to 8 nodes for the 70B model. Doing that, I got a more useful 0.85 tokens/s, but that's still 5x slower than the Framework cluster (and it was a bit more fragile than llama.cpp RPC—the tokens were sometimes gibberish):</p><h2>Gatesworks and Conclusion</h2><p>Bottom line: this cluster's not a powerhouse. And dollar for dollar, if you're spending over $3k on a compute cluster, it's not the best value.</p><p>It  efficient, quiet, and compact. So if  is important, and if you need lots of small, physically separate nodes, this could actually make sense.</p><p>Like the only real world use case besides learning is for CI jobs or high security edge deployments, where you're not allowed to run multiple things on one server.</p><p>That's what <a href=\"https://unredacted.org/blog/2025/05/unredacted-labs/\">Unredacted Labs</a> is building Pi clusters for: they're building Tor exit relays on blades, after they found the Pi was the most efficient way to run massive amounts of nodes. If your goal is efficiency and node density, this does win, ever so slightly.</p><p>But for 99% of you reading this: this is not the cluster you're looking for.</p><p>Two years ago, when I originally ordered the Blades, <a href=\"https://www.gateworks.com\">Gateworks</a> reached out. They were selling a souped up version of the Compute Blade, made to an industrial spec. The <a href=\"https://www.gateworks.com/products/arm-server-blades/gblade-arm-server-blade/\">GBlade</a> is around Pi 4 levels of performance, but with  gig networking, along with a 1 gig management interface.</p><p>But... it's discontinued. It doesn't look like any type of compute blade really lit the world on fire, and like the Blade movie series, the Compute Blade is more of a cult classic than a mainstream hit.</p><p>This is a  cluster. Except for maybe blade 9, which dies every time I run a benchmark. But I will keep it going, knowing it's  easier to maintain than the <a href=\"https://www.independent.com/2025/04/29/worlds-biggest-raspberry-pi-cluster-is-now-at-uc-santa-barbara/\">1,050 node Pi cluster at UC Santa Barbera</a>, which to my knowledge is still the world's largest!</p><p>You might not want to replicate my cluster setup — but I always get asked what parts I used (especially the slim Ethernet cables... everyone asks about those!), so here's the parts list:</p>","contentLength":6173,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45302065"},{"title":"Ants that seem to defy biology – They lay eggs that hatch into another species","url":"https://www.smithsonianmag.com/smart-news/these-ant-queens-seem-to-defy-biology-they-lay-eggs-that-hatch-into-another-species-180987292/","date":1758284750,"author":"sampo","guid":86153,"unread":true,"content":"<p>Iberian harvester ant queens have a unique superpower: They can lay eggs that hatch into an entirely different species.</p><p>This discovery, described in a new paper published September 3 in the journal <a href=\"https://www.nature.com/articles/s41586-025-09425-w\"></a>, defies a fundamental principle of biology and may cause scientists to reconsider how they define a species.</p><p>“The classic concept says that [a species] is a group of organisms with similar physical and genetic characteristics that can reproduce with each other in nature and produce fertile offspring,” says <a href=\"https://www.ebd.csic.es/en/about-us/personnel/xim-cerda\">Xim Cerdá</a>, an ecologist at Doñana Biological Station in Spain who was not involved with the research, to Miguel Ángel Criado at <a href=\"https://english.elpais.com/science-tech/2025-09-04/messor-ibericus-the-ant-that-lays-eggs-of-two-different-species.html\"></a>. “But it turns out that’s not the case; two species are needed here. We’re going to have to rethink the concept.”</p><div><div><h4>Did you know? How many ants are on the planet?</h4></div></div><p>Scientists recently discovered that Iberian harvester ant queens () mate with males of another species, the builder harvester ant (). When they do, the  queens store the male’s sperm, then use it to fertilize some of the eggs they lay. Researchers think the  queens remove their own genetic material from the eggs’ nuclei, so that when those eggs hatch, they effectively turn out to be male clones.</p><p>The queens produce males of both and , and all the worker ants in coloniesare female hybrids of the two species.</p><p>“It’s an absolutely fantastic, bizarre story of a system that allows things to happen that seem almost unimaginable,” says <a href=\"https://www1.bio.ku.dk/english/staff/?pure=en/persons/186303\">Jacobus Boomsma</a>, an evolutionary biologist at the University of Copenhagen who was not involved with the research, to <a href=\"https://www.nature.com/articles/d41586-025-02807-0#ref-CR1\"></a>’s Max Kozlov.</p><p>Even more perplexing is the fact that and are not closely related, evolutionarily speaking. The two species diverged more than five million years ago, according to the paper. For comparison, scientists think <a href=\"https://humanorigins.si.edu/education/frequently-asked-questions\">humans and chimpanzees</a> split from a common ancestor that lived between six million and eight million years ago.</p><p>Proving the relationship between  and  was challenging. The scientists dug up various  colonies they found along the sides of farm roads near Lyon, France, looking for male ants. But among a colony of 10,000 ants, there might be only a few males, writes <a href=\"https://www.science.org/content/article/ant-queen-lays-eggs-hatch-two-species\"></a>’s Erik Stokstad.</p><p>In the end, they found 132 males from 26  colonies. Of those, about half were nearly hairless—a hallmark of —while the others were covered in dense hair, a trait typically found in . DNA testing confirmed their hunch: The hairy males were , and the bald ones were .</p><p>Even more intriguing, the males of both species shared  mitochondrial DNA, which is inherited from the mother, suggesting they had all been born from  queens.</p><p>This discovery is so novel and so unusual that the researchers had to come up with a new term to describe the behavior exhibited by  queens: “xenoparity,” which essentially means “foreign birth.”</p><p>The team also wanted to go beyond genetic evidence: They hoped to observe births of  ants from an  queen. So, they reared colonies in their laboratory. Then, they waited.</p><p>“It was very difficult, because in lab conditions, it’s nearly impossible to have males,” says co-author <a href=\"https://scholar.google.com/citations?user=QuMuD-gAAAAJ&amp;hl=en\">Jonathan Romiguier</a>, an ecologist at the University of Montpellier in France, to <a href=\"https://www.newscientist.com/article/2494855-queen-ant-makes-males-of-another-species-for-daughters-to-mate-with/\"></a>’s Tim Vernimmen. “We had something like 50 colonies and monitored them for two years without a single male being born. Then we got lucky.” Observing the births of  males was another key piece of evidence in describing the ants’ strange biology.</p><p>As for the  males in the colony, the queens mate with them to produce the next generation of queens.</p><p>But why do  queens clone  males? Scientists aren’t totally sure, but they say the partnership must be beneficial to both species.</p><p>For  this adaptation ensures they have plenty of workers, which are responsible for many important tasks in a colony, including building the nest, gathering food and raising the larvae. The arrangement also keeps  males around for future  queens to mate with, even in places without  colonies. Shockingly,  colonies are only found in <a href=\"https://theconversation.com/one-queen-ant-two-species-the-discovery-that-reshapes-what-family-means-in-nature-264384\">mountainous areas</a>&nbsp;across a small range. But by transporting the  male clones around,  has allowed that species to spread to new places.</p><p>However, the unique setup might not last forever. Because the  males are clones and do not appear to be mating with members of their own species, they are probably accumulating harmful genetic mutations, which makes them more vulnerable in the long run, reports . But, for now, the relationship seems to be working.</p><p>“Every step in this coevolutionary game makes perfect sense and uses the entire toolbox of reproductive tricks that we know ants are capable of employing,” says <a href=\"https://www.uvm.edu/cas/biology/profile/sara-helms-cahan\">Sara Helms Cahan</a>, an evolutionary ecologist at the University of Vermont who was not involved with the research, to . “The end result is fantastical but incredibly successful, with one species carrying another in its pocket, as it were, all over southern Europe.”</p>","contentLength":4869,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45300865"},{"title":"The best YouTube downloaders, and how Google silenced the press","url":"https://windowsread.me/p/best-youtube-downloaders","date":1758284410,"author":"Leftium","guid":86152,"unread":true,"content":"<pre><code><code>==============================\nThe Windows ReadMe - #005\n==============================</code></code></pre><p>“We can’t write about them. We’ll get in trouble.”</p><p>That’s the attitude I had about YouTube downloaders when I ran How-To Geek as Editor-in-Chief. We self-censored to protect ourselves. But I’m not dancing for Google ad revenue anymore.</p><p>This ReadMe file is about incredibly useful free YouTube downloaders that I recommend. But it’s also about so many other truths people don’t normally share:</p><ul><li><p>Why YouTube downloaders are ethical and you shouldn’t apologize for using them.</p></li><li><p>Why Google secretly needs YouTube downloaders.</p></li><li><p>Why toothless terms of services like YouTube’s are no better than the EULAs we’ve been ignoring for decades.</p></li><li><p>And how Google has used its ad network (now ruled an illegal monopoly) to privilege its own services ahead of competitors.</p></li></ul><pre><code><code>==============================\nThis week’s tip\n==============================</code></code></pre><p>Since I’m not writing to optimize this list for Google, I can just give you the answer!</p><p> Here are the best YouTube downloaders -- based on my personal experience:</p><ul><li><p><strong>best YouTube downloader for Windows</strong></p></li><li><p><strong>best YouTube downloader for the command line</strong></p></li><li><p><strong>best YouTube download for Mac and Linux</strong></p></li><li><p><strong>best YouTube downloader on the web</strong></p></li><li><p><strong>best YouTube downloader for Android</strong></p></li></ul><p>Use any of these and you’ll get a video file you can back up, archive, and do whatever you want with. It’s yours to preserve.</p><div data-attrs=\"{&quot;url&quot;:&quot;https://windowsread.me/p/best-youtube-downloaders?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share&quot;,&quot;text&quot;:&quot;Share&quot;}\" data-component-name=\"CaptionedButtonToDOM\"><div><p>Share this with anyone who needs a good YouTube downloader.</p></div></div><p>When you install an application, you often click through a long end user license agreement. If people had to read each agreement in full, society would grind to a halt.</p><p>So yes: YouTube’s terms of service may or may not say you can’t download videos from it. I haven’t checked. Have you read it in full? Have you checked the terms of service for every product you’ve used to confirm you’re in compliance? No one has -- that’s the point.</p><p>YouTube has become part of the plumbing of the modern web. It hosts everything from city council meetings to recorded live-streams of important family events. If a video is important to you -- or you want to have a copy for legal reasons -- you should download it. And, to do that, you’ll need a YouTube downloader.</p><p>Using a YouTube downloader is like printing a web page to a PDF or saving an image file for later -- you get an offline copy you can archive. Just like with anything else on the web, a YouTube video may be taken down by its creator in the future. And you may need your offline copy.</p><p>Google needs YouTube downloaders. They perform a valuable role: If it were impossible to download YouTube videos, many organizations would abandon hosting their videos on YouTube for a platform that offered more user flexibility. Or they’d need to host a separate download link and put it in their YouTube descriptions. But organizations don’t need to jump through hoops -- they just let people use YouTube downloaders.</p><p>Google could lock down YouTube harder. Services like Netflix use DRM-protected streams to stop downloads. Google could make it much harder to download videos. But Google benefits from setting up a gray market ecosystem of often-inconvenient download tools. The ecosystem of YouTube downloaders and Google’s tacit approval of them has helped cement YouTube’s dominance.</p><p>When I ran How-To Geek as Editor-in-Chief -- and when I was a writer -- we went out of our way to avoid writing about YouTube downloaders. And we weren’t the only publication that avoided touching them, despite reader interest.</p><p>Google has been walking a line for over a decade now: YouTube lets you use downloaders, but Google makes them inconvenient to find and annoying to use. Google tries to stop your favorite websites from writing about them. Google breaks tricks they depend on.</p><p>If you want to find a way to download an important video, you’ll find it -- that’s an important escape hatch and means YouTube retains its dominance as an online engine of culture.</p><p>We shouldn’t. Download the video you want. Back it up somewhere safe.</p><pre><code><code>==============================\nSomething I'm proud of this week\n==============================</code></code></pre><p>Microsoft was pitching Windows Recall as the shiny AI feature to carry its Copilot+ PC brand, but no one talks about Recall anymore. The launch was too messy, the feature was too delayed, and the search experience never became as useful as Microsoft promised.</p><pre><code><code>==============================\nInsights from Thurrott.com\n==============================</code></code></pre><pre><code><code>==============================\nEULAs and a time machine\n==============================</code></code></pre><p>(Yes, I just linked an Archive.org backup of a piece I wrote 13 years ago. I don’t know whether MakeUseOf’s terms of service allowed Archive.org to save a backup copy, but I’m glad they did save copy. Backups are important.)</p><p>Looking back at it, my favorite ridiculous EULA clause was the \"special consideration\" in PC Pitstop's EULA. It said that the first person who noticed this line in the EULA could email the company and receive a financial reward.</p><p>It took four months for someone to notice the line and claim a $1000 prize. No one reads EULAs, even when they have something positive to say!</p><pre><code><code>==== Command Prompt ====\n\nC:\\&gt; net send * \"Have a great weekend!\"</code></code></pre>","contentLength":5244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45300810"},{"title":"Ruby Central's Attack on RubyGems [pdf]","url":"https://pup-e.com/goodbye-rubygems.pdf","date":1758269357,"author":"jolux","guid":86151,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45299170"},{"title":"Help us raise $200k to free JavaScript from Oracle","url":"https://deno.com/blog/javascript-tm-gofundme","date":1758246035,"author":"kaladin-jasnah","guid":86150,"unread":true,"content":"<p>After more than\n<a href=\"https://javascript.tm/letter\" rel=\"noopener noreferrer\">27,000 people signed our open letter to Oracle</a>\nabout the “JavaScript” trademark, we filed a formal \nwith the US Patent and Trademark Office. Ten months in, we’re finally reaching\nthe crucial .</p><p>Deno initiated this petition since we have legal standing as a JavaScript\nruntime, but it’s really on behalf of all developers. If we win, “JavaScript”\nbecomes public domain – free for all developers, conferences, book authors, and\ncompanies to use without fear of trademark threats.</p><p>We’re asking for your support through our\n<a href=\"https://www.gofundme.com/f/help-us-challenge-oracles-javascript-trademark/donate\" rel=\"noopener noreferrer\">GoFundMe campaign</a>\nso we can put forward the strongest case possible.</p><p>Because federal litigation is expensive. Discovery is the most\nresource-intensive stage of litigation, where evidence is collected and\narguments are built.</p><p>We don’t want to cut corners – we want to make the best case possible by\nfunding:</p><ul><li><strong>Professional public surveys</strong> that carry legal weight in front of the USPTO,\nproving that “JavaScript” is universally recognized as the name of a language,\nnot Oracle’s brand.</li><li> from academia and industry to testify on JavaScript’s\nhistory, usage, and meaning.</li><li> from standards bodies, browser vendors, and\nindustry leaders showing Oracle has no role in the language’s development.</li><li><strong>Legal filings and responses</strong> to counter Oracle’s claims at every step.</li></ul><p>If there are leftover funds, we’ll donate them to the\n<a href=\"https://openjsf.org/governance\" rel=\"noopener noreferrer\"></a> to continue defending civil\nliberties in the digital space. None of the funds will go to Deno.</p><h3><a aria-hidden=\"true\" tabindex=\"-1\" href=\"https://deno.com/blog/javascript-tm-gofundme#oracle-officially-denies-javascript-is-generic\"></a>Oracle officially denies “JavaScript” is generic</h3><p>On August 6th, 2025, Oracle for the first time addressed the validity of the\ntrademark.\n<a href=\"https://ttabvue.uspto.gov/ttabvue/v?pno=92086835&amp;pty=CAN&amp;eno=16\" rel=\"noopener noreferrer\">Their response</a>\nto our\n<a href=\"https://ttabvue.uspto.gov/ttabvue/v?pno=92086835&amp;pty=CAN&amp;eno=1\" rel=\"noopener noreferrer\">petition</a>\ndenies that “JavaScript” is a generic term.</p><p>If you’re a web developer, it’s self-evident that Oracle has nothing to do with\nJavaScript. The trademark system was never meant to let companies squat on\ncommonly-used names and rent-seek – it was designed to protect active brands in\ncommerce. US law makes this distinction explicit.</p><p>If we don’t win discovery, Oracle locks in ownership of the word “JavaScript.”\nThis is the decisive moment.</p><p>But this case is bigger than JavaScript. It’s about whether trademark law works\nas written, or whether billion-dollar corporations can ignore the rule that\ntrademarks cannot be generic or abandoned. “JavaScript” is obviously both. If\nOracle wins anyway, it undermines the integrity of the whole system.</p><p>Let’s make sure the law holds.\n<a href=\"https://www.gofundme.com/f/help-us-challenge-oracles-javascript-trademark/donate\" rel=\"noopener noreferrer\">Please donate</a>.\nPlease share and upvote this.</p>","contentLength":2470,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45297066"},{"title":"Want to piss off your IT department? Are the links not malicious looking enough?","url":"https://phishyurl.com/","date":1758235206,"author":"jordigh","guid":85236,"unread":true,"content":"<h4>What is this and what does it do?</h4><p>This is a tool that takes any link and makes it look malicious. It works on the idea of a <a href=\"https://en.wikipedia.org/wiki/URL_redirection\" target=\"_blank\">redirect</a>.\n                        Much like <a href=\"https://tinyurl.com/\" target=\"_blank\">https://tinyurl.com/</a> for example.\n                        Where tinyurl makes an url shorter, this site makes it look malicious.\n                    </p><p>\n                        Place any link in the below input, press the button and get back a fishy(phishy, heh...get, it?)\n                        looking link.\n                        The fishy link doesn't actually do anything, it will just redirect you to the original link you\n                        provided.\n                    </p>","contentLength":650,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45295898"},{"title":"Meta’s live demo fails; “AI” recording plays before the actor takes the steps","url":"https://www.reddit.com/r/LivestreamFail/comments/1nkbig7/metas_live_staged_demo_fails_the_ai_recording/","date":1758228633,"author":"personjerry","guid":86149,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45294859"},{"title":"Apple: SSH and FileVault","url":"https://keith.github.io/xcode-man-pages/apple_ssh_and_filevault.7.html","date":1758226545,"author":"ingve","guid":86148,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45294440"},{"title":"Grief gets an expiration date, just like us","url":"https://bessstillman.substack.com/p/oh-fuck-youre-still-sad","date":1758205060,"author":"LaurenSerino","guid":86147,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45290021"},{"title":"KDE is now my favorite desktop","url":"https://kokada.dev/blog/kde-is-now-my-favorite-desktop/","date":1758197871,"author":"todsacerdoti","guid":86146,"unread":true,"content":"<p>From <a href=\"https://kokada.dev/blog/from-gaming-rig-to-personal-computer-my-journey-with-nixos-and-jovian\">my last blog\npost</a>,\nI am now using KDE as the desktop environment for my gaming rig. The reason is\nbecause I want a reasonably easy to use Linux desktop for when my wife needs to\nuse the PC for something other than gaming, and this was the reason why my\n\"traditional\" <a href=\"https://swaywm.org/\">Sway</a> setup was a no-go.</p><p>But, after using KDE for a while I am starting to really appreciate how good it\nis. And no, this is not compared to other Linux desktops, but also with both\nWindows and macOS (that I need to use often, especially the later since my job\ngave me a MacBook Pro).</p><p>To start, KDE is surprisingly feature-complete. For example, the network applet\ngives lots of information that in other operational systems are either not\navailable or difficult to access. It is easy to see in the screenshot below:</p><p>You can see things like channel, signal strength, frequency, MAC address, BSSID\naddress (so the MAC address of the router). It even includes a handy button to\nshare the Wi-Fi information via QR code, so you can easily setup a new mobile\ndevice like Android.</p><p>By the way, the crop and blur from that screenshot above? I made everything\nusing the integrated screenshot tool. I didn't need to open an external\napplication even once. It is also really smart, I need to redo this screenshot\na few times and it kept the cropping to the exact area I was taking the\nscreenshot before.</p><p>Another example, I wanted <a href=\"https://steamcommunity.com/\">Steam</a> to start\nautomatically with the system, but it has the bad habit of putting its main\nwindow at the top. Really annoying since it sometimes ended up stealing up the\nfocus. However KDE has this \"Window Rules\" feature inside \"Window Management\"\nsettings where you can pretty much control whatever you want about application\nwindows. Really useful tool.</p><p>KDE also has lots of really well integrated tools. For example, I am using some\nFlatpak applications and I can easily configure the permissions via System\nSettings. Or if I want hardware information like\n<a href=\"https://en.wikipedia.org/wiki/Self-Monitoring,_Analysis_and_Reporting_Technology\">SMART</a>\nstatus, I can just open Info Center. I can prevent the screen and computer to\nsleep at the click of a button (something that in both Windows and macOS I need\nto install a separate program). The list goes on, I keep getting surprised how\nmany things that I used to need a third-party program that KDE just has\navailable by default.</p><p>But not only KDE is fully featured, it is also fast. Now to be clear, this is\na completely subjective analysis but I find KDE faster than Windows 11 in the\nsame hardware, especially for things integrated in the system itself. For\nexample, while opening Windows settings it can take a few seconds after a cold\nboot, the KDE's System Settings is pretty much instantaneous. Even compared\nwith macOS in my MacBook Pro M2 Pro (that is of course comparing Apples and\nBananas), KDE just feels snappier. I actually can't find much difference\nbetween KDE and my Sway setup to be honest, except maybe for the heavy use of\nanimations (that can be disabled, but I ended up liking it after a while).</p><p>I will not say KDE is perfect though. At the first launch I got one issue where\nit started without the task bar because I connected this PC to both my monitor\nand TV, but the TV is used exclusively for gaming. However, KDE considered my\nTV the primary desktop and put the task bar only in that monitor, and even\ndisabling the TV didn't add the task bar to my monitor. Easily fixed by\nmanually adding a task bar, but an annoying problem (especially when you're not\nused to the desktop). There were also a few other minor issues that I don't\nremember right now.</p><p>After using KDE for about a week I can say that this is the first time that I\nreally enjoy a desktop environment on Linux, after all those years. Props for\nthe KDE developers for making the experience so good.</p>","contentLength":3734,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45288690"},{"title":"Nvidia buys $5B in Intel","url":"https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal","date":1758193488,"author":"stycznik","guid":85042,"unread":true,"content":"<p>In a surprise announcement that finds two long-time rivals working together, Nvidia and Intel announced today that the companies will jointly develop multiple new generations of x86 products together — a seismic shift with profound implications for the entire world of technology. Before the news broke, Tom's Hardware spoke with Nvidia representatives to learn more details about the company’s plans.</p><p>The products include x86 Intel CPUs tightly fused with an Nvidia RTX graphics chiplet for the consumer gaming PC market, named the ‘Intel x86 RTX SOCs.’ Nvidia will also have Intel build custom x86 data center CPUs for its AI products for hyperscale and enterprise customers. Additionally, Nvidia will buy $5 billion in Intel common stock at $23.28 per share, representing a roughly 5% ownership stake in Intel. (Intel stock is now up 33% in premarket trading.)</p><a href=\"https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal\" data-url=\"\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"></a><p aria-hidden=\"true\">The partnership between the two companies is in the very early stages, Nvidia told us, so the timeline for product releases, along with any product specifications, will be disclosed at a later, unspecified date. (Given the traditionally long lead-times for new processors, it is rational to expect these products will take at least a year, and likely longer, to come to market.)</p><p>Nvidia emphasized that the companies are committed to multi-generation roadmaps for the co-developed products, which represents a strong investment in the x86 ecosystem. But Nvidia representatives tell us it also remains fully committed to other announced product roadmaps and architectures, including the company's Arm-based <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/pc-components/gpus/nvidias-project-digits-desktop-ai-supercomputer-fits-in-the-palm-of-your-hand-usd3-000-to-bring-1-pflops-of-performance-home\" data-before-rewrite-localise=\"https://www.tomshardware.com/pc-components/gpus/nvidias-project-digits-desktop-ai-supercomputer-fits-in-the-palm-of-your-hand-usd3-000-to-bring-1-pflops-of-performance-home\">GB10 Grace Blackwell processors for workstations</a> and the <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/nvidia-unveils-144-core-grace-cpu-superchip-claims-arm-chip-15x-faster-than-amds-epyc-rome\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/nvidia-unveils-144-core-grace-cpu-superchip-claims-arm-chip-15x-faster-than-amds-epyc-rome\">Nvidia Grace</a><a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/nvidia-details-grace-hopper-cpu-superchip-design-144-cores-on-4n-tsmc-process\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/nvidia-details-grace-hopper-cpu-superchip-design-144-cores-on-4n-tsmc-process\">CPUs for data centers</a>, as well as the next-gen <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidias-rubin-gpu-and-vera-cpu-data-center-ai-platforms-begin-tape-out-both-chips-in-fab-and-on-track-for-2026\" data-before-rewrite-localise=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidias-rubin-gpu-and-vera-cpu-data-center-ai-platforms-begin-tape-out-both-chips-in-fab-and-on-track-for-2026\">Vera CPUs</a>. Nvidia says it also remains committed to products on its internal roadmaps that haven’t been publicly disclosed yet, indicating that the new roadmap with Intel will merely be additive to existing initiatives.</p><p>Nvidia hasn’t disclosed whether it will use Intel Foundry to produce any of these products yet. However, while Intel has used TSMC to manufacture some of its own recent products, its goal is to bring production of most high-performance products back into its own foundries.</p><p>Some products never left. For instance, Intel’s existing <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/pc-components/cpus/intel-launches-granite-rapids-xeon-6900p-series-with-120-cores-matches-amd-epycs-core-counts-for-the-first-time-since-2017\" data-before-rewrite-localise=\"https://www.tomshardware.com/pc-components/cpus/intel-launches-granite-rapids-xeon-6900p-series-with-120-cores-matches-amd-epycs-core-counts-for-the-first-time-since-2017\">Granite Rapids</a> data center processors use the ‘Intel 3’ node, and the upcoming <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/desktops/servers/intel-reveals-288-core-xeon\" data-before-rewrite-localise=\"https://www.tomshardware.com/desktops/servers/intel-reveals-288-core-xeon\">Clearwater Forest Xeons</a> will use Intel’s own 18A process node for compute. This suggests that at least some of the Nvidia-custom x86 silicon, particularly for the data center, <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/nvidia-ceo-intel-test-chip-results-for-next-gen-process-look-good\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/nvidia-ceo-intel-test-chip-results-for-next-gen-process-look-good\">could be fabbed on Intel nodes</a>. Intel also uses TSMC to fabricate many of its client x86 processors, however, so we won’t know for sure until official announcements are made — particularly for the RTX GPU chiplet.</p><p>While the two companies have engaged in heated competition in some market segments, Intel and Nvidia have partnered for decades, ensuring interoperability between their hardware and software for products spanning both the client and data center markets. The PCIe interface has long been used to connect Intel CPUs and Nvidia GPUs. The new partnership will find tighter integration using the <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/pc-components/cpus/nvidia-announces-nvlink-fusion-to-allow-custom-cpus-and-ai-accelerators-to-work-with-its-products\" data-before-rewrite-localise=\"https://www.tomshardware.com/pc-components/cpus/nvidia-announces-nvlink-fusion-to-allow-custom-cpus-and-ai-accelerators-to-work-with-its-products\">NVLink interface for CPU-to-GPU communication</a>, which affords up to 14 times more bandwidth along with lower latency than PCIe, thus granting the new x86 products access to the highest performance possible when paired with GPUs. That's a strategic advantage. Let’s dive into the details we’ve learned so far.</p><a aria-hidden=\"true\" href=\"https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal\" data-url=\"\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"></a><h2>Intel x86 RTX SOCs for the PC gaming market</h2><p>For the PC market, the Intel x86 RTX SoC chips will come with an x86 CPU chiplet tightly connected with an Nvidia RTX GPU chiplet via the NVLink interface. This type of processor will have both CPU and GPU units merged into one compact chip package that externally looks much like a standard CPU, rivaling AMD’s competing APU products.</p><p>This type of tight integration packs all the gaming prowess into one package without an external discrete GPU, providing power and footprint advantages. As such, we're told these chips will be heavily focused on thin-and-light gaming laptops and small form-factor PCs, much like today’s APUs from AMD. However, it’s possible the new Nvidia/Intel chips could come in multiple flavors and permeate further into the Intel stack over time.</p><p>Intel has worked on a similar type of chip before with AMD; there is at least one significant technical difference between these initiatives, however. Intel launched its <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/reviews/intel-hades-canyon-nuc-vr,5536.html\" data-before-rewrite-localise=\"https://www.tomshardware.com/reviews/intel-hades-canyon-nuc-vr,5536.html\">Kaby Lake-G chip in 2017</a> with an Intel processor fused into the same package as an AMD Radeon GPU chiplet, much the same as the description of the new Nvidia/Intel chips. You can see an image of the Intel/AMD chip below.</p><p>This SoC had a CPU at one end connected via a PCIe connection to the separate AMD GPU chiplet, which is flanked by a small, dedicated memory package. This separate memory package was only usable by the GPU. The Nvidia/Intel products will have an RTX GPU chiplet connected to the CPU chiplet via the faster and more efficient NVLink interface, and we’re told it will have uniform memory access (UMA), meaning both the CPU and GPU will be able to access the same pool of memory. Given the particulars of Nvidia's NVLink Fusion architecture, we can expect the chips to communicate via a refined interface, but it is unlikely that it will leverage Nvidia's <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/nvidia-details-grace-hopper-cpu-superchip-design-144-cores-on-4n-tsmc-process\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/nvidia-details-grace-hopper-cpu-superchip-design-144-cores-on-4n-tsmc-process\">C2C (Chip-to-Chip) technology</a>, an inter-die/inter-chip interconnect that's based on Arm protocols that aren't likely optimized for x86.</p><p>Intel notoriously <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/intel-discontinue-kaby-lake-g-amd-graphics,40577.html\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/intel-discontinue-kaby-lake-g-amd-graphics,40577.html\">axed the Kaby Lake-G products in 2019</a>, and the existing systems were <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/intel-graphics-driver-update-hades-canyon-amd-12-month-delay\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/intel-graphics-driver-update-hades-canyon-amd-12-month-delay\">left without proper driver support</a> for <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/windows-11-kaby-lake-g-drivers\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/windows-11-kaby-lake-g-drivers\">quite some time</a>, in part because Intel was responsible for validating the drivers, and then finger-pointing ensued. We’re told that both Intel and Nvidia will be responsible for their respective drivers for the new models, with Nvidia naturally providing its own GPU drivers. However, Intel will build and sell the consumer processors.</p><p>We haven’t spoken with Intel yet, but the limited scope of this project means that Intel’s proprietary Xe graphics architecture will most assuredly live on as the primary integrated GPU (iGPU) for its mass-market products.</p><a aria-hidden=\"true\" href=\"https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal\" data-url=\"\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"></a><h2>Nvidia's first x86 data center CPUs</h2><p>Intel will fabricate custom x86 data center CPUs for Nvidia, which Nvidia will then sell as its own products to enterprise and data center customers. However, the entirety and extent of the modifications are currently unknown. We know that Nvidia will employ its NVLink interface, which suggests that the chips could leverage Nvidia’s new <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/pc-components/cpus/nvidia-announces-nvlink-fusion-to-allow-custom-cpus-and-ai-accelerators-to-work-with-its-products\" target=\"_blank\" data-before-rewrite-localise=\"https://www.tomshardware.com/pc-components/cpus/nvidia-announces-nvlink-fusion-to-allow-custom-cpus-and-ai-accelerators-to-work-with-its-products\">NVLink Fusion</a> technology for custom CPUs and accelerators, enabling faster and more efficient communication with Nvidia’s GPUs than is possible with the PCIe interface.</p><figure data-bordeaux-image-check=\"\"></figure><p>Intel has long offered custom Xeons to its customers, primarily hyperscalers, often with relatively minor tweaks to clock rates, cache capacities, and other specifications. In fact, these mostly slightly-modified custom Xeon models once comprised more than 50% of Intel’s Xeon shipments. Intel has endured several years of market share erosion due to AMD’s advances, most acutely in the hyperscale market. Therefore, it is unclear if the 50% number still holds true, as hyperscalers were the primary customers for custom models.</p><p>Nvidia already uses Intel’s Xeons in several of its systems, like the Nvidia DGX B300, but these systems still use the PCIe interface to communicate with the CPU. Intel’s new collaboration with Nvidia will obviously open up new opportunities, given the tighter integration with NVLink and all the advantages it brings with it.</p><p>The likelihood of AMD adopting NVLink Fusion is somewhere around zero, as the company is heavily invested in its own <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/news/amd-infinity-fabric-cpu-to-gpu\" data-before-rewrite-localise=\"https://www.tomshardware.com/news/amd-infinity-fabric-cpu-to-gpu\">Infinity Fabric (XGMI)</a> and <a data-analytics-id=\"inline-link\" href=\"https://www.tomshardware.com/tech-industry/ualink-has-nvidias-nvlink-in-the-crosshairs-final-specs-support-up-to-1-024-gpus-with-200-gt-s-bandwidth\" data-before-rewrite-localise=\"https://www.tomshardware.com/tech-industry/ualink-has-nvidias-nvlink-in-the-crosshairs-final-specs-support-up-to-1-024-gpus-with-200-gt-s-bandwidth\">Ultra Accelerator Link (UALink)</a> initiatives, which aim to provide an open-standard interconnect to rival NVLink and democratize rack-scale interconnect technologies. Intel is also a member of UALink, which uses AMD’s Infinity Fabric protocol as the foundation.</p><a aria-hidden=\"true\" href=\"https://www.tomshardware.com/pc-components/cpus/nvidia-and-intel-announce-jointly-developed-intel-x86-rtx-socs-for-pcs-with-nvidia-graphics-also-custom-nvidia-data-center-x86-processors-nvidia-buys-usd5-billion-in-intel-stock-in-seismic-deal\" data-url=\"\" target=\"_blank\" referrerpolicy=\"no-referrer-when-downgrade\" data-hl-processed=\"none\"></a><h2>Dollar and Cents, Geopolitics</h2><p>Nvidia’s $5 billion purchase of Intel common stock will come at $23.28 a share, roughly 6% below the current market value, but several aspects of this investment remain unclear. Nvidia hasn’t stated whether it will have a seat on the board (which is unlikely) or how it will vote on matters requiring shareholder approval. It is also unclear if Intel will issue new stock (primary issuance) for Nvidia to purchase, as it did when the U.S. government recently became an Intel shareholder (that is likely). Naturally, the investment is subject to approval from regulators.</p><div><div>Swipe to scroll horizontally</div><div><table tabindex=\"0\"><tbody><tr></tr><tr></tr><tr></tr><tr></tr></tbody></table></div></div><p>The U.S. government says it invested in Intel with the goal of bolstering US technology, manufacturing, and national security, and the investments from the private sector also help solidify the struggling Intel. Altogether, these investments represent a significant cash influx for Intel as it attempts to maintain the heavy cap-ex investments required to compete with TSMC, all while struggling with a negative amount of free cash flow.</p><p>“AI is powering a new industrial revolution and reinventing every layer of the computing stack — from silicon to systems to software. At the heart of this reinvention is Nvidia’s CUDA architecture,” said Nvidia CEO Jensen Huang. “This historic collaboration tightly couples NVIDIA’s AI and accelerated computing stack with Intel’s CPUs and the vast x86 ecosystem—a fusion of two world-class platforms. Together, we will expand our ecosystems and lay the foundation for the next era of computing.”</p><p>“Intel’s x86 architecture has been foundational to modern computing for decades – and we are innovating across our portfolio to enable the workloads of the future,” said Intel CEO Lip-Bu Tan. “Intel’s leading data center and client computing platforms, combined with our process technology, manufacturing and advanced packaging capabilities, will complement Nvidia's AI and accelerated computing leadership to enable new breakthroughs for the industry. We appreciate the confidence Jensen and the Nvidia team have placed in us with their investment and look forward to the work ahead as we innovate for customers and grow our business.”</p>","contentLength":10159,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45288161"},{"title":"Show HN: The text disappears when you screenshot it","url":"https://unscreenshottable.vercel.app/?text=Hello","date":1758161925,"author":"zikero","guid":86145,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45284311"},{"title":"Slack has raised our charges by $195k per year","url":"https://skyfall.dev/posts/slack","date":1758159431,"author":"JustSkyfall","guid":84582,"unread":true,"content":"<p>Turns out that this post went pretty viral on <a href=\"https://news.ycombinator.com/item?id=45283887\">Hacker News</a> and Twitter/X:</p><img width=\"484\" height=\"63\" alt=\"image\" src=\"https://github.com/user-attachments/assets/add9d959-c52c-49d8-8598-296e0111b5f0\"><p>I’m very happy to announce that a couple hours ago, Slack’s CEO got in contact with us and offered to put things right (I can’t exactly say what it is, but it’s better than the plan we were on previously!) A massive thank you to everyone who helped spread awareness - it was incredibly heartwarming to see so many people support us and help get this sorted.</p><p>With that being said though, this ordeal has made us think more deeply about entrusting data with external SaaSes and ensuring that we  our data is definitely going to be a very big priority going forward. I’d encourage you to think the same way!</p><p>For nearly 11 years, Hack Club - a nonprofit that provides coding education and community to teenagers worldwide - has used Slack as the tool for communication. We weren’t freeloaders. A few years ago, when Slack transitioned us from their free nonprofit plan to a $5,000/year arrangement, we happily paid. It was reasonable, and we valued the service they provided to our community.</p><p>However, two days ago, Slack reached out to us and said that if we don’t agree to pay an extra $50k  and $200k a year, they’ll deactivate our Slack workspace and delete all of our message history.</p><p>One could argue that Slack is free to stop providing us the nonprofit offer at any time, but in my opinion, a six month grace period is the  for a massive hike like this, if not more. Essentially, Salesforce (a  company) is strong-arming a small nonprofit for teens, by providing less than a week to pony up a pretty massive sum of money, or risk cutting off all our communications. That’s absurd.</p><p>The small amount of notice has also been catastrophic for the programs that we run. Dozens of our staff and volunteers are now scrambling to update systems, rebuild integrations and migrate  of institutional knowledge. The opportunity cost of this forced migration is simply staggering.</p><img width=\"752\" height=\"55\" alt=\"image\" src=\"https://github.com/user-attachments/assets/48097101-1521-4f50-b970-9557a0b7eefd\"><img width=\"1146\" height=\"103\" alt=\"image\" src=\"https://github.com/user-attachments/assets/f09902a1-42cb-4cd7-9a32-21cdbfb3fd05\"><img width=\"1146\" height=\"134\" alt=\"image\" src=\"https://github.com/user-attachments/assets/dbfc784a-d06b-44d8-a050-ec8c16c5a98b\"><img width=\"611\" height=\"274\" alt=\"image\" src=\"https://github.com/user-attachments/assets/8a41302f-2e5f-41c1-933f-d856094c587a\"><p>Anyway, we’re moving to Mattermost. This experience has taught us that owning your data is incredibly important, and if you’re a small business especially, then I’d advise you move away too.</p><p><em>This post was rushed out because, well, this has been a shock! If you’d like any additional details then feel free to send me an email.</em></p>","contentLength":2288,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45283887"},{"title":"Meta Ray-Ban Display","url":"https://www.meta.com/blog/meta-ray-ban-display-ai-glasses-connect-2025/","date":1758155444,"author":"martpie","guid":86144,"unread":true,"content":"<div>Get Facebook on Your Phone</div><div>Stay connected anytime, anywhere.</div>","contentLength":59,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45283306"},{"title":"ABC yanks Jimmy Kimmel’s show ‘indefinitely’ after threat from FCC chair","url":"https://www.cnn.com/2025/09/17/media/jimmy-kimmel-charlie-kirk-trump-fcc-brendan-carr","date":1758150047,"author":"VikingCoder","guid":86143,"unread":true,"content":"<div data-uri=\"cms.cnn.com/_components/action-bar/instances/cmfof52hj000r2cqf2phhe690@published\" data-label-id-prefix=\"action-bar-start-of-article\" data-editable=\"settings\" data-dynamic-breakpoint-placement=\"{&quot;extraLarge&quot;:{&quot;placement&quot;:&quot;.layout-article-elevate__left&quot;}}\" data-expand-conditions=\"{&quot;follow&quot;:{&quot;extraLarge&quot;:{&quot;alwaysExpand&quot;:true}},&quot;shareOptions&quot;:{&quot;large&quot;:{&quot;maxNumOfActions&quot;:1},&quot;medium&quot;:{&quot;maxNumOfActions&quot;:1},&quot;extraLarge&quot;:{&quot;withAction&quot;:&quot;follow&quot;,&quot;maxNumOfActions&quot;:2}}}\"><div tabindex=\"-1\"><div data-title=\"follow\"><div data-uri=\"cms.cnn.com/_components/follow-topics-bar/instances/cmfof52hj000v2cqf3d6h744e@published\" data-unauth-redirect=\"/account/register/follow\" data-embed-max-topics=\"\"><div><a href=\"https://www.cnn.com/follow\">\n            See all topics</a></div></div></div><div data-title=\"share options\"><div data-uri=\"cms.cnn.com/_components/social-share/instances/cmfof52hj000u2cqf1ljf8tz2@published\"><div data-type=\"share-links\"><a href=\"mailto:?subject=CNN%20content%20share&amp;body=Check%20out%20this%20article%3A%0Ahttps%3A%2F%2Fwww.cnn.com%2F2025%2F09%2F17%2Fmedia%2Fjimmy-kimmel-charlie-kirk-trump-fcc-brendan-carr\" data-type=\"email\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"share with email\" title=\"Share with email\"></a></div></div></div></div></div><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfof52hj000t2cqf8i1xd4vj@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Disney’s ABC is taking Jimmy Kimmel’s late night talk show off the air indefinitely amid a controversy over his recent comments about Charlie Kirk’s suspected killer.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfoke8oo0003356nrlowfw0h@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “Jimmy Kimmel Live will be pre-empted indefinitely,” an ABC spokesperson said, declining to share any further details.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfokdiay0000356nj66ject9@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            A representative for Kimmel did not immediately respond to a request for comment.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfonteni001c356n6iq27oky@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The stunning decision came just a few hours after the Trump administration official responsible for licensing ABC’s local stations publicly pressured the company to punish Kimmel.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfooy2mb001h356nag0og93s@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            At least two major owners of ABC-affiliated stations subsequently said they would preempt Kimmel’s show, sparking speculation that the owners were trying to curry favor with the administration. The local media conglomerates are each seeking mergers that would require administration approval.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfooy2mb001i356nf4eudelz@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            As Kimmel prepared to tape Wednesday night’s episode in Hollywood, ABC decided to pull the plug, much to the astonishment of the entertainment industry.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfooy2mb001j356np6lskld5@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Free speech and free expression groups immediately condemned ABC, calling the suspension cowardly, while President Trump, who frequently sparred with Kimmel, celebrated all the way from the UK, where he is on a state visit.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfonpnn60012356nc2vlvklh@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “Congratulations to ABC for finally having the courage to do what had to be done,” Trump wrote in <a href=\"https://truthsocial.com/@realDonaldTrump/posts/115222372625104790\" target=\"_blank\">a post</a> on his Truth Social platform. “That leaves Jimmy (Fallon) and Seth, two total losers, on Fake News NBC. Their ratings are also horrible. Do it NBC!!!”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfonqkqn0015356n15sbet6y@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The indefinite hiatus underscores how politicized opinions and comments around the murder of conservative activist Charlie Kirk have become, with <a href=\"https://www.cnn.com/2025/09/13/business/charlie-kirk-death-fired-comments\">high-profile campaigns</a> urging employers to fire people who make comments perceived as unflattering about Kirk.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfonrmmn0019356nhq79j9ox@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            And the president has also gone after media companies, specifically, when they displease him, as with a $15 billion defamation lawsuit <a href=\"https://www.cnn.com/2025/09/16/media/trump-lawsuit-new-york-times-hnk\">he filed against the New York Times</a> this week and lawsuits against other outlets.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfoftbjj000a3b6nyb5v4f8t@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            During his Monday evening monologue, Kimmel said the MAGA movement was trying to score political points by trying to prove that Kirk’s alleged killer, Tyler Robinson, was not one of its own.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfom8sq30001356nfuvm6m2g@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “The MAGA Gang (is) desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it,” Kimmel said. “In between the finger-pointing, there was grieving.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfofmxac00003b6nph8nq2g6@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The ABC late-night host’s remarks constituted “the sickest conduct possible,” FCC chair Brendan Carr <a href=\"https://x.com/bennyjohnson/status/1968359685045838041\" target=\"_blank\">told right-wing podcaster</a> Benny Johnson on Wednesday. Carr suggested his FCC could move to revoke ABC affiliate licenses as a way to force Disney to punish Kimmel.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfof5i0u00023b6pm50qexlp@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “We can do this the easy way or the hard way,” Carr said. “These companies can find ways to change conduct and take actions on Kimmel, or there’s going to be additional work for the FCC ahead.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfop0pac001m356nsreb3p6j@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            And speaking on Fox Wednesday night, Carr suggested broadcasters would see more of this kind of pressure in the future.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfoq1pso0020356n4ieh8tbd@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “We at the FCC are going to force the public interest obligation. There are broadcasters out there that don’t like it, they can turn in their license in to the FCC,” Carr said. “But that’s our job. Again, we’re making some progress now.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfokp4kh00093b6ppdlg34sj@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            But Anna Gomez, the lone Democratic commissioner at the FCC, <a href=\"https://x.com/AGomezFCC/status/1968406707484144057\" target=\"_blank\">wrote on X</a> that while “an inexcusable act of political violence by one disturbed individual must never be exploited as justification for broader censorship and control,” the Trump administration “is increasingly using the weight of government power to suppress lawful expression.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfomad4w001b3b6pmpgatxlg@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Speaking with CNN’s Erin Burnett after Kimmel’s show was taken off the air, Gomez said “the First Amendment does not allow us, the FCC, to tell broadcasters what they can broadcast.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfometp1001h3b6plezzm2w3@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “I saw the clip. He did not make any unfounded claims, but he did make a joke, one that others may even find crude, but that is neither illegal nor grounds for companies to capitulate to this administration in ways that violate the First Amendment,” Gomez told CNN. “This sets a dangerous new precedent, and companies must stand firm against any efforts to trade away First Amendment freedom.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfooy11h001f356nftyfhntk@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Pro-Trump websites and TV shows began to criticize Kimmel for his remarks on Tuesday, and as the story gained traction on Wednesday, some owners of ABC-affiliated stations felt compelled to speak out.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfop0qym001o356nr8y9h5qx@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Nexstar, which operates about two dozen ABC affiliates, issued a press release saying it “strongly objects” to Kimmel’s remarks and saying its stations would “replace the show with other programming in its ABC-affiliated markets.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfop0qym001q356nb85iqren@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Minutes after Nexstar criticized Kimmel publicly, ABC said the show was being yanked nationwide.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfop0qym001r356nxcqw09li@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Later in the evening, another big station group, Sinclair, said it had also told ABC that it was preempting Kimmel’s show on its ABC-affiliated stations before the network announced its nationwide decision.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfop0qym001s356n9pnzecqn@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Sinclair, too, has business pending before the Trump administration, and it made a bid for Tegna a day before Nexstar stepped in with its bid. ﻿The company announced Wednesday night that it will air a one-hour special tribute to Kirk on Friday night in Kimmel’s usual time slot.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfor8ckb0000356narn157do@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Following ABC’s action to indefinitely pull Kimmel’s show off the air, Sinclair issued a <a href=\"https://x.com/WeAreSinclair/status/1968471160359645658\" target=\"_blank\">statement </a>saying the late-night host’s suspension “is not enough” and called on the network, the FCC and Kimmel to go further.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmforrmxr0008356ndrsvn39x@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “Sinclair will not lift the suspension of Jimmy Kimmel Live! on our stations until formal discussions are held with ABC regarding the network’s commitment to professionalism and accountability,” the company said in its statement. “Regardless of ABC’s plans for the future of the program, Sinclair intends not to return Jimmy Kimmel Live! to our air until we are confident that appropriate steps have been taken to uphold the standards expected of a national broadcast platform.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmforumep000d356nfimzhjzs@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Sinclair said it demanded Kimmel directly apologize to the Kirk family and make a “meaningful” donation to Kirk’s family and his organization, Turning Point USA.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfokmchv00023b6pcbju0bp3@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The FCC regulates the public airwaves, including broadcast signals and content. Before Trump appointed Carr to lead the agency, the FCC, for the most part, had taken a hands-off approach to broadcasters’ political content in recent years.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfos306d000j356nhe8rkkbo@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            But Carr has taken a broader view of the FCC’s remit to serve the public interest, and has served as a political attack dog for Trump, threatening his perceived enemies in the broadcast media.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfort84k000b356n1arz5z29@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “I can’t imagine another time when we’ve had local broadcasters tell a national programmer like Disney that your content no longer meets the needs and the values of our community,” Carr told Fox News’ Sean Hannity on Wednesday. “So this is an important turning point.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmforxtl6000h356neg63u1zf@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            The Center for American Rights, which has previously lodged bias complaints against NBC, ABC and CBS, on Wednesday filed a complaint with the FCC over Kimmel’s comments, writing that “it is no defense to say that Kimmel was engaging in satire or late-night comedy rather than traditional news.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfokt1rd000c3b6pphqh5z2w@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “ABC’s affiliates need to step up and hold ABC accountable as a network for passing through material that fails to respect the public-interest standard to which they are held,” Daniel Suhr, president of the Center for American Rights, wrote in the complaint. “Disney as ABC’s corporate owner needs to act directly to correct this problem.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfotuqnd0000356n7pi5db3i@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            SAG-AFTRA, the actors union, said Wednesday night that it “condemns” the suspension of Kimmel’s show.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfoty5zd0004356ner24fc8s@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “Our society depends on freedom of expression. Suppression of free speech and retaliation for speaking out on significant issues of public concern run counter to the fundamental rights we all rely on,” the union said in its statement.\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfoty5zd0006356naohp7ct1@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            “The decision to suspend airing Jimmy Kimmel Live! is the type of suppression and retaliation that endangers everyone’s freedoms.”\n    </p><p data-uri=\"cms.cnn.com/_components/paragraph/instances/cmfokl8tu000l356n1r4zcakr@published\" data-editable=\"text\" data-component-name=\"paragraph\" data-article-gutter=\"true\">\n            Kimmel has also been a frequent target of President Trump’s ire. Shortly after CBS announced the cancellation of Stephen Colbert’s late-night talk show — a move <a href=\"https://x.com/BrendanCarrFCC/status/1947630093540724934\" target=\"_blank\">Carr publicly celebrated</a> — Trump <a href=\"https://truthsocial.com/@realDonaldTrump/posts/114938657898917536\" target=\"_blank\">suggested</a> that “Next up will be an even less talented Jimmy Kimmel.”\n    </p>","contentLength":8907,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45282482"},{"title":"WASM 3.0 Completed","url":"https://webassembly.org/news/2025-09-17-wasm-3.0/","date":1758133013,"author":"todsacerdoti","guid":85041,"unread":true,"content":"<p>Three years ago,\n<a href=\"https://webassembly.org/news/2025-03-20-wasm-2.0/\">version 2.0</a> of the Wasm\nstandard was (essentially) finished, which brought a number of new features,\nsuch as vector instructions, bulk memory operations, multiple return values, and\nsimple reference types.</p><p>In the meantime, the Wasm W3C Community Group and Working Group have not been\nlazy. Today, we are happy to announce the release of\n<a href=\"https://webassembly.github.io/spec/\">Wasm 3.0</a> as the new “live” standard.</p><p>This is a substantially larger update: several big features, some of which have\nbeen in the making for six or eight years, finally made it over the finishing\nline.</p><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/memory64/Overview.md\"></a>\nMemories and tables can now be declared to use  as their address type\ninstead of just . That expands the available address space of Wasm\napplications from 4 gigabytes to (theoretically) 16 exabytes, to the extent\nthat physical hardware allows. While the web will necessarily keep enforcing\ncertain limits — on the web, a 64-bit memory is limited to 16 gigabytes — the\nnew flexibility is especially interesting for non-web ecosystems using Wasm,\nas they can support much, much larger applications and data sets now.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/multi-memory/Overview.md\"></a>\nContrary to popular belief, Wasm applications were always able to use multiple\nmemory objects — and hence multiple address spaces — simultaneously. However,\npreviously that was only possible by declaring and accessing each of them in\nseparate modules. This gap has been closed, a single module can now declare\n(define or import) multiple memories and directly access them, including\ndirectly copying data between them. This finally allows tools like wasm-merge,\nwhich perform “static linking” on two or more Wasm modules by merging them\ninto one, to work for  Wasm modules. It also paves the way for new uses\nof separate address spaces, e.g., for security (separating private data), for\nbuffering, or for instrumentation.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/gc/Overview.md\"></a>\nIn addition to expanding the capabilities of raw linear memories, Wasm also\nadds support for a new (and separate) form of storage that is automatically\nmanaged by the Wasm runtime via a garbage collector. Staying true to the\nspirit of Wasm as a low-level language, Wasm GC is low-level as well: a\ncompiler targeting Wasm can declare the memory layout of its runtime data\nstructures in terms of struct and array types, plus unboxed tagged integers,\nwhose allocation and lifetime is then handled by Wasm. But that’s it.\nEverything else, such as engineering suitable representations for\nsource-language values, including implementation details like method tables,\nremains the responsibility of compilers targeting Wasm. There are no built-in\nobject systems, nor closures or other higher-level constructs — which would\ninevitably be heavily biased towards specific languages. Instead, Wasm only\nprovides the basic building blocks for representing such constructs and\nfocuses purely on the memory management aspect.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/function-references/Overview.md\"></a>\nThe GC extension is built upon a substantial extension to the Wasm type\nsystem, which now supports much richer forms of references. Reference types\ncan now describe the exact shape of the referenced heap value, avoiding\nadditional runtime checks that would otherwise be needed to ensure safety.\nThis more expressive typing mechanism, including subtyping and type recursion,\nis also available for function references, making it possible to perform safe\nindirect function calls without any runtime type or bounds check, through the\nnew  instruction.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/tail-call/Overview.md\"></a>\nTail calls are a variant of function calls that immediately exit the current\nfunction, and thereby avoid taking up additional stack space. Tail calls are\nan important mechanism that is used in various language implementations both\nin user-visible ways (e.g., in functional languages) and for internal\ntechniques (e.g., to implement stubs). Wasm tail calls are fully general and\nwork for callees both selected statically (by function index) and dynamically\n(by reference or table).</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/exception-handling/Exceptions.md\"></a>\nExceptions provide a way to locally abort execution, and are a common feature\nin modern programming languages. Previously, there was no efficient way to\ncompile exception handling to Wasm, and existing compilers typically resorted\nto convoluted ways of implementing them by escaping to the host language,\ne.g., JavaScript. This was neither portable nor efficient. Wasm 3.0 hence\nprovides native exception handling within Wasm. Exceptions are defined by\ndeclaring exception tags with associated payload data. As one would expect, an\nexception can be thrown, and selectively be caught by a surrounding handler,\nbased on its tag. Exception handlers are a new form of block instruction that\nincludes a dispatch list of tag/label pairs or catch-all labels to define\nwhere to jump when an exception occurs.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/relaxed-simd/Overview.md\"><em>Relaxed vector instructions.</em></a>\nWasm 2.0 added a large set of vector (SIMD) instructions, but due to\ndifferences in hardware, some of these instructions have to do extra work on\nsome platforms to achieve the specified semantics. In order to squeeze out\nmaximum performance, Wasm 3.0 introduces “relaxed” variants of these\ninstructions that are allowed to have implementation-dependent behavior in\ncertain edge cases. This behavior must be selected from a pre-specified set of\nlegal choices.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/profiles/blob/main/proposals/profiles/Overview.md\"></a>\nTo make up for the added semantic fuzziness of relaxed vector instructions,\nand in order to support settings that demand or need deterministic execution\nsemantics (such as blockchains, or replayable systems), the Wasm standard now\nspecifies a deterministic default behavior for every instruction with\notherwise non-deterministic results — currently, this includes floating-point\noperators and their generated NaN values and the aforementioned relaxed vector\ninstructions. Between platforms choosing to implement this deterministic\nexecution profile, Wasm thereby is fully deterministic, reproducible, and\nportable.</li></ul><ul><li><a href=\"https://github.com/WebAssembly/spec/blob/wasm-3.0/proposals/annotations/Overview.md\"><em>Custom annotation syntax.</em></a>\nFinally, the Wasm text format has been enriched with generic syntax for\nplacing annotations in Wasm source code. Analogous to custom sections in the\nbinary format, these annotations are not assigned any meaning by the Wasm\nstandard itself, and can be chosen to be ignored by implementations. However,\nthey provide a way to represent the information stored in custom sections in\nhuman-readable and writable form, and concrete annotations can be specified by\ndownstream standards.</li></ul><p>In addition to these core features, embeddings of Wasm into JavaScript benefit\nfrom a new extension to the JS API:</p><ul><li><a href=\"https://github.com/WebAssembly/js-string-builtins/blob/main/proposals/js-string-builtins/Overview.md\"></a>\nJavaScript string values can already be passed to Wasm as externrefs.\nFunctions from this new primitive library can be imported into a Wasm module\nto directly access and manipulate such external string values inside Wasm.</li></ul><p>With these new features, Wasm has much better support for compiling high-level\nprogramming languages. Enabled by this, we have seen various new languages\npopping up to target Wasm, such as\n<a href=\"https://github.com/google/j2cl/blob/master/docs/getting-started-j2wasm.md\">Java</a>,\n<a href=\"https://dune.readthedocs.io/en/stable/wasmoo.html\">OCaml</a>,\n<a href=\"https://www.scala-js.org/doc/project/webassembly.html\">Scala</a>,\n<a href=\"https://kotlinlang.org/docs/wasm-overview.html\">Kotlin</a>,\n<a href=\"https://spritely.institute/hoot/\">Scheme</a>, or\n<a href=\"https://dart.dev/web/wasm\">Dart</a>, all of which use the new GC feature.</p><p>On top of all these goodies, Wasm 3.0 also is the first version of the standard\nthat has been produced with the new\n<a href=\"https://webassembly.org/news/2025-03-27-spectec/\">SpecTec</a> tool chain. We\nbelieve that this makes for an even more reliable specification.</p><p>Wasm 3.0 is already shipping in most major web browsers, and support in\nstand-alone engines like Wasmtime is on track to completion as well. The\n<a href=\"https://webassembly.org/features/\">Wasm feature status</a> page tracks support\nacross engines.</p>","contentLength":7271,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45279384"},{"title":"Apple Photos app corrupts images","url":"https://tenderlovemaking.com/2025/09/17/apple-photos-app-corrupts-images/","date":1758107264,"author":"pattyj","guid":84387,"unread":true,"content":"<p>The Apple Photos app sometimes corrupts images when importing from my camera.\nI just wanted to make a blog post about it in case anyone else runs into the problem.\nI’ve seen other references to this online, but most of the people gave up trying to fix it, and none of them went as far as I did to debug the issue.</p><p>I’ll try to describe the problem, and the things I’ve tried to do to fix it.\nBut also note that I’ve (sort of) given up on the Photos app too.\nSince I can’t trust it to import photos from my camera, I switched to a different workflow.</p><p>Here is a screenshot of a corrupted image in the Photos app:</p><h2>How I used to import images</h2><p>I’ve got an <a href=\"https://en.wikipedia.org/wiki/OM_System_OM-1\">OM System OM-1</a> camera.\nI used to shoot in RAW + jpg, then when I would import to Photos app, I would check the “delete photos after import” checkbox in order to empty the SD card.\nTurns out “delete after import” was a huge mistake.</p><p>I’m pretty sure I’d been getting corrupted images for a while, but it would only be 1 or 2 images out of thousands, so I thought nothing of it (it was probably my fault anyway, right?)</p><p>But the problem really got me upset when last year I went to a family member’s wedding and took tons of photos.\nApple Photos combines RAW + jpg photos so you don’t have a bunch of duplicates, and when you view the images in the photos app, it just shows you the jpg version by default.\nAfter I imported all of the wedding photos I noticed some of them were corrupted.\nUpon closer inspection, I found that it sometimes had corrupted the jpg, sometimes corrupted the RAW file, and sometimes both.\nSince I had been checking the “delete after import” box, I didn’t know if the images on the SD card were corrupted  importing or not.\nAfter all, the files had been deleted so there was no way to check.</p><p>I estimate I completely lost about 30% of the images I took that day.</p><p>Losing so many photos really rattled me, but I wanted to figure out the problem so I didn’t lose images in the future.</p><h2>Narrowing down the problem</h2><p>I was worried this was somehow a hardware problem.\nCopying files seems so basic, I didn’t think there was any way a massively deployed app like Photos could fuck it up (especially since its main job is managing photo files).\nSo, to narrow down the issue I changed out all of the hardware.\nHere are all the things I did:</p><ul><li>Bought a new SD card direct from the manufacturer (to eliminate the possibility of buying a bootleg SD card)</li><li>Switched to only shooting in RAW (if importing messes up 30% of my images, but I cut the number of images I import by half, then that should be fewer corrupted images right? lol)</li><li>Bought a new camera: the OM System OM-1 MKii</li></ul><p>I did each of these steps over time, as to only change one variable at a time, and still the image corruption persisted.\nI didn’t really want to buy a new camera, the MKii is not really a big improvement over the OM-1, but we had a family trip coming up and the idea that pressing the shutter button on the camera might not actually record the image didn’t sit well with me.</p><p>Since I had replaced literally all of the hardware involved, I knew it must be a software problem.\nI stopped checking the “delete after import” button, and started reviewing all of the photos after import.\nAfter verifying none of them were corrupt, then I would format the SD card.\nI did this for months without finding any corrupt files.\nAt this point I figured it was somehow a race condition or something when copying the photo files and deleting them at the same time.</p><p>However, after I got home from RailsConf and imported my photos, I found one corrupt image (the one above).\nI was able to verify that the image was  corrupt on the SD card, so the camera was working fine (meaning I probably didn’t need to buy a new camera body at all).</p><p>I tried deleting the corrupt file and re-importing the original to see if it was something about that particular image, but it re-imported just fine.\nIn other words, it seems like the Photos app will corrupt files randomly.</p><p>I don’t know if this is a problem that is specific to OM System cameras, and I’m not particularly interested in investing in a new camera system just to find out.</p><p>If I compare the corrupted image with the non-corrupted image, the file sizes are exactly the same, but the bytes are different:</p><pre tabindex=\"0\"><code>aaron@tc ~/Downloads&gt; md5sum P7110136-from-camera.ORF Exports/P7110136.ORF \n17ce895fd809a43bad1fe8832c811848  P7110136-from-camera.ORF\n828a33005f6b71aea16d9c2f2991a997  Exports/P7110136.ORF\n</code></pre><pre tabindex=\"0\"><code>aaron@tc ~/Downloads&gt; ls -al P7110136-from-camera.ORF Exports/P7110136.ORF\n-rw-------@ 1 aaron  staff  18673943 Jul 12 04:38 Exports/P7110136.ORF\n-rwx------  1 aaron  staff  18673943 Jul 17 09:29 P7110136-from-camera.ORF*\n</code></pre><p>The  is the non-corrupted file, and  is the corrupted file from Photos app.\nHere’s a screenshot of the preview of the non-corrupted photo:</p><p>I’m not going to put any more effort into debugging this problem, but I wanted to blog about it in case anyone else is seeing the issue.\nI take a lot of photos, and to be frank, most of them are not very good.\nI don’t want to look through a bunch of bad photos every time I look at my library, so culling photos is important.\nCulling photos in the Photos app is way too cumbersome, so I’ve switched to using <a href=\"https://www.darktable.org\">Darktable</a>.</p><ul><li>Import images to Darktable</li><li>Delete the ones I don’t like</li><li>Export both the jpg and the original raw file</li><li>Import those to the Photos app so they’re easy to view and share</li><li>Periodically format my SD card</li></ul><p>I’ve not seen any file corruption when importing to Darktable, so I am convinced this is a problem with the Photos app.\nBut now, since all of my images land in Darktable before making their way to the Photos app, I don’t really care anymore.\nThe bad news is that I’ve spent a lot of time and money trying to debug this.\nI guess the good news is that now I have redundant hardware!</p>","contentLength":5858,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45274277"},{"title":"The Asus gaming laptop ACPI firmware bug","url":"https://github.com/Zephkek/Asus-ROG-Aml-Deep-Dive","date":1758081276,"author":"signa11","guid":86142,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45271484"},{"title":"GNU Midnight Commander","url":"https://midnight-commander.org/","date":1758081246,"author":"pykello","guid":86141,"unread":true,"content":"<p>GNU Midnight Commander (or ) is a visual, dual-pane file manager. It is released under the GNU General Public License and therefore qualifies as Free Software.</p><p>Midnight Commander is a feature-rich, full-screen, text-mode application that allows you to copy, move, and delete files and entire directory trees, search for files, and execute commands in the subshell. Internal viewer, editor and diff viewer are included.</p><p> uses versatile text interface libraries such as <a href=\"https://invisible-island.net/ncurses/\">ncurses</a> or <a href=\"https://www.jedsoft.org/slang/\">S-Lang</a>, which allows it to work on a regular console, inside an X Window terminal, over  connections, and in all kinds of remote shells.</p><p>The easiest way to install  is to use your system package manager:</p><p>The primary way to learn about  is to use the context-sensitive online help available via .</p><p>We also have extensive manual pages, which are the primary source of official documentation:</p><p>Midnight Commander supports theming! Check out the skins that come with the distribution or develop your own:</p>","contentLength":971,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45271481"},{"title":"Denmark close to wiping out cancer-causing HPV strains after vaccine roll-out","url":"https://www.gavi.org/vaccineswork/denmark-close-wiping-out-leading-cancer-causing-hpv-strains-after-vaccine-roll-out","date":1758046349,"author":"slu","guid":84135,"unread":true,"content":"<p>Denmark has effectively eliminated infections with the two biggest cancer-causing strains of human papillomavirus (HPV) since the vaccine was introduced in 2008, data suggests.</p><p>The research, published in <a href=\"https://www.eurosurveillance.org/content/10.2807/1560-7917.ES.2025.30.27.2400820\"></a>, could have implications for how vaccinated populations are screened in the coming years – particularly as people increasingly receive vaccines that protect against multiple high-risk types of HPV virus.</p><p>After breast cancer, cervical cancer is the most common type of cancer among women aged 15 to 44 years in Europe, and human papillomavirus (HPV) is the leading cause.</p><p>At least 14 high-risk types of the virus have been identified, and before Denmark introduced the HPV vaccine in 2008, HPV types 16 and 18 accounted for around three quarters (74%) of cervical cancers in the country.</p><p>Initially, girls were offered a vaccine that protected against four types of HPV: 16, 18, plus the lower risk types 6 and 11. However, since 2017, Danish girls have been offered a vaccine that protects against nine types of HPV – including those accounting for approximately 90% of cervical cancers.&nbsp; &nbsp;&nbsp;</p><p>To better understand the impact that these vaccination programmes have had on HPV prevalence as vaccinated girls reach cervical screening age (23 to 64 years in Denmark), Dr Mette Hartmann Nonboe at Zealand University Hospital in Nykøbing Falster and colleagues analysed up to three consecutive cervical cell samples collected from Danish women between 2017 and 2024, when they were 22 to 30 years of age.</p><p>“In 2017, one of the first birth cohorts of women in Denmark who were HPV-vaccinated as teenage girls in 2008 reached the screening age of 23 years,” Nonboe explained.</p><p>“Compared with previous generations, these women are expected to have a considerably lower risk of cervical cancer, and it is pertinent to assess [their] future need for screening.”</p><h3>High-risk HPV elimination</h3><p>The research found that infection with the high-risk HPV types (HPV16/18) covered by the vaccine has been almost eliminated.&nbsp;</p><p>“Before vaccination, the prevalence of HPV16/18 was between 15 and 17%, which has decreased in vaccinated women to less than one percent by 2021,” the researchers said.</p><p>In addition, prevalence of HPV types 16 and 18 in women who had not been vaccinated against HPV was five percent. This strongly suggests that the vaccine has reduced the circulation of these HPV types in general population, to the extent that even unvaccinated women are now less likely to be infected with them – so called “population immunity” – the researchers said.</p><p>Despite this good news, roughly one third of women screened during the study period still had infection with high-risk HPV types not covered by the original vaccines – and new infections with these types were more frequent among vaccinated women, compared to unvaccinated ones.</p><p>This is expected to fall once girls who received the more recent ‘nine-valent’ vaccine reach screening age. At this point, the screening guidelines should potentially be reconsidered, Nonboe and colleagues said.</p>","contentLength":3054,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45265745"},{"title":"Waymo has received our pilot permit allowing for commercial operations at SFO","url":"https://waymo.com/blog/#short-all-systems-go-at-sfo-waymo-has-received-our-pilot-permit","date":1758040688,"author":"ChrisArchitect","guid":86140,"unread":true,"content":"<p>All systems go at SFO! Waymo has received our pilot permit allowing for commercial operations at San Francisco International Airport.</p><p>We’ll partner with SFO to prepare our operations at the airport in phases, beginning with employee testing soon ahead of welcoming Bay Area riders. Pickups and dropoffs will initially start at SFO’s Kiss &amp; Fly area – a short AirTrain ride from the terminals – with the intention to explore other locations at the airport in the future.</p><p>This is a major milestone that strengthens Waymo’s impact on the region and offers residents and visitors an innovative way to travel. With years of experience serving riders at Phoenix Sky Harbor (PHX) and operations beginning soon at San Jose Mineta International Airport (SJC), we’re accelerating our efforts to serve more airports in more cities as we scale.</p><p>“Across San Francisco, we are expanding safe, reliable, and modern transportation options—supporting our city’s economic comeback, boosting our tourism industry, and connecting residents and visitors to everything our city has to offer,” said Mayor Lurie. “We announced in March that we wanted visitors to be able to ride in a Waymo as soon as they arrived in San Francisco, and today, we are taking another important step to get there.”</p><p>“Bringing the Waymo experience to San Francisco International Airport is about more than just a ride—it’s about providing a safe, reliable, magical way for Bay Area residents and global visitors to connect with the places and people that matter most,” said Tekedra Mawakana, co-CEO, Waymo. “We’re grateful for the partnership with SFO and the vision of Mayor Lurie in making this a reality.”</p>","contentLength":1696,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45264562"},{"title":"I’m Not a Robot","url":"https://neal.fun/not-a-robot/","date":1758034044,"author":"meetpateltech","guid":86139,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45263035"},{"title":"Things you can do with a Software Defined Radio (2024)","url":"https://blinry.org/50-things-with-sdr/","date":1758033319,"author":"mihau","guid":84115,"unread":true,"content":"<p>Last week, I went on an adventure through the electromagnetic spectrum!</p><p>It’s like an invisible world that always surrounds us, and allows us to do many amazing things: It’s how radio and TV are transmitted, it’s how we communicate using Wi-Fi or our phones. And there are many more things to discover there, from all over the world.</p><p>In this post, I’ll show you fifty things you can find there – all you need is this simple USB dongle and an antenna kit!</p><h2>The “Make 50 of Something” technique</h2><p>I found that a very exciting experience – trying to make so many new things really pushed me to leave my comfort zone, to be creative, and not to get sucked into rabbit holes too deep.</p><p>I knew I definitely wanted to try the technique again. So, when I took a week of vacation, I decided to try to find 50 things to do with a Software Defined Radio!</p><p>A Software Defined Radio is essentially a radio that relies on a computer to do most of its data processing. It doesn’t rely on analog hardware too much – instead, most of what is does is “defined in software”, hence the name.</p><p>Usually, SDRs can detect electromagnetic waves in a much wider range than a common FM radio, which makes it especially exciting! I got interested in SDRs after reading about <a href=\"https://community.frame.work/t/rtl-sdr-expansion-card/37098/15\">Albert’s project</a> to build one as a module for the Framework laptop!</p><p>I went into this week without much knowledge of the things I’d find. I’d read through a introductory course for aspiring amateur radio operators (more on that later), but I barely knew which way to point my antenna.</p><p>If you want to follow along, this section is intended to help you get started!</p><p>Most of the 50 things also have a little infobox at the beginning, explaining the frequencies, and some special knowledge needed to receive them.</p><p>I looked into the topic a bit, and a popular, cheap SDR right now is the <a href=\"https://www.rtl-sdr.com/rtl-sdr-blog-v4-dongle-initial-release/\"></a>, which has the form factor of a simple SUB dongle. You can get it for around $30, or as a kit with telescopic antennas for $50.</p><p>Everything I tried during this week was done using this USB dongle, the antenna kit, and a long piece of wire!</p><p>(By the way, there’s another great option if you don’t want to buy anything – lots of people make their SDR accessible through the Internet! You can find a map <a href=\"https://rx-tx.info/map-sdr-points\">here</a>.)</p><p>I tried to adjust my antenna to the desired frequencies as best as I could. I think for receiving, it’s not super important that your antenna is perfectly configured, though.</p><p>For most applications, I used the dipole antennas that came with the kit I purchased. Dipole antennas have two sides that stick out the same length. You generally wanna make the whole antenna half as long as the wave length you want to receive, and orient it vertically.</p><p>My rule of thumb was to divide 72 by the frequency in MHz, and take that as the length of each side of the dipole in meters. That’d make the whole antenna a bit shorter than half of the wavelength.</p><p>For example, this is what the configuration looked like for frequencies around 100 MHz:</p><p>And for higher frequencies, I used the tiny screw-on antennas from the kit:</p><p>For specific applications like receiving satellites, or receiving locators for airplanes, I used special configurations, but I’ll discuss these as we go!</p><p>The software I liked best, and which I used for many things, was <a href=\"https://www.sdrpp.org\">SDR++</a>. It allows you to explore the frequency spectrum very smoothly, and has a modern user interface!</p><p>But I also used plenty of other software, on Linux in my case. I’ll link to the software as needed below.</p><p>On Monday morning, I was excited to start this project! I sat down at my desk, and got to work!</p><ul><li> FM (“frequency modulation”)</li></ul><p>This as an obvious first thing to do, as the signals are very strong! I was using the SDR++ software, and it felt very nice browsing around and discovering the stations around me! It reminded me of exploring the radio as a child.</p><p>I found a local station that gives 1-hour slots to civic groups, for example!</p><ul><li> 149.01-149.11 MHz</li></ul><p>This is a special frequency range in Germany: Anyone is allowed to send there, using licensed devices. There are 6 channels.</p><p>I think someone was testing their device there when I listened in. :D I heard a “Hellooo?”, then a “Test, test”, and then a “General call to all stations”. Oh, and shortly after a short transmission on channel 3 in a Slavic-sounding language!</p><p>Freenet devices have a range of only a couple of kilometers, so these people must have been pretty close! :O</p><h3>3: Receive weather conditions from airports</h3><ul><li> Differs by airport, search term is “ATIS”</li></ul><p>While browsing the aviation frequencies, I found this station that reports weather conditions in an endless loop. It seems to be the “Automatic Terminal Information Service” of Hamburg airport!</p><p>Thanks to that, I found out that the current air pressure was 1011 hPa! :D</p><p>Listening to “messages not meant for the general public” is <a href=\"https://www.buzer.de/5_TTDSG.htm\">not allowed</a> in Germany, so of course I didn’t do that. And if I had accidentally done that, I wouldn’t be allowed to tell you about it. 🙅</p><h3>5: Track aircraft via ADS-B</h3><ul></ul><p>That’s short for “Automatic Dependent Surveillance – Broadcast”. Aircraft send it automatically to be tracked.</p><p>For this, I built my first antenna! From wire and and an antenna connector called “SMA”.</p><p>And it worked! \\o/ I decoded the signal using the software <a href=\"https://www.sdrangel.org\">SDRangel</a>. Fascinating! I saw some big &amp; small airplanes, and even a helicopter!</p><h3>6: Listen to  FM radio</h3><ul></ul><p>How stereo audio is transmitted is really interesting, because it’s backwards-compatible to receivers that don’t support it:</p><p>Here, you see the demodulated audio frequency spectrum, as shown in SDRangel. Below 19k Hz, it’s just mono audio. Then, to mark a stereo station, there’s a constant “pilot tone” at 19k Hz! (Outside of what most humans can hear.)</p><p>Then, if you double the frequency of the pilot tone, you can derive the sections where the difference of the left &amp; right channel to the mono channel is transmitted!</p><p> I’ve been told that instead of what I call “left” and “right” in this diagram, the upper frequencies transmit the <em>difference of the left and right channels</em>! That way, the receiver can calculate the left and right channels from the mono signal (which is, esseutially, the  of left and right).</p><p>If you  the frequency of the pilot tone, you get to a range where FM stations transmit small amounts of digital metadata, like the name and genre of the station, and the current song! That’s a protocol called Radio Data System.</p><p>This system can also transmit road traffic information! There seemed to be a road closure at “0x64BE”, as decoded by SDRangel.</p><p>The Federal Highway Research Institute <a href=\"https://www.bast.de/BASt_2017/DE/Verkehrstechnik/Fachthemen/v2-LCL/location-code-list-start_node.html\">publishes</a> an Excel table, where I could look up that this is a town in Lower Saxony!</p><h3>8: Listen to conversations on the 2-meter amateur radio band</h3><ul></ul><p>This is a frequency range reserved for amateur radio operators – for non-commercial use only. You may send on this band after getting a license.</p><p>What I found here is seemingly a conversation circle facilitated by a relay around 15 km away from here – it takes input on a certain frequency, and outputs an amplified copy of it on another frequency! Klaus, Bernd, Jürgen and Horst were talking about antennas, relays, and Windows XP! 😁</p><h3>9: Listen to digital radio</h3><p>The SDRangel software also has a demodulator for Digital Audio Broadcast! :O I continue to be amazed by it!</p><p>I think this was the first time I’ve received digital radio via air! I saw so many stations, and I’ve only checked a couple of channels.</p><p>The advantage of this digital channel is that there’s no noise. And I even saw a “cover image” in one of the programs!</p><ul><li> 446.0-446.2 MHz</li></ul><p>This is a frequency range for “Private Mobile Radio”. It’s another of these bands where anyone can transmit using a licensed device!</p><p>Not a lot of activity here. I heard “Hello, hellooo!”, “Can you hear me?” and some short transmissions that sounded like a child! :D</p><p>There also seemed to be digital transmissions, but I didn’t know how to decode them yet.</p><p>The range of PMR446 devices is pretty low (a couple of hundred metres in cities), so again, the people must’ve been close!</p><p>After the first day of SDR experiments, I was amazed how much invisible communication is going on around us in the electromagnetic spectrum at the same time!</p><p>I posted each of these things <a href=\"https://chaos.social/@blinry/112036984423655020\">on Mastodon</a> as I went, and asked people for suggestions for more things I could receive.</p><h3>11: Read your neighbors’ sensors</h3><ul><li> 433.05-434.79 MHz</li></ul><p>At 433 MHz, there’s a frequency band for “industrial, scientific and medical” applications. And wow, there was quite a lot of activity nearby!</p><p>Using the decoder <a href=\"https://github.com/merbanan/rtl_433\">rtl_433</a>, I saw two sensors that output the current temperature, humidity, and air pressure!</p><p>There were also some “IBIS beacons” flying by, which are used in public transportation, so maybe it’s buses driving by?</p><p>Later, an “Interlogix Security” device also appeared, reporting “closed switch states” :O</p><p>Ships send out their status using AIS (Automatic Identification System). And again, I received  of them here in Hamburg! :O</p><p>I was especially excited to receive data from the <a href=\"https://www.stubnitz.com/\">MS Stubnitz</a> (a fisher boat that was turned into a culture center/techno club)! It reports its status as “moored”, and its speed as 0.1 knots! :D</p><p>Again, I used the software SDRangel. Apparently, it can also display a 3D map, but I haven’t figured out how to add 3D models…</p><ul><li> 876-959 MHz, I looked up the specific ranges for Germany <a href=\"https://de.wikipedia.org/wiki/Global_System_for_Mobile_Communications#Situation_in_Deutschland\">on Wikipedia</a></li></ul><p>I was curious whether you could tell if someone used their phone! So I borrowed a GSM phone, tuned to the correct frequencies, and made some test calls.</p><p>What surprised me most: You can kind of “see” the volume at which I was talking!?</p><p>In the recording, the three dense bands at the end were when I was humming into the phone at the other end. This only worked in the “receiving” direction.</p><h3>14: Receive signals from a satellite!</h3><p>I spent all Tuesday afternoon and evening learning about satellites. The program <a href=\"https://oz9aec.dk/gpredict/\">gpredict</a> is really nice to find out when satellites will pass overhead! I learned a lot, including that one satellite I was trying to receive burned up last week! :D</p><p>I was super excited when I first received a signal from a NOAA satellite! 🛰️</p><p>But I didn’t manage to decode it properly yet. Maybe my reception was too noisy? I wanted to keep trying, but I had to move on.</p><p>In Germany, the police has switched to an encrypted digital protocol called TETRA.</p><p>Even though I’ve seen some interesting talks at CCC events about weaknesses in the decryption, all I wanted to do for now is looking at the pretty signals in SDR++. :3</p><h3>16: Listen to taxi dispatchers</h3><p>Again, this is communication not meant for the general public.</p><p>I didn’t listen to someone dispatching taxis to specific addresses, and you also shouldn’t do that either. 🚕</p><p>Stay away from a site called “frequenzdatenbank”!</p><h3>17: Ponder mysterious signals</h3><p>Some of the most fun I had was just browsing frequencies and seeing what I can find! Sometimes, I encountered signals I can’t identify.</p><p>For example, at 865-868 MHz, there was a family of slow, continuous, digital signals that made a nice melody when listened to in single-sideband demodulation!</p><p>And at 177-180 MHz, there were two very broadband transmissions. Might be TV? But I couldn’t find out what type. (It later turned out that I’d already listened to these signals – it was digital radio, DAB+.)</p><h3>18: Track weather balloons</h3><p>As I was browsing around for things to receive, I saw on this <a href=\"https://s1.radiosondy.info\">tracking website</a> that a radiosonde was just launched in Hamburg! SDRangel could decode its transmission! It had climbed to a height of 7 km, and it’s -17 °C there!</p><p>I knew that it would eventually burst and fall back to Earth, and that I could try to get to it and find it!</p><p>I decided to go on a field trip, using trains and my bike.</p><p>I was following the tracker. The balloon popped earlier than predicted, and I frantically changed travel plans!</p><p>Eventually, it landed in a forest. I hoped I could get to it! What made this adventure more tricky was that my mobile Internet contract ran out while I was on the go, and my battery was also almost empty.</p><p>But I made it to the forest, and entered it.</p><p>As I circled the site, I encountered a person in their 60s, with a stubbly beard and a blue wool hat. He was looking in the direction of the crash site, and was holding a smartphone, so I asked him whether he also was looking for the radiosonde.</p><p>He was! We looked for it together for half an hour, jumping over small rivers and crawling through the woods, while he gave me a lot of tips related to hunting sondes.</p><p>He told me that he had found around 40 of them so far!</p><p>Usually, the sondes keep broadcasting after landing, but this one wasn’t. So he quickly guessed that someone else could’ve taken it. Or maybe it landed in the water and died?</p><p>Some pictures of the area we searched:</p><p>Eventually, we gave up, and walked back to our vehicles. He also is an amateur radio operator, and could answer a couple of questions related to building antennas!</p><p>And he was right: Someone had been faster than us! The status <a href=\"https://radiosondy.info/sonde_archive.php?sondenumber=V2930794\">was changed</a>. So in the end, I didn’t find the sonde. But something that might be even better – a friend!</p><h3>20: Receive amateur packet radio</h3><p>In the 2-meter amateur band, there are certain frequencies for the “Automatic Packet Reporting System”. It’s a bit like IP – packets have a “from” and a “to”. They can also broadcast their position, or weather data.</p><p>Some stations seem to announce themselves as repeaters, which probably help forward the packets to increase the range.</p><p>And two people seemed to be on a “fieldday”, and broadcasted their location. :D</p><p>SDRangel can create a map automatically:</p><p>I started the day by building an antenna!</p><p>This was going to be a simple “random wire” antenna, to allow me to get better reception in the lower frequencies, which I’ve omitted so far (because I knew it would be much more fun with a better antenna)!</p><p>I measured out 21.6 m of wire (which for ✨magic✨ reasons seem to be a good universal antenna length)…</p><p>…directly attached it to the center of another SMA connector…</p><p>…and draped it all around my room!</p><p>People on the Internet say that there are many problems with this – that it would be better to have it outside, and that there’s an impedance mismatch between the receiver and the wire.</p><p>I could address those problems, but I wanna try how well this works first :)</p><h3>21: Receive Morse code from other countries</h3><ul><li> 10.10-10.13 MHz</li><li> CW (“continuous wave”)</li></ul><p>On the 30-meter amateur band, I found people sending Morse code! :O</p><p>I’d been learning it a little bit, so if I recorded it and slowed it down, I could understand it: They’re sending their callsigns. These are from Belgium, France, and Italy! \\o/</p><p>I compared to my 2-meter dipole antenna, and the reception was definitely better – I can pick up more transmissions, and with much less noise!</p><h3>22: Receive maritime weather reports</h3><p>The German Weather Service broadcasts maritime information throughout the day on various shortwave frequencies.</p><p>They use a protocol called RTTY (radioteletype), and it took me a while to decode it. But I found a neat little program called <a href=\"https://en.wikipedia.org/wiki/Fldigi\">“fldigi”</a>: You can pipe audio to it (single side band modulation), and then if you pick the correct settings (see screenshot), it happily transcribes the messages!</p><p>Here’s the station weather reports for the Baltic Sea and Northern Sea!</p><h3>23: Receive digimodes from other countries</h3><ul><li> 10.130-10.15 MHz</li></ul><p>I found some other strange signals on the 30-meter band. The Signal Identification Wiki was really helpful for figuring out what they were: <a href=\"https://www.sigidwiki.com/wiki/FT8\">FT8!</a></p><p>FT8 is quite a new protocol, invented in 2017, and it seems to be super popular right now! It allows you to transmit short messages, and again, people are looking for people to talk to (CQ), saying how well they receive each other, or saying goodbye (73).</p><h3>24: Detect whether your notebook is charging</h3><p>As I was browsing the very low-frequency bands, I had a strange problem: Sometimes, that would work okayish, sometimes I could even make out voices!</p><p>But other times, it wouldn’t work at all, and everything would be loud, angry noise. Even in regions where I had better reception before!</p><p>Eventually, I found out how to solve that issue – by unplugging my notebook charger. D’oh! :D</p><h3>25 &amp; 26: See ionosondes and radar signals</h3><p>In the low frequencies, occasionally, you can hear a short ! :D These are caused by ionosondes, scientific instruments which measure the properties of the ionosphere by sweeping a wide frequency spectrum.</p><p>Another signal (which I accidentally got in the same screenshot) is a radar system – in this case, according to the Signal Identification Wiki, it’s a <a href=\"https://www.sigidwiki.com/wiki/CODAR\">“CODAR”</a> system, used to measure the motion of water waves and currents along coasts! :O</p><h3>27: Listen to “single side band” conversations</h3><ul><li> SSB (“single side band”)</li></ul><p>How do you transmit speech over long distances? You can use “amplitude modulation”, where you change the volume of the carrier frequency to model your audio.</p><p>As a side effect, the bands to the sides of the carrier will contain a signal, as well.</p><p>One trick is to transmit  those sidebands, which saves power! But you have to “guess” the base frequency when listening. Depending on which part you transmit, this is called “lower side band” or “upper side band”.</p><p>SDR++ makes it very easy to play with this! :) Here’s someone from Serbia!</p><h3>28: Listen to AM radio from the other side of the world</h3><p>At night, low-frequency radio waves can travel further around the world, because they’re reflected by the layers of the ionosphere! There’s something magical about this.</p><p>I put my antenna outside, and I could hear  of broadcasting stations! On <a href=\"https://www.short-wave.info\">short-wave.info</a>, you can look up where they are located.</p><p>Some stations in China are broadcasting with very high power! Some I could hear were over 7500 km away.</p><p>Wow. It’s full of stars! 🌌</p><p>Originally, I had planned the project to run from Monday to Friday. When I still had 32 things to do in Friday morning, I knew I’d need to extend it. But I hadn’t run out of ideas yet:</p><ul><li> 26.965-27.405 MHz</li></ul><p>After I’d looked into the low frequencies on Thursday, I went to a higher band again: The Citizens Band!</p><p>This is the third frequency band I’m aware of where anyone is allowed to transmit – provided that you use a licensed device!</p><p>This is a band where my random wire antenna really came in handy. Without it, I would have had a hard time understanding anything. And even with it, transmissions are extremely noisy.</p><p>CB radio is used internationally, especially by truck drivers, it seems.</p><h3>30: Assess the propagation of radio waves using beacons</h3><ul><li> 14.100, 18.110, 21.150, 24.930, and 28.200 MHz</li></ul><p>The International Beacon Project runs a network of 18 stations, which take turns transmitting their callsigns at certain frequencies.</p><p>Using this system, you can quickly get a sense of how well radio waves are currently propagating to your location. Clever!</p><p>I picked up the beacon from southern Finland! You can see its callsign scrolling away in the video. It’s followed by four dashes send with decreasing power. I only heard the first one…</p><h3>31: Receive a time signal</h3><ul></ul><p>I would’ve loved to receive DCF77, which powers the radio clocks in Germany! But no matter how hard I listened to 77.5 kHz, there was nothing there. I don’t think my dongle can do that.</p><p>So I used higher frequencies! Russia transmits its “RWM” time signal at 9996 kHz, which beeps every second, with a long beep for the full minute.</p><p>Not enough to tell the time, but enough to adjust your wrist watch, I guess!</p><h3>32: Receive a weather fax</h3><p>The German Weather Service broadcasts weather maps throughout the day! You can decode them using fldigi’s “WEFAX-576” setting.</p><p>I caught this one only halfway through. According to the schedule, it’s the “Surface weather chart North Atlantic, Europe”!</p><p>If you squint  hard, you can make out the coast of Spain and the Mediterranean Sea on the right side!</p><h3>33: Decode images from a weather satellite!</h3><ul><li> 137.62, 137.9125, and 137.1 MHz</li></ul><p>I couldn’t stop trying to capture a weather satellite, it’s just too cool to receive an image from space!</p><p>That evening, an American satellite called NOAA-15 passed right over us, so I thought I’d try again. And this time, I got parts of an image! \\o/</p><p>This is real-time data! At night, both transmitted images are infrared recordings.</p><p>I recorded the FM signal using SDR++, and then decoded the image using <a href=\"https://noaa-apt.mbernardi.com.ar\">noaa-apt</a>, which also added country outlines.</p><h3>34: Estimate the speed of satellites</h3><p>Here’s what the NOAA-15 weather satellite sounds like, by the way! </p><p>While recording, I noticed something strange: The transmission didn’t happen at the frequency I had expected it to! And also, the frequency changed.</p><p>Then it hit me: Doppler effect! At the time of the recording, the frequency was around 4250 Hz higher than expected.</p><p>After looking up the formula, I calculated a relative speed of 9 km/s! (Which got close to its real speed, 7.5 km/s.)</p><h3>35: Listen to number stations</h3><ul><li> Differs by station</li></ul><p>These stations send encrypted messages using number sequences, possibly for espionage purposes!</p><p>So why not listen to one? There’s a surprisingly well-maintained database of them on a site call <a href=\"https://priyom.org/number-stations/station-schedule\">Priyom</a>.</p><p>So I tuned into the next frequency that was listed, and: Bingo!</p><p>Allegedly, this was a <a href=\"https://priyom.org/number-stations/morse/m12\">station in Moscow</a>. That day, it sent “218, 218, 218” in a loop, followed by three long beeps, which is the format of a “null message”.</p><p>So no news for the Russian spies.</p><p>The week was really intense for me. Initially, I thought I’d do 10 things per day, but it turned out that that was too much. I had to learn so many new things.</p><p>Many things I tried don’t work on my first attempt. Finding LoRaWAN signals, decoding packet radio, finding something on PMR446, decoding the satellite – those were all things that required a second (or third) attempt.</p><p>This project was exhausting, but also joyful – having committed to it, I got in a nice flow state, where I could focus on it for hours.</p><p>Often, I thought: “Okay, this is it. I can’t possibly find more things.” But this is the power of the 50 Things technique: I have to keep looking, leave my comfort zone, be creative, try things I otherwise wouldn’t have tried!</p><h3>36: Receive images from amateur radio operators</h3><ul><li> 14.230, 14.233, 21.340, 28.680, 145.625 MHz seem to be popular</li></ul><p>Using a protocol called “SSTV” (slow-scan television), amateur radio operators send each other postcards! :D</p><p>I’ve been browsing the usual frequencies, and tried to decode images using the software QSSTV on Linux. And I accidentally caught a piece of what seems to be a test image!</p><p>SSTV has the prettiest noise! :3</p><ul><li> Upper side band</li></ul><p>There’s a mysterious Russian station broadcasting at 4625 kHz. Sometimes, it sends encrypted voice messages.</p><p>But usually, all it does is send a honking sound every two seconds, to deter other stations from using the same frequency.</p><p>The purpose of the station is unclear, but most theories think it’s military communication.</p><h3>38: Catch a LoRaWAN chirp</h3><ul><li> 868.1-868.5 MHz</li></ul><p>This was a bit like trying to catch a rare insect! 🐛</p><p>LoRaWAN is a low-power, wide-area networking protocol, intended for “Internet of Things” applications.</p><p>You can see transmission in the lower half of the screenshot! It has a very cute structure: You can see eight “down-chirps”, followed by two “up-chirps”. That’s the header, followed by the payload.</p><p>To look for the signal, I made a “baseband capture” in SDR++, and opened the recording in <a href=\"https://www.sonicvisualiser.org\">Sonic Visualizer</a>.</p><h3>39: Read data from utility meters</h3><p>Devices like smoke detectors or meters for water or heat are sending their readings via a protocol called Wireless M-Bus.</p><p>Again, I was surprised by how many devices seem to be around! Thanks for the tip, @envy :)</p><p><a href=\"https://wmbusmeters.org\">wmbusmeters</a> is a really nice tool for decoding the messages.</p><p>The chips in my SDR stick are also being used in DVB-T dongles! So, can we watch TV? Unfortunately, no.</p><p>From what I pieced together, there’s a difference between using the stick in SDR mode (where it sends the full spectrum), and in TV mode (where it sends the decoded video).</p><p>In Germany, there’s now DVB-T2, which my hardware doesn’t support in TV mode. And in SDR mode, the bandwidth is too narrow for DVB-T2. But we can scroll over a channel and look at it! :3</p><ul><li> 433.05-434.79 MHz</li></ul><p>Did a little walk to a big intersection, to see what “device signals” I’d find there at 433 MHz.</p><p>I could confirm that the IBIS beacons are in fact being sent by buses! The included “vehicle ID” even matches the white number that’s printed on it.</p><p>I also saw some messages from tire pressure monitoring systems in cars! They also include an ID, and usually, the brand of the car! The owners probably aren’t aware how easy it would be to track them… (Thanks, @scy!)</p><p>Side note: I wonder why some signals in that band are warped like the one at 433.96 MHz here!</p><p>At first, I thought “Ah, Doppler effect again, it’s coming from a moving car!” But if that’d be the case, that car would be moving at over 700 m/s…</p><p>Friends later suspected that this effect is due to weak batteries affecting the crystal in the sending devices, or temperature changes.</p><h3>42: Receive Morse code from a satellite!</h3><ul><li> 145.860 (status information) and 145.960 (beacon)</li></ul><p>So I caught a satellite again! :D This time, it was school project, the Italian satellite “Max Valier”. It continuously sends Morse code on a beacon frequency.</p><p>Pretty weak signal, but here’s what I could hear:</p><p><code>\n3MV MAX VALIER SAT ... MANFRED ES CHRISTA FUKSE 73 ... II3MV ...\n</code></p><p>Super happy about this! I got both the name of the satellite, as well as its callsign at the end, and what seems to be some kind of greeting? I later learned that  is Morse code shorthand for “and”, and that Manfred and Christa Fuchs were the founders of a company that helped launch the satellite!</p><p>(Thanks for the tip, @manawyrm!)</p><p>This is another thing that’s not allowed in Germany, so you shouldn’t do it.</p><p>Pagers use a format called “POCSAG” (Post Office Code Standardisation Advisory Group…), which you should not decode using multimon-ng.</p><p>Because you would find that the content is short and cryptic anyway. It would probably be repeated by several stations all around you, to make sure the whole region is covered.</p><p>Do not read the English Wikipedia page! It contains frequencies!</p><p>At this point, I was pretty tired. Focusing on this project for 6 days straight took a lot of energy, and I was always uncertain if I could actually complete all 50 things in that week! But I woke up with a fun idea:</p><h3>44: Detect when a smartphone is turned on</h3><p>I was curious whether I could see the NFC transceiver in my smartphone! And yeah, especially using my random wire antenna, this works really well!</p><p>My smartphone seems to emit at the NFC frequency a couple of times per second. And when unlocking the screen, it emits five very strong beeps on that frequency! I can see those from the other side of our apartment.</p><p>Surely, these signals are the same for every device, right? 😶</p><p>Observe the five beeps here:</p><p><a href=\"https://chaos.social/@piko\">Piko</a> and I played around with NFC a bit more, and we found out that when getting close to an NFC tag, a smartphone emits at 13.56 MHz continuously!</p><p>So, we started sending Morse code to each other between rooms, using a smartphone and a library book! :’D</p><p>Take that, Bundesnetzagentur!</p><p>Seems that the shortest signal you can create is 0.7 s long, resulting in a meager communication speed of 3-4 words per minute…</p><h3>46: Receive navigational aids for airplanes</h3><ul><li> 108.00-117.95 MHz</li></ul><p>There are ground stations that emit a signal that allow calculating your angle relative to it! If you receive two, you can determine your position. (Thanks, @fly_it!)</p><p>I heard the one close to Hamburg! And SDRangel has a decoder, of course! It calculated angles between 210° and 230°, which is pretty close to the actual value of 224°! I don’t think they are meant to be used from the ground.</p><p>I spent ages trying to build my own decoder in GNU Radio. But I wasn’t familiar with it at all, and I eventually gave up. Still, that seems to be the software you wanna learn for tasks like these!</p><p>By the way, how the ground stations work is fascinating: In my case, it’s a “Doppler VOR”: It transmits a static frequency via amplitude modulation, and adds another signal that moves around in circles, so you get a Doppler frequency shift.</p><p>If you compare the two, you can calculate the angle!</p><h3>47: See how low you can go in the frequency spectrum</h3><p>This was a fun exploration: What’s the lowest-frequency broadcast I can receive?</p><p>The RTL-SDR Blog V4 stick I’m using has a neat feature – a built-in “upconverter”, which is enabled automatically when you try to listen to frequencies below what the chipset supports. This allows it to receive down to ~500 kHz!</p><p>The first stations that are comprehensible started at 1 MHz for me.</p><h3>48: See how high you can go in the frequency spectrum</h3><p>The chipset in my SDR stick go up to maximum frequency of 1766 MHz. It seems pretty quiet up there, probably because I lack proper antennas. I found these three lines in an amateur band, but they probably originate from the stick itself, or another device.</p><p>So the highest-frequency thing I’ve received is ADS-B at 1090 MHz (see entry #5)! 🎉</p><h3>49: Listen to marine radio</h3><p>We’ve been over this. Not allowed in Germany. Don’t do it. ⛔</p><p>But if you’re in the US, anyone can purchase a marine radio, and even use it to transmit! :D</p><p>Just now, I was wondering whether there are any Android apps for controlling SDRs.</p><p>And it turned out, the software I liked best that week, SDR++, had an <a href=\"https://www.sdrpp.org/nightly\">Android version</a> since a couple of weeks! \\o/</p><p>So now I could go track down the source of some of these strange signals! :3</p><p>And with that, … 🥁 … I was officially done with my “50 things to do with a software defined radio”! 🎉</p><p>This were seven very intense days, where I learned a lot of new things about radio waves and the many things they can be used for!</p><p>I was proud! I was tired! I was amazed that all those things I received are all around us, everywhere, all at once – if you know where to look. :O</p><p>Here’s some things that I haven’t tried or that haven’t worked:</p><ul><li>Receiving digital voice modes (SDRangel should be able to do it, but I couldn’t figure it out)</li><li>Receive something from the ISS</li><li>Use the GRAVES radar to detect meteors (couldn’t detect it)</li><li>Receive videos on ham bands</li><li>Receive Iridium satellites</li><li>Listen to pirate stations</li></ul><p>Also, doing things with Wi-Fi/Bluetooth/Zigbee could be fun, but I’d need a more expensive receiver for those frequencies.</p><p>So, was this project in fact a gateway drug to getting an amateur radio license?</p><p>Yeah, probably. I’d love to transmit something and experiment more! :D</p><p>In Germany, a new license class will be introduced in summer 2024, that’ll allow you to send on the 10-meter, 2-meter and 70-cm bands (the “N class”).</p><p>In fact, there’s a really good German online course that teaches you everything you need to know: <a href=\"https://50ohm.de\">50ohm.de</a></p><p>Highly recommended, even if you’re not planning on getting a license.</p><p>Finally, thanks to Piko, Chris, and Cqoicebordel for proof-reading this blog post! &lt;3</p><p>\n                        You can add your comment\n                        <a href=\"https://chaos.social/@blinry/112036984423655020\" target=\"_blank\">in the Fediverse</a>!\n                        Alternatively, drop me a mail at @blinryorg.\n                        Also, you can support me\n                        <a href=\"https://www.patreon.com/blinry\" target=\"_blank\">on Patreon</a> or\n                        subscribe to <a href=\"https://tinyletter.com/blinry\" target=\"_blank\">my newsletter</a></p>","contentLength":31413,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=45262835"}],"tags":["dev"]}