{"id":"Y2iXpRRkNSntTpeaFAt3z4Ag9Yx4KEEDB3zR9csfJQqv6","title":"Krebs on Security","displayTitle":"Security News","url":"https://krebsonsecurity.com/feed/","feedLink":"https://krebsonsecurity.com/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"ClickFix: How to Infect Your PC in Three Easy Steps","url":"https://krebsonsecurity.com/2025/03/clickfix-how-to-infect-your-pc-in-three-easy-steps/","date":1741990527,"author":"BrianKrebs","guid":717,"unread":true,"content":"<p>A clever malware deployment scheme <a href=\"https://krebsonsecurity.com/2024/09/this-windows-powershell-phish-has-scary-potential/\" target=\"_blank\" rel=\"noopener\">first spotted in targeted attacks last year</a> has now gone mainstream. In this scam, dubbed “,” the visitor to a hacked or malicious website is asked to distinguish themselves from bots by pressing a combination of keyboard keys that causes  to download password-stealing malware.</p><p>ClickFix attacks mimic the “Verify You are a Human” tests that many websites use to separate real visitors from content-scraping bots. This particular scam usually starts with a website popup that looks something like this:</p><div><img aria-describedby=\"caption-attachment-68856\" decoding=\"async\" src=\"https://krebsonsecurity.com/wp-content/uploads/2024/09/verifyhuman.png\" alt=\"\" width=\"783\" height=\"397\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2024/09/verifyhuman.png 783w, https://krebsonsecurity.com/wp-content/uploads/2024/09/verifyhuman-768x389.png 768w\" sizes=\"(max-width: 783px) 100vw, 783px\"><p>This malware attack pretends to be a CAPTCHA intended to separate humans from bots.</p></div><p>Clicking the “I’m not a robot” button generates a pop-up message asking the user to take three sequential steps to prove their humanity.</p><div><img aria-describedby=\"caption-attachment-70703\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/verifsteps.png\" alt=\"\" width=\"624\" height=\"339\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/verifsteps.png 624w, https://krebsonsecurity.com/wp-content/uploads/2025/03/verifsteps-370x200.png 370w\" sizes=\"(max-width: 624px) 100vw, 624px\"><p>Executing this series of keypresses prompts Windows to download password-stealing malware.</p></div><p>Step 1 involves simultaneously pressing the keyboard key with the Windows icon and the letter “R,” which opens a Windows “Run” prompt that will execute any specified program that is already installed on the system.</p><p>Step 2 asks the user to press the “CTRL” key and the letter “V” at the same time, which pastes malicious code from the site’s virtual clipboard.</p><p>Step 3 — pressing the “Enter” key — causes Windows to download and launch malicious code through “,” a Windows program designed to run Microsoft HTML application files.</p><p>“This campaign delivers multiple families of commodity malware, including XWorm, Lumma stealer, VenomRAT, AsyncRAT, Danabot, and NetSupport RAT,”  wrote in <a href=\"https://www.microsoft.com/en-us/security/blog/2025/03/13/phishing-campaign-impersonates-booking-com-delivers-a-suite-of-credential-stealing-malware/\" target=\"_blank\" rel=\"noopener\">a blog post</a> on Thursday. “Depending on the specific payload, the specific code launched through mshta.exe varies. Some samples have downloaded PowerShell, JavaScript, and portable executable (PE) content.”</p><p>According to Microsoft, hospitality workers are being tricked into downloading credential-stealing malware by cybercriminals impersonating . The company said attackers have been sending malicious emails impersonating Booking.com, often referencing negative guest reviews, requests from prospective guests, or online promotion opportunities — all in a bid to convince people to step through one of these ClickFix attacks.</p><p>In November 2024, KrebsOnSecurity reported that hundreds of hotels that use booking.com had been subject to targeted phishing attacks. Some of those lures worked, and allowed thieves to <a href=\"https://krebsonsecurity.com/2024/11/booking-com-phishers-may-leave-you-with-reservations/\" target=\"_blank\" rel=\"noopener\">gain control over booking.com accounts</a>. From there, they sent out phishing messages asking for financial information from people who’d just booked travel through the company’s app.</p><p>Earlier this month, the security firm <a href=\"https://arcticwolf.com/resources/blog/healthcare-sector-targeted-by-fake-captcha-attack-on-hep2go-to-deliver-infostealer-malware/\" target=\"_blank\" rel=\"noopener\">warned</a> about ClickFix attacks targeting people working in the healthcare sector. The company said those attacks leveraged malicious code stitched into the widely used physical therapy video site HEP2go that redirected visitors to a ClickFix prompt.</p><p>An <a href=\"https://www.hhs.gov/sites/default/files/clickfix-attacks-sector-alert-tlpclear.pdf\" target=\"_blank\" rel=\"noopener\">alert</a> (PDF) released in October 2024 by the <strong>U.S. Department of Health and Human Services</strong> warned that the ClickFix attack can take many forms, including fake  error pages and popups that spoof .</p><div><img aria-describedby=\"caption-attachment-70706\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/hhs-clickfix.png\" alt=\"\" width=\"1172\" height=\"745\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/hhs-clickfix.png 1172w, https://krebsonsecurity.com/wp-content/uploads/2025/03/hhs-clickfix-768x488.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/03/hhs-clickfix-782x497.png 782w\" sizes=\"(max-width: 1172px) 100vw, 1172px\"><p>ClickFix tactic used by malicious websites impersonating Google Chrome, Facebook, PDFSimpli, and reCAPTCHA. Source: Sekoia.</p></div><p>The ClickFix attack — and its reliance on mshta.exe — is reminiscent of phishing techniques employed for years that hid exploits inside . Malicious macros became such a common malware threat that Microsoft was forced to start blocking macros by default in Office documents that try to download content from the web.</p><p>Alas, the email security vendor  has <a href=\"https://www.proofpoint.com/us/blog/threat-insight/security-brief-clickfix-social-engineering-technique-floods-threat-landscape\" target=\"_blank\" rel=\"noopener\">documented</a> plenty of ClickFix attacks via phishing emails that include HTML attachments spoofing Microsoft Office files. When opened, the attachment displays an image of Microsoft Word document with a pop-up error message directing users to click the “Solution” or “How to Fix” button.</p><div><a href=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/proofpoint-clickfix.png\" target=\"_blank\" rel=\"noopener\"><img aria-describedby=\"caption-attachment-70707\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/proofpoint-clickfix.png\" alt=\"\" width=\"749\" height=\"278\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/proofpoint-clickfix.png 1294w, https://krebsonsecurity.com/wp-content/uploads/2025/03/proofpoint-clickfix-768x285.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/03/proofpoint-clickfix-782x290.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\"></a><p>HTML files containing ClickFix instructions. Examples for attachments named “Report_” (on the left) and “scan_doc_” (on the right). Image: Proofpoint.</p></div><p>Organizations that wish to do so can take advantage of <a href=\"https://m.majorgeeks.com/content/page/disable_run_command.html\" target=\"_blank\" rel=\"noopener\">Microsoft Group Policy restrictions</a> to prevent Windows from executing the “run” command when users hit the Windows key and the “R” key simultaneously.</p>","contentLength":4201,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Microsoft: 6 Zero-Days in March 2025 Patch Tuesday","url":"https://krebsonsecurity.com/2025/03/microsoft-6-zero-days-in-march-2025-patch-tuesday/","date":1741737181,"author":"BrianKrebs","guid":716,"unread":true,"content":"<p> today issued more than 50 security updates for its various  operating systems, including fixes for a whopping <em>six zero-day vulnerabilities</em> that are already seeing active exploitation.</p><p>Two of the zero-day flaws include <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-24991\" target=\"_blank\" rel=\"noopener\">CVE-2025-24991</a> and <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-24993\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https://www.google.com/url?q=https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-24993&amp;source=gmail&amp;ust=1741811978241000&amp;usg=AOvVaw08YeX5TKKSxWlXHXx6FFHl\">CVE-2025-24993</a>, both vulnerabilities in , the default file system for Windows and Windows Server. Both require the attacker to trick a target into mounting a malicious virtual hard disk. CVE-2025-24993 would lead to the possibility of local code execution, while CVE-2025-24991 could cause NTFS to disclose portions of memory.</p><p>Microsoft credits researchers at  with reporting the zero-day bug labeled <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-24983\" target=\"_blank\" rel=\"noopener\">CVE-2025-24983</a>, an elevation of privilege vulnerability in older versions of Windows. ESET said the exploit was deployed via the <a href=\"https://www.kaspersky.com/about/press-releases/kaspersky-uncovers-pipemagic-backdoor-attacks-businesses-through-fake-chatgpt-application\" target=\"_blank\" rel=\"noopener\">PipeMagic backdoor</a>, capable of exfiltrating data and enabling remote access to the machine.</p><p>ESET’s said the exploit in the wild targets only older versions of Windows OS: Windows 8.1 and Server 2012 R2. Although still used by millions, security support for these products ended more than a year ago, and mainstream support ended years ago. However, ESET notes the vulnerability itself also is present in newer Windows OS versions, including  and the still-supported .</p><p>Rapid7’s lead software engineer  said  and  onwards are not listed as receiving patches, so are presumably not vulnerable.</p><p>“It’s not clear why newer Windows products dodged this particular bullet,” Barnett wrote. “The Windows 32 subsystem is still presumably alive and well, since there is no apparent mention of its demise on the Windows client OS deprecated features list.”</p><p>The zero-day flaw <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-24984\" target=\"_blank\" rel=\"noopener\">CVE-2025-24984</a> is another NTFS weakness that can be exploited by inserting a malicious USB drive into a Windows computer. Barnett said Microsoft’s advisory for this bug doesn’t quite join the dots, but successful exploitation appears to mean that portions of heap memory could be improperly dumped into a log file, which could then be combed through by an attacker hungry for privileged information.</p><p>“A relatively low CVSSv3 base score of 4.6 reflects the practical difficulties of real-world exploitation, but a motivated attacker can sometimes achieve extraordinary results starting from the smallest of toeholds, and Microsoft does rate this vulnerability as important on its own proprietary severity ranking scale,” Barnett said.</p><p>Another zero-day fixed this month — <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-24985\" target=\"_blank\" rel=\"noopener\">CVE-2025-24985</a> — could allow attackers to install malicious code. As with the NTFS bugs, this one requires that the user mount a malicious virtual hard drive.</p><p>The final zero-day this month is <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2025-26633\" target=\"_blank\" rel=\"noopener\">CVE-2025-26633</a>, a weakness in the <strong>Microsoft Management Console</strong>, a component of Windows that gives system administrators a way to configure and monitor the system. Exploiting this flaw requires the target to open a malicious file.</p><p>This month’s bundle of patch love from Redmond also addresses six other vulnerabilities Microsoft has rated “critical,” meaning that malware or malcontents could exploit them to seize control over vulnerable PCs with no help from users.</p><p>Barnett observed that this is now the sixth consecutive month where Microsoft has published zero-day vulnerabilities on Patch Tuesday without evaluating any of them as critical severity at time of publication.</p><p>The&nbsp;<a href=\"https://isc.sans.edu/forums/diary/Microsoft%20Patch%20Tuesday%3A%20March%202025/31756/\" target=\"_blank\" rel=\"noopener\">SANS Internet Storm Center</a> has a useful list of all the Microsoft patches released today, indexed by severity. Windows enterprise administrators would do well to keep an eye on <a href=\"http://www.askwoody.com/\" target=\"_blank\" rel=\"noopener\">askwoody.com</a>, which often has the scoop on any patches causing problems. Please consider backing up your data before updating, and leave a comment below if you experience any issues applying this month’s updates.</p>","contentLength":3685,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Alleged Co-Founder of Garantex Arrested in India","url":"https://krebsonsecurity.com/2025/03/alleged-co-founder-of-garantex-arrested-in-india/","date":1741711742,"author":"BrianKrebs","guid":715,"unread":true,"content":"<p>Authorities in India today arrested the alleged co-founder of , a cryptocurrency exchange sanctioned by the U.S. government in 2022 for facilitating tens of billions of dollars in money laundering by transnational criminal and cybercriminal organizations. Sources close to the investigation told KrebsOnSecurity the Lithuanian national , 46, was apprehended while vacationing on the coast of India with his family.</p><div><img aria-describedby=\"caption-attachment-70665\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/Besciokov_Photo.png\" alt=\"\" width=\"462\" height=\"552\"><p>Aleksej Bešciokov, “proforg,” “iram”. Image: U.S. Secret Service.</p></div><p>On March 7, the <strong>U.S. Department of Justice</strong> (DOJ) unsealed <a href=\"https://www.justice.gov/media/1392316/dl\" target=\"_blank\" rel=\"noopener\">an indictment</a> against Besciokov and the other alleged co-founder of Garantex, , 40, a Russian national living in the United Arab Emirates.</p><p>Launched in 2019, Garantex was <a href=\"https://home.treasury.gov/news/press-releases/jy0701\" target=\"_blank\" rel=\"noopener\">first sanctioned</a> by the U.S. Treasury Office of Foreign Assets Control in April 2022 for receiving hundreds of millions in criminal proceeds, including funds used to facilitate hacking, ransomware, terrorism and drug trafficking. Since those penalties were levied, Garantex has processed more than $60 billion, according to the blockchain analysis company </p><p>“Garantex has been used in sanctions evasion by Russian elites, as well as to launder proceeds of crime including ransomware, darknet market trade and thefts attributed to North Korea’s Lazarus Group,” Elliptic wrote in <a href=\"https://www.elliptic.co/blog/elliptic-in-action-garantex\" target=\"_blank\" rel=\"noopener\">a blog post</a>. “Garantex has also been implicated in enabling Russian oligarchs to move their wealth out of the country, following the invasion of Ukraine.”</p><p>The DOJ alleges Besciokov was Garantex’s primary technical administrator and responsible for obtaining and maintaining critical Garantex infrastructure, as well as reviewing and approving transactions. Mira Serda is allegedly Garantex’s co-founder and chief commercial officer.</p><div><img aria-describedby=\"caption-attachment-70666\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/garantex-elliptic.png\" alt=\"\" width=\"747\" height=\"492\"></div><p>In conjunction with the release of the indictments, German and Finnish law enforcement seized servers hosting Garantex’s operations. A <a href=\"https://www.secretservice.gov/investigations/mostwanted/besciokov\" target=\"_blank\" rel=\"noopener\">“most wanted” notice</a> published by the  states that U.S. authorities separately obtained earlier copies of Garantex’s servers, including customer and accounting databases. Federal investigators say they also froze over $26 million in funds used to facilitate Garantex’s money laundering activities.</p><p>Besciokov was arrested within the past 24 hours while vacationing with his family in Varkala, a major coastal city in the southwest Indian state of Kerala. An officer with the local police department in Varkala confirmed Besciokov’s arrest, and said the suspect will appear in a Delhi court on March 14 to face charges.</p><div><img aria-describedby=\"caption-attachment-70667\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/kerala-shutterstock.png\" alt=\"\" width=\"749\" height=\"495\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/kerala-shutterstock.png 988w, https://krebsonsecurity.com/wp-content/uploads/2025/03/kerala-shutterstock-768x507.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/03/kerala-shutterstock-782x516.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\"><p>Varkala Beach in Kerala, India. Image: Shutterstock, Dmitry Rukhlenko.</p></div><p>The DOJ’s indictment says Besciokov went by the hacker handle “.” This nickname corresponds to the administrator of a 20-year-old Russian language forum dedicated to nudity and crudity called “.”</p><p>Besciokov and Mira Serda are each charged with one count of conspiracy to commit money laundering, which carries a maximum sentence of 20 years in prison. Besciokov is also charged with one count of conspiracy to violate the International Economic Emergency Powers Act—which also carries a maximum sentence of 20 years in person—and with conspiracy to operate an unlicensed money transmitting business, which carries a maximum sentence of five years in prison.</p>","contentLength":3238,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Feds Link $150M Cyberheist to 2022 LastPass Hacks","url":"https://krebsonsecurity.com/2025/03/feds-link-150m-cyberheist-to-2022-lastpass-hacks/","date":1741396805,"author":"BrianKrebs","guid":714,"unread":true,"content":"<p>In September 2023, KrebsOnSecurity published findings from security researchers who concluded that a series of six-figure cyberheists across dozens of victims resulted from thieves cracking master passwords stolen from the password manager service  in 2022. In a court filing this week, U.S. federal agents investigating a spectacular $150 million cryptocurrency heist said they had reached the same conclusion.</p><p>On March 6, federal prosecutors in northern California said they seized approximately $24 million worth of cryptocurrencies that were clawed back following a $150 million cyberheist on Jan. 30, 2024. The complaint refers to the person robbed only as “Victim-1,” but according to blockchain security researcher  the theft was perpetrated against , the co-founder of the cryptocurrency platform . ZachXBT was the <a href=\"https://x.com/zachxbt/status/1752694489905528943\" target=\"_blank\" rel=\"noopener\">first to report on the heist</a>.</p><p>This week’s action by the government merely allows investigators to officially seize the frozen funds. But there is an important conclusion in this seizure document: It basically says the  and the  agree with the findings of <a href=\"https://krebsonsecurity.com/2023/09/experts-fear-crooks-are-cracking-keys-stolen-in-lastpass-breach/\" target=\"_blank\" rel=\"noopener\">the LastPass breach story published here in September 2023</a>.</p><p>That piece quoted security researchers who said they were witnessing six-figure crypto heists several times each month that all appeared to be the result of crooks cracking master passwords for the password vaults stolen from LastPass in 2022.</p><p>“The Federal Bureau of Investigation has been investigating these data breaches, and law enforcement agents investigating the instant case have spoken with FBI agents about their investigation,” reads the seizure complaint, which was written by a U.S. Secret Service agent. “From those conversations, law enforcement agents in this case learned that the stolen data and passwords that were stored in several victims’ online password manager accounts were used to illegally, and without authorization, access the victims’ electronic accounts and steal information, cryptocurrency, and other data.”</p><p>“Based on this investigation, law enforcement had probable cause to believe the same attackers behind the above-described commercial online password manager attack used a stolen password held in Victim 1’s online password manager account and, without authorization, accessed his cryptocurrency wallet/account.”</p><p>Working with dozens of victims, security researchers  and  found that none of the six-figure cyberheist victims appeared to have suffered the sorts of attacks that typically preface a high-dollar crypto theft, such as the compromise of one’s email and/or mobile phone accounts, or SIM-swapping attacks.</p><p>They discovered the victims all had something else in common: Each had at one point stored their cryptocurrency seed phrase — the secret code that lets anyone gain access to your cryptocurrency holdings — in the “Secure Notes” area of their LastPass account prior to the 2022 breaches at the company.</p><p>Bax and Monahan found another common theme with these robberies: They all followed a similar pattern of cashing out, rapidly moving stolen funds to a dizzying number of drop accounts scattered across various cryptocurrency exchanges.</p><p>According to the government, a similar level of complexity was present in the $150 million heist against the Ripple co-founder last year.</p><p>“The scale of a theft and rapid dissipation of funds would have required the efforts of multiple malicious actors, and was consistent with the online password manager breaches and attack on other victims whose cryptocurrency was stolen,” the government wrote. “For these reasons, law enforcement agents believe the cryptocurrency stolen from Victim 1 was committed by the same attackers who conducted the attack on the online password manager, and cryptocurrency thefts from other similarly situated victims.”</p><p>Reached for comment, LastPass said it has seen no definitive proof — from federal investigators or others — that the cyberheists in question were linked to the LastPass breaches.</p><p>“Since we initially disclosed this incident back in 2022, LastPass has worked in close cooperation with multiple representatives from law enforcement,” LastPass said in a written statement. “To date, our law enforcement partners have not made us aware of any conclusive evidence that connects any crypto thefts to our incident. In the meantime, we have been investing heavily in enhancing our security measures and will continue to do so.”</p><p>On August 25, 2022,&nbsp;<strong>LastPass CEO Karim Toubba</strong> told users the company had detected unusual activity in its software development environment, and that the intruders stole some source code and proprietary LastPass technical information. On Sept. 15, 2022, LastPass said an investigation into the August breach determined the attacker did not access any customer data or password vaults.</p><p>But on Nov. 30, 2022, LastPass notified customers about another, far more serious security incident that the company said leveraged data stolen in the August breach. LastPass disclosed that criminal hackers had compromised encrypted copies of some password vaults, as well as other personal information.</p><p>Experts say the breach would have given thieves “offline” access to encrypted password vaults, theoretically allowing them all the time in the world to try to crack some of the weaker master passwords using powerful systems that can attempt millions of password guesses per second.</p><p>Researchers found that many of the cyberheist victims had chosen master passwords with relatively low complexity, and were among LastPass’s oldest customers. That’s because legacy LastPass users were more likely to have master passwords that were protected with far fewer “iterations,” which refers to the number of times your password is run through the company’s encryption routines. In general, the more iterations, the longer it takes an offline attacker to crack your master password.</p><p>Over the years, LastPass forced new users to pick longer and more complex master passwords, and they increased the number of iterations on multiple occasions by several orders of magnitude. But researchers found strong indications that LastPass never succeeded in upgrading many of its older customers to the newer password requirements and protections.</p><p>Asked about LastPass’s continuing denials, Bax said that after the initial warning in our 2023 story, he naively hoped people would migrate their funds to new cryptocurrency wallets.</p><p>“While some did, the continued thefts underscore how much more needs to be done,” Bax told KrebsOnSecurity. “It’s validating to see the Secret Service and FBI corroborate our findings, but I’d much rather see fewer of these hacks in the first place. ZachXBT and <a href=\"https://x.com/_SEAL_Org/status/1868805837311074576\" target=\"_blank\" rel=\"noopener\">SEAL 911&nbsp;reported yet another wave of thefts</a> as recently as December, showing the threat is still very real.”</p><p>Monahan said&nbsp;LastPass still hasn’t alerted their customers that their secrets—especially those stored in “Secure Notes”—may be at risk.</p><p>“Its been two and a half years since LastPass was first breached [and] hundreds of millions of dollars has been stolen from individuals and companies around the globe,” Monahan said. “They could have encouraged users to rotate their credentials. They could’ve prevented millions and millions of dollars from being stolen by these threat actors. But&nbsp; instead they chose to deny that their customers were are risk and blame the victims instead.”</p>","contentLength":7428,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Who is the DOGE and X Technician Branden Spikes?","url":"https://krebsonsecurity.com/2025/03/who-is-the-doge-and-x-technician-branden-spikes/","date":1741308880,"author":"BrianKrebs","guid":713,"unread":true,"content":"<p>At 49,  isn’t just one of the oldest technologists who has been involved in Elon Musk’s <strong>Department of Government Efficiency</strong> (DOGE). As the current director of information technology at  and an early hire at , , and , Spikes is also among Musk’s most loyal employees. Here’s a closer look at this trusted Musk lieutenant, whose Russian ex-wife was once married to Elon’s cousin.</p><div><img aria-describedby=\"caption-attachment-70586\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/x-spikes.png\" alt=\"\" width=\"591\" height=\"533\"><p>The profile of Branden Spikes on X.</p></div><p>When President Trump took office again in January, he put the world’s richest man — Elon Musk — in charge of the , and renamed the organization as DOGE. The group is reportedly staffed by <a href=\"https://www.nytimes.com/interactive/2025/02/27/us/politics/doge-staff-list.html\" target=\"_blank\" rel=\"noopener\">at least 50 technologists</a>, many of whom have ties to Musk’s companies.</p><p>DOGE has been enabling the president’s ongoing mass layoffs and firings of federal workers, largely by seizing control over computer systems and government data for a multitude of federal agencies, including the Social Security Administration, the Department of Homeland Security, the Office of Personnel Management, and the Treasury Department.</p><p>It is difficult to find another person connected to DOGE who has stronger ties to Musk than Branden Spikes. A native of California, Spikes initially teamed up with Musk in 1997 as a lead systems engineer for the software company Zip2, the first major venture for Musk. In 1999, Spikes was hired as director of IT at PayPal, and in 2002 he became just the fourth person hired at SpaceX.</p><p>In 2012, Spikes launched , a software product that sought to create a compartmentalized or “sandboxed” web browser that could insulate the user from malware attacks. A review of spikes.com in the Wayback Machine shows that as far back as 1998, Musk could be seen joining Spikes for team matches in the online games Quake and Quake II. In 2016, Spikes Security was merged with another security suite called Aurionpro, with the combined company renamed Cyberinc.</p><div><img aria-describedby=\"caption-attachment-70608\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/spikesquake.png\" alt=\"\" width=\"748\" height=\"682\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/spikesquake.png 879w, https://krebsonsecurity.com/wp-content/uploads/2025/03/spikesquake-768x700.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/03/spikesquake-782x713.png 782w\" sizes=\"(max-width: 748px) 100vw, 748px\"><p>A snapshot of spikes.com from 1998 shows Elon Musk’s profile in Spike’s clan for the games Quake and Quake II.</p></div><p>Spikes’s <a href=\"https://www.linkedin.com/in/brandenspikes/\" target=\"_blank\" rel=\"noopener\">LinkedIn profile</a> says he was appointed head of IT at X in February 2025. And although his name shows up on none of the lists of DOGE employees circulated by various media outlets, multiple sources told KrebsOnSecurity that Spikes was working with DOGE and operates within Musk’s inner circle of trust.</p><p>In a conversation with KrebsOnSecurity, Spikes said he is dedicated to his country and to saving it from what he sees as certain ruin.</p><p>“Myself, I was raised by a southern conservative family in California and I strongly believe in America and her future,” Spikes said. “This is why I volunteered for two months in DC recently to help DOGE save us from certain bankruptcy.”</p><p>Spikes told KrebsOnSecurity that he recently decided to head back home and focus on his job as director of IT at X.</p><p>“I loved it, but ultimately I did not want to leave my hometown and family back in California,” Spikes said of his tenure at DOGE. “After a couple of months it became clear that to continue helping I would need to move to DC and commit a lot more time, so I politely bowed out.”</p><p>Prior to founding Spikes Security, Branden Spikes was married to a native Russian woman named  whom he’d met at a destination wedding in South America in 2003.</p><p>Branden and Natalia’s names are both on the registration records for the domain name . This domain, which DomainTools.com says was originally registered by Branden in 2009, is the home of a tax-exempt charity in Los Angeles called the <a href=\"https://web.archive.org/web/20141221061648/http://www.russiancalifornia.org/\" target=\"_blank\" rel=\"noopener\"><strong>California Russian Association</strong></a>.</p><p>Here is a photo from a 2011 event organized by the California Russian Association, showing Branden and Natalia at one of its “White Nights” charity fundraisers:</p><div><img aria-describedby=\"caption-attachment-70585\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/spikes-heritage.png\" alt=\"\" width=\"749\" height=\"564\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/spikes-heritage.png 777w, https://krebsonsecurity.com/wp-content/uploads/2025/03/spikes-heritage-768x578.png 768w\" sizes=\"(max-width: 749px) 100vw, 749px\"><p>Branden and Natalia Spikes, on left, in 2011. The man on the far right is Ivan Y. Podvalov, a board member of the Kremlin-aligned Congress of Russian Americans (CRA). The man in the center is Feodor Yakimoff, director of operations at the Transib Global Sourcing Group, and chairman of the Russian Imperial Charity Balls, which works in concert with the Russian Heritage Foundation.</p></div><p>In 2011, the Spikes couple got divorced, and Natalia changed her last name to Haldeman. That is not her maiden name, which appears to be “Libina.” Rather, Natalia acquired the surname Haldeman in 1998, when she married Elon Musk’s cousin.</p><p> is the son of , who is the brother of Elon Musk’s mother, . Divorce records show Reeve and Natalia <a href=\"https://unicourt.com/case/ca-ora2-haldeman-v-haldeman-609208\" target=\"_blank\" rel=\"noopener\">officially terminated</a> their marriage in 2007. Reeve Haldeman did not respond to a request for comment.</p><p>A review of other domain names connected to Natalia Haldeman’s email address show she has registered more than a dozen domains over the years that are tied to the California Russian Association, and an apparently related entity called the <strong>Russian Heritage Foundation, Inc.</strong>:</p><p>russianamericans.org\nrussianamericanstoday.com<p>\nrussianamericanstoday.org</p>\nrussiancalifornia.org<p>\nrussianheritagefoundation.com</p>\nrussianheritagefoundation.org\nrussianwhitenights.org\nthegoldentearoom.com<p>\ntherussianheritagefoundation.org</p>\ntsarinahome.com</p><p>Ms. Haldeman did not respond to requests for comment. Her name and contact information appears in the registration records for these domains dating back to 2010, and <a href=\"https://projects.propublica.org/nonprofits/organizations/452775704 California Russian Foundation\" target=\"_blank\" rel=\"noopener\">a document</a> published by  show that by 2016 Natalia Haldeman was appointed CEO of the California Russian Foundation.</p><p>The domain name that bears both Branden’s and Natalia’s names — orangetearoom.com — features photos of Ms. Haldeman at fundraising events for the Russian foundation through 2014. Additional photos of her and many of the same people can be seen through 2023 at another domain she registered in 2010 — <strong>russianheritagefoundation.com</strong>.</p><div><img aria-describedby=\"caption-attachment-70630\" decoding=\"async\" loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/haldeman-mayemusk-1.png\" alt=\"\" width=\"750\" height=\"429\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2025/03/haldeman-mayemusk-1.png 1258w, https://krebsonsecurity.com/wp-content/uploads/2025/03/haldeman-mayemusk-1-768x439.png 768w, https://krebsonsecurity.com/wp-content/uploads/2025/03/haldeman-mayemusk-1-782x447.png 782w\" sizes=\"(max-width: 750px) 100vw, 750px\"><p>A photo from Natalia Haldeman’s Facebook page shows her mother (left) pictured with Maye Musk, Elon Musk’s mother, in 2022.</p></div><p>The photo of Branden and Natalia above is from one such event in 2011 (tied to russianwhitenights.org, another Haldeman domain). The person on the right in that image —  — appears in many fundraising event photos published by the foundation over the past decade. Podvalov is a board member of the <strong>Congress of Russian Americans</strong> (CRA), a nonprofit group that is known for vehemently opposing U.S. financial and legal sanctions against Russia.</p><p>Writing for  in 2022, journalist  described how the CRA has engaged in outright political lobbying, noting that the organization in June 2014 sent a letter to President Obama and the secretary of the United Nations, calling for an end to the “large-scale US intervention in Ukraine and the campaign to isolate Russia.”</p><p>“The US military contingents must be withdrawn immediately from the Eastern European region, and NATO’s enlargement efforts and provocative actions against Russia must cease,” the message read.</p><p>The Insider said the CRA director sent another two letters, this time to President Donald Trump, in 2017 and 2018.</p><p>“One was a request not to sign a law expanding sanctions against Russia,” Fishman <a href=\"https://theins.ru/en/politics/256825\" target=\"_blank\" rel=\"noopener\">wrote</a>. “The other regretted the expulsion of 60 Russian diplomats from the United States and urged not to jump to conclusions on Moscow’s involvement in the poisoning of Sergei Skripal.”</p><p>The nonprofit tracking website CauseIQ.com <a href=\"https://www.causeiq.com/organizations/russian-heritage-foundation,831537424/\" target=\"_blank\" rel=\"noopener\">reports</a> that The Russian Heritage Foundation, Inc. is now known as <strong>Constellation of Humanity</strong>.</p><p>The Russian Heritage Foundation and the California Russian Association both promote the interests of <a href=\"https://cepa.org/article/an-unorthodox-russian-vision-of-heaven-and-hell/\" target=\"_blank\" rel=\"noopener\">the Russian Orthodox Church</a>. <a href=\"https://web.archive.org/web/20141119232054/http://www.russiancalifornia.org/russian-orthodox-church-orange-county/\" target=\"_blank\" rel=\"noopener\">This page</a> indexed by Archive.org from russiancalifornia.org shows The California Russian Foundation organized a community effort to establish an Orthodox church in Orange County, Calif.</p><p>A press release from the <strong>Russian Orthodox Church Outside of Russia</strong> (ROCOR) shows that in 2021 the Russian Heritage Foundation <a href=\"https://www.rocorstudies.org/2021/03/09/russian-heritage-foundation-supports-our-work/\" target=\"_blank\" rel=\"noopener\">donated money</a> to organize a conference for the Russian Orthodox Church in Serbia.</p><p>A review of the “<a href=\"https://orangetearoom.com/index.php/network/about-us\" target=\"_blank\" rel=\"noopener\">Partners</a>” listed on the Spikes’ jointly registered domain — orangetearoom.com — shows the organization worked with a marketing company called . <a href=\"https://krebsonsecurity.com/2024/03/a-close-up-look-at-the-consumer-data-broker-radaris/\" target=\"_blank\" rel=\"noopener\">Reporting by KrebsOnSecurity last year</a> showed that Russian American Media also partners with the problematic people-search service , which was formed by two native Russian brothers in Massachusetts who have built a fleet of consumer data brokers and Russian affiliate programs.</p><p>When asked about his ex-wife’s history, Spikes said she has a good heart and bears no ill-will toward anyone.</p><p>“I attended several of Natalia’s social events over the years we were together and can assure you that she’s got the best intentions with those,” Spikes told KrebsOnSecurity. “There’s no funny business going on. It is just a way for those friendly immigrants to find resources amongst each other to help get settled in and chase the American dream. I mean, they’re not unlike the immigrants from other countries who come to America and try to find each other and help each other find others who speak the language and share in the building of their businesses here in America.”</p><p>Spikes said his own family roots go back deeply into American history, sharing that his 6th great grandfather was Alexander Hamilton on his mom’s side, and Jessie James on his dad’s side.</p><p>“My family roots are about as American as you can get,” he said. “I’ve also been entrusted with building and safeguarding Elon’s companies since 1999 and have a keen eye (as you do) for bad actors, so have enough perspective to tell you that Natalia has no bad blood and that she loves America.”</p><p>Of course, this perspective comes from someone who has the utmost regard for the interests of the “special government employee” Mr. Musk, who has been bragging about tossing entire federal agencies into the “wood chipper,” and who recently <a href=\"https://apnews.com/article/musk-chainsaw-trump-doge-6568e9e0cfc42ad6cdcfd58a409eb312\" target=\"_blank\" rel=\"noopener\">wielded an actual chainsaw</a> on stage while referring to it as the “chainsaw for bureaucracy.”</p><p>“Elon’s intentions are good and you can trust him,” Spikes assured.</p><p>A special note of thanks for research assistance goes to , an independent investigative journalist whose work has been published in The Guardian, Rolling Stone, POLITICO and The Intercept.</p>","contentLength":10055,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["security"]}